{"id":"1p6h999","name":"t3_1p6h999","subreddit":"relationship_advice","author":"Independent_Stage741","title":"I think I (32F) nuked my relationship with my boyfriend (32M) by drawing a hard line.","selftext":"My boyfriend and I have been together for nearly two years, living together for one. He had purchased his house prior to us dating, and I was renting an apartment, so it made sense for me to move in to his house. He continued to pay the mortgage and I took on all of the “usage” bills - all of the utilities and annual maintenance as well as the grocery shopping & we felt that it was a fair split. \n\nAs our anniversary is coming up we’ve been talking about our future timelines and where we see our relationship progressing. We’re on the same page with all the big ideas - we know we want to marry each other and start a family following that. But to be in a position to start a family, the house is going to need a lot of renovations & we’ve always thrown around the idea that the cost of renos would be my “buy-in” so to say on the house. From our estimates, everything we would want to do would be around $100k at the low end. We even agreed that we could draw up some kind of agreement to protect both of our interests financially.\n\nAs it’s gotten closer to reality of reaching out to contractors and banks I’ve felt more and more unsettled about the situation. I feel confident in our relationship, but foolish to be making an investment in a boyfriend’s asset. I told him that I would like to be engaged before starting this process so I feel like he’s making a commitment to me as much as I am.\n\nWe’ve talked about being engaged prior to this, but he said adding this element makes it feel very transactional and takes away the romance and sparkle of it all. I didn’t tell him I wanted to be engaged by a specific date or anything like that, just that if this renovation is what we wanted to pursue, this is the action I’d like to take before hand. He seemed upset by my statement and I feel like I really have taken some of the romance and surprise out of the idea of a proposal or being engaged.\n\nThe morning after this conversation was cold and tense and I can’t help but feel like I’ve done irreparable damage… but I don’t feel wrong in making the request. Am I being reasonable? Is this recoverable?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6h999/i_think_i_32f_nuked_my_relationship_with_my/","permalink":"/r/relationship_advice/comments/1p6h999/i_think_i_32f_nuked_my_relationship_with_my/","score":2438,"num_comments":1056,"over_18":false,"stickied":false,"created_utc":1764088760.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64imp","name":"t3_1p64imp","subreddit":"relationship_advice","author":"ZosoCub","title":"My (42M) Wife (34F) used Hinge while on a girls trip","selftext":"My (M,42) wife (F,34) (together for 10, married for 7) just returned from an overseas trip to Paris and London. She went with her married sister, to visit their married cousin and their divorced cousin who I guess is currently in a relationship. \n\nI picked her up from the airport today and everything seemed fine. While talking about her trip she mentioned that she got hit on, that a guy approached her and asked for her number and invited her back to his place, to which she responded “hell no”. \n\nI was curious to see if they had exchanged texts just to see what was said, assuming it happened exactly as she had said\n\nIn her texts I saw one from Hinge - the type of confirmation text when creating an account. I was beyond surprised, I started shaking. I checked her internet search history and there was one for “best dating apps in London”. \n\nI checked her app history and she downloaded it all the way back in Oct 2023 and even paid the $49 subscription fee. \n\nI looked further and saw that she also  downloaded Bumble as recently as March of this year. \n\nWe have 2 young girls and I love her so much. \n\nCan you think of any possibility other than emotional cheating?\n\nUpdate: What a relief! I know my wife very well and we have a very healthy relationship. I knew deep down she wasn’t capable of cheating, although I know that flirtatious DMs could have been a possibility. \n\nThe app download from 2023 and the paid subscription was for a friend. I remember she actually told me about that and I completely forgot about it, so that checks. \n\nThe Bumble in March was for meeting new friends but she said it was lame and gave up on it quick. \n\nThe search and use of Hinge over the weekend was to find out where people go out, since she wasn’t local. Her sister actually said it was a dumb idea, and they ultimately didn’t find what they were looking for. \n\nI know some of you will call me naive, but I never really thought it was a possibility in the first place. \n\nI was very aware of her disposition during our talk and at no time did she seem guilty. She seemed genuinely dumbfounded. \n\nThank you to all who offered words of wisdom and support.","url":"https://www.reddit.com/r/relationship_advice/comments/1p64imp/my_42m_wife_34f_used_hinge_while_on_a_girls_trip/","permalink":"/r/relationship_advice/comments/1p64imp/my_42m_wife_34f_used_hinge_while_on_a_girls_trip/","score":1195,"num_comments":412,"over_18":false,"stickied":false,"created_utc":1764049273.0,"edited":1764098910.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6clce","name":"t3_1p6clce","subreddit":"relationship_advice","author":"BluKandy888","title":"Boyfriend (49M) thinks I'm (50F) disgusting because I refuse to financially support his (25/M) son.","selftext":"So for background I (50F) was told by my boyfriend of 12yrs (49M) that his son (25M)was being evicted and coming to live with him (yes he has a job).my bf and i have a 12yr son together. My bf said that I was to be responsible for buying groceries and cooking for his 25yr son. I said that's not fair and I can't afford it.His son and I make the same amount of money, and now his son has no bills to pay. He can afford to buy his own food and he knows how to cook. I also have a 25y daughter who not only pays her own bills but she has type one diabetes pays almost 1k a month to stay alive. If I'm going to feed any 25yr old it's going to be her. So my bf, his 25yr son and I made an agreement. He would give me 5 dollars a day for dinner. So I started buying food and cooking for him and I didn't see a dollar for 2 weeks so one day he gives me 40 that's for 8 days of dinner and then another 2 weeks later nothing. So I stopped cooking and one day I bought pizza (i get pizza so my son and i have food when we do laundry the next day) and my bf calls his son to come and eat. I had it with being used and lied to. I said really..... guys it's not like he ate one piece he ate 8. So my boyfriend tells me the following day that I'm disgusting for being upset, I feel pretty disgusted with my boyfriend as a MAN??? If he wants to feed his 25yr son then he should pay for it as his Father. The 25yr is not  my responsibility and the 25yr son has told me im nothing to him... while I was cooking for him the 25yr was going out to eat and out on the town. While I was taking food from my 12yr growing sons mouth to give to the 25yr but I'm gross for putting my foot down. My boyfriend said how would you feel if that was our 12yr old???  my 12yr old is 12 not 25yrs old with a full time job and a kid to take care of. I don't feed my 25yr daughter who lives alone. You know what the best part is my boyfriend didn't offer to give me money to pay for his son, or cook dinner for him himself. My boyfriend can afford to buy breakfast and lunch for his friends he makes good money. But I'm the gross one? Or do you think I'm right for standing up for my financial freedom here. I work hard for my money, I pay all of my bill and for stuff for me and my 12yr son nothing gets paid for me. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6clce/boyfriend_49m_thinks_im_50f_disgusting_because_i/","permalink":"/r/relationship_advice/comments/1p6clce/boyfriend_49m_thinks_im_50f_disgusting_because_i/","score":642,"num_comments":220,"over_18":false,"stickied":false,"created_utc":1764077741.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p680q5","name":"t3_1p680q5","subreddit":"relationship_advice","author":"Beginning-Change-458","title":"I a 36F am dating a divorced dad with kids 42M. I need someone to snap me into reality?","selftext":"hello! I am a 36 year old female, I have been on and off with my boyfriend for about 1.5 years. he had just gotten out of a 15 year marriage. he finalized the divorce 5 months before we got together. he has two kids and a vasectomy, I have no kids, never been married, and just froze my eggs. he is aware of this, first 6 months together he was amazing, talking about building a family together, selling his house and buying a new one, and including me in activities with his kids. we got in a big fight in June and then again in July, he has not wanted to commit, tells people we are broken up, but still calls me everyday and texts me. still wants to see me once maybe twice a week when he doesn’t have his kids. sometimes he still talks about a future with me and reversing his vasectomy. I think I’m being strung along and used, when I type out the facts there’s no denying it. because of my age i am just clinging on to this wanting this to be my personal. everytime I approach talking about a future and my wants and needs he gets defensive and puts the focus back on me and things I’ve done. What is a good way to approach a conversation with him letting him know what I want and need and that I don’t want to continue this in between if he isn’t capable of ever giving it to me?","url":"https://www.reddit.com/r/relationship_advice/comments/1p680q5/i_a_36f_am_dating_a_divorced_dad_with_kids_42m_i/","permalink":"/r/relationship_advice/comments/1p680q5/i_a_36f_am_dating_a_divorced_dad_with_kids_42m_i/","score":200,"num_comments":180,"over_18":false,"stickied":false,"created_utc":1764062439.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mmbx","name":"t3_1p6mmbx","subreddit":"relationship_advice","author":"Hopeful-Background91","title":"GF (25F) goes on “not dates” with male friends and I (24M) dont love it, she says I’m insecure","selftext":"We’ve been together six months. She had a lot of male friends before we met due to her work and hobbies being more male than female, not an issue. But I didn’t realise the extent to which she hangs out with them 1-on-1.\n\nFor example, she just started a new job a couple of months ago. She hasn’t told any of her colleagues about us because I work in the same field and sometimes our companies work together, and she wants to remain professional. She made a new male friend, no biggy, everyone has friends at work. But they’ve been to see movies together, get food together, go on drives together. I brought it up and she said “We’re just friends because he’s nice to me. He has a long term girlfriend. If you don’t trust that I can hang out with friends then do you believe I actually like you? I have loads of male friends and always have, do you expect me to just drop them?”.\n\nI kind of get her point, but at the same time it just hurts my stomach every time she tells me what she’s been up to with one of her pals. I feel like an idiot who’s being strung along. She’s really sweet so I don’t think she’s doing it on purpose, I think she genuinely believes this is fine. From my point of view, I think it would be outrageous for me to be in a committed relationship and make one on one plans with new female friends and I would never do it. I’m really struggling. I even feel ridiculous that I feel ‘threatened’, it’s like a lose-lose. Is this reconcilable or a fundamentally different mindset?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6mmbx/gf_25f_goes_on_not_dates_with_male_friends_and_i/","permalink":"/r/relationship_advice/comments/1p6mmbx/gf_25f_goes_on_not_dates_with_male_friends_and_i/","score":162,"num_comments":315,"over_18":false,"stickied":false,"created_utc":1764100500.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p20a","name":"t3_1p6p20a","subreddit":"relationship_advice","author":"sarahbarrista","title":"Husband (M43) lied to me (F 38) after we had 2 babies and I’m not sure if I am overreacting","selftext":"I‘m absolutely lost in this situation and I’m in urgent need of an outside perspective.\nMy husband (M43) and I (F38) have been married for 5 years and have had two children (M2.5, F10m).\n\nDuring my pregnancy with F10m, she was diagnosed with a heart defect during the anatomy scan and I was quite distraught while my husband took a more rational approach and since then we struggled to reconnect. \n\nHonestly, the last year of our relationship was quite a blur and I felt like my husband had checked out of the family emotionally. \nHe started traveling for work (he never had to, before) and was visibly depressed since our baby girl was born. We started couple counseling a few months after this.\n\nWe’ve had quite a few major arguments since, one revolving around me finding communications between him and his brother / him and my mother in law about my shortcomings (I was very dependent on him, I didn’t drive, I needed a lot of help during pregnancy and hormone treatments etc - but I always worked and from my perspective, I always carried my weight). To read this really broke my heart because I thought I’m close with all of these people.\n\nAnyway. Here’s the situation that I need serious advice for:\n\nBaby girl was born late in December and things were awfully stressful. We had two babies, baby girl was constantly sick at night, two big dogs and my husband was really depressed so I urged him to take a vacation to regroup and clear his head. I did this not just as an act of love but also because I really wanted and needed him to emotionally rejoin our family and not just show up in the evening, depressed and unhappy and attend me and the children like he’s working off tasks of a to do list without any love or passion. \n\nSo I booked him into a diving vacation on a livaboard boat.\nWhen he came back he was a bit less miserable but there was no reconnection ever since and it’s been a year. He mentioned all kinds of people from the diving boat. He told me about both men and women he got along with and meant to stay in touch with.\n\nA few days ago I came across ‚locked chats‘ on his WhatsApp. Not by consciously looking - I didn’t even know that was a thing. \nAnyway, I looked into it as I know his passcode (a few years ago we didn’t have secrets) and I came across chat with some girl from the diveboat. At first glance the chat seemed innocent enough, a lot of talk about traveling and diving, 80+ picture of her and her travels, him complaining about his boring life but mainly about diving, his business trips, her family and friends etc. this went on from April to September. Not every day and I didn’t read the messages in detail but just scroll med through them.\n\nSecondly I came across a chat with his ex girlfriends sister, thanking her that she let him sleep at her place. He seemed to have flown through her city on the way back from one of his business trips and didn’t tell me - despite me asking at the time when his flight was etc. \n\nI asked him what’s in his locked chats and he lied to me, deleted them (dive friends chat just partially) and worst of all, swore on our children’s lives that he didn’t delete anything (he didn’t know I had already seen the chats).\n\nI confronted him and he basically apologized at first for lying but doesn’t feel sorry for having secret friendships (or affairs!?) with some diveboat girl while I’m home recovering from my severe birth injuries and we go to couples counseling because ‚there was nothing inappropriate‘ and he had just locked the chat because I ‚created an environment in which he didn’t feel like he could have some privacy‘. So somehow this is my fault. At least partially.\n\nMind you - I am not a jealous person and I don’t consider myself controlling (I literally made him go on this trip), but when I come across my own husband badmouthing me with his family or him having hidden chats on WhatsApp - I’m not stoked. Would anybody be? He never mentioned this girl to me. Not once. He’s also bringing up a colleague who sent me flirty WhatsApp messages and who I consistently though gentry turned down as the proof that I have nothing to complain about. I start feeling crazy for turning this into a huge thing just before Christmas.\nI don’t want to stay in a marriage that’s full of emotional detachment, lies, (justified) mistrust and deception. This comes on the back of a year of a sad, non detached relationship with no emotional connection despite my many attempts to reestablish a physical and / or emotional relationship.\n\nMaybe I’m not seeing something. \nAm I going crazy?\n\nPS: obviously this is my perspective and I fully appreciate that he would disagree with some of my interpretations: he thinks I’m controlling etc.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6p20a/husband_m43_lied_to_me_f_38_after_we_had_2_babies/","permalink":"/r/relationship_advice/comments/1p6p20a/husband_m43_lied_to_me_f_38_after_we_had_2_babies/","score":155,"num_comments":65,"over_18":false,"stickied":false,"created_utc":1764106022.0,"edited":1764109768.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sw6k","name":"t3_1p6sw6k","subreddit":"relationship_advice","author":"AndreiDeiu","title":"My (23M) twin brother and my dad hate my girlfriend (18F) for being \"low level\" and \"poor,\" and calling her “controlling” but I just realized I’m the one funding their lifestyle. Now my mom is taking their side. How do I escape?","selftext":"I (23M) am a Police Officer in Romania. I earn a decent salary (about 6500 RON/~$1400), which is good for my age here. I’ve been with my girlfriend (18F) for 7 months. She comes from a very poor village background (clay house, no father, toxic grandmother), but she is the most loyal, resilient person I know. She never asks me for money and actually tries to protect me from her own.\n\nMy dad and my twin brother (23M) hate her. They constantly tell me she is \"low status,\" that she’s weighing me down socially, and that she’s \"controlling\" my time. My brother even tracks my location on my phone and reports to my dad if I spend too much time with her.\nThey recently staged an intervention, claiming she has a \"bad history\" (based on village gossip from when she was 14) and that she is disrespectful. The \"proof\"? She recently panicked after breaking a window at a cafe and joked that I had \"5 minutes to come help her,\" which my dad overheard and took as her treating me like a slave. In reality, she was just scared and needed help.\n\nI sat down yesterday and audited my life. I realized I am being gaslit.\n• My Twin Brother: He is unemployed (Master's student) and a Wedding DJ. He earns cash from gigs but hoards it. He lives at home and drives a 2007 Audi A4 that my parents maintain.\n• What I pay for: I pay his monthly iPhone 15 bill. I buy the groceries for the house. I buy the \"fun\" food (pizza/takeout). I lend him cash (1500 RON recently) that he pays back reluctantly. He treats me like an ATM while judging my life choices.\n• Me: I drive a beat-up 2001 VW Polo that I have spent €2000 repairing myself because my dad (who owns it) refuses to drive or fix it. I have almost no savings because I’m bleeding money to support my brother and the household.\n\nMy mom was my only ally. She actually helped me secure a \"social apartment\" for very cheap rent (257 RON/month) so I could move out Jan 1st.\nBut here is the twist: She is now insisting that my twin brother moves in with me. She says \"he needs to leave the nest too.\" Even worse, lately, she has started echoing my dad’s opinions about my girlfriend and my \"behavior,\" likely to keep the peace at home. I feel like I’m losing my last defender.\n\nI have the keys to the apartment (it needs furnishing/utilities). I have decided to:\n1. Stop paying my brother's phone bill.\n2. Stop buying food for the house.\n3. Move out.\nBut I am terrified. If I tell my brother he can't live with me (or if I force him to pay 50% and respect my boundaries), my whole family will paint me as the bad guy who abandoned his twin. I feel like the walls are closing in.\n\nTL;DR:\nMy family hates my \"poor\" girlfriend and calls her a burden, but I just realized my unemployed twin brother is the actual burden (I pay his bills, he drives an Audi, I drive a wreck). I’m moving to a cheap apartment to escape, but now my mom is siding with them and trying to force my brother to move in with me. I feel like I’m funding the people who are ruining my relationship. How do I stand my ground without losing my family?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6sw6k/my_23m_twin_brother_and_my_dad_hate_my_girlfriend/","permalink":"/r/relationship_advice/comments/1p6sw6k/my_23m_twin_brother_and_my_dad_hate_my_girlfriend/","score":114,"num_comments":85,"over_18":false,"stickied":false,"created_utc":1764115524.0,"edited":1764120118.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6e72r","name":"t3_1p6e72r","subreddit":"relationship_advice","author":"No_Candy2021","title":"Contemplating ending things with my (21F) boyfriend (23M) for how he reacted to me being roofied. How do I communicate this?","selftext":"I (21F) went to my friend's birthday party on Saturday night. She's extremely social and loves big parties so unsurprisingly, this one was huge. Lots of people, most of whom I barely knew, and a lot whom she didn't know herself but it was kind of a snowball invitation situation. My boyfriend of almost 2 years couldn't come because he had prior commitments with his friends so I went alone, and every time I go out without him, my alcohol limit for myself is one drink.\n\nThis time, I ordered a cocktail with a double shot which I always do, but halfway through drinking this one, I felt awful. Like my eyes were drooping against my will, I was suddenly super foggy and felt sluggish. I knew one drink wasn't supposed to do this so I got scared and called my boyfriend right away because the people right around me were people I didn't know, most completely drunk and not in a position to help me. When I called my bf, I told him what was happening, said I was worried someone did something to my drink and asked if he could come pick me up. In the moment, I wasn't thinking about how I was disturbing his outing with his friends, things were super foggy and I frankly don't remember the exact sequence of events after. But I guess he got mad and cut the call and messaged me after, saying I was being dramatic, and to just \"puke it out and walk it off\".\n\nI managed to get a hold of my friend's brother who was kind of chaperoning the party and he drove me to the ER then home hours later and has been sending me links on how to report suspected drugging which I really appreciated. When I re-read my bf's texts with a clear mind the next day, I was just really put off. I was in a situation where I thought something terrible was going to happen to me, I felt physically awful and I was so scared in the moment that I would be taken advantage of and he's texting me that I'm toxic for ruining his time with friends. Obviously, that was not my intention, I didn't ask to be drugged and I should be able to step out alone without having to worry about something like this happening. But I was hoping he'd be there for me, willingly and concerned, in this kind of situation.\n\nI'm kind of extremely turned off now even though he's been calling to apologise but even then, it's apparently because his sister told him he was a massive pos. I want to end things but I feel really iffy about whether or not I'm overreacting or how I should communicate this to him when he's not listening to me and just responds to every one of my concerns with an apology and promise to do better.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6e72r/contemplating_ending_things_with_my_21f_boyfriend/","permalink":"/r/relationship_advice/comments/1p6e72r/contemplating_ending_things_with_my_21f_boyfriend/","score":105,"num_comments":56,"over_18":false,"stickied":false,"created_utc":1764081811.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p66v3z","name":"t3_1p66v3z","subreddit":"relationship_advice","author":"SnapCrackleAdHoc","title":"My (35M) Wife (35F) has played me for 5 months and I don't know what to do","selftext":"Posting this more for venting purposes than advice but I'll take what the good people of Reddit have to offer because life sucks right now.  I just found out tonight that my (35M) wife (35F) of 5 years has been at the minimum having an emotional affair for the last 5 months behind my back. \n\n I'm active-duty military and coming off a pretty long period of underway time with a job that allows pretty much zero contact back home. I left earlier this year with what to me felt like a pretty happy marriage.  We bought our dream home back in 2023 that was perfect for my two step-kids and overall, there was a lot of love between the two of us.  Don't get me wrong, it wasn't perfect.  Distance with my job and her being so busy with hers made it hard along with trying to raise two kids, but I never felt like there was any major issues we couldn't work through. \n\nI guess I was wrong because I got home and things immediately felt different.  The loving and caring wife I thought I knew was distant and not opening up to me at all.  For those that don't know this is pretty common in military marriages after deployments/time away, so I just figured she was adjusting to me being back home. A couple weeks went by, and I noticed she was sleeping on the couch more and on her phone more often than ever before.  After about a month being home I finally spoke up and said something felt off around a nice backyard fire one night.  She agreed with me, and we talked a lot over some drinks and agreed that we needed to work on each other. \n\nAt this point I was happy with the outcome and thought together we would work through this.  I tried to become more attentive to her, take things off her plate, do the cooking and cleaning and let her have some hobbies. She recently took up golf, and I was really happy she found something she really liked to do.  We also still played on a local softball team with friends when we could (I was busy with work and couldn't make every game but still showed late to support her and bring the kids.)\n\nFast forward to last week and we're sitting around another fire talking and she brings up she just doesn't see us working out anymore.  Lots of \"it's not you, it's me\", \"I've tried to get back to where we were\" and \"I don't want you to hate me.\" At this point the feeling in my stomach sinks and I go into full panic mode.  I suggest marriage counseling, spicing up our bedroom life, and any other thing I can do to save everything we worked so hard for.  Then my gut starts kicking in and I can't help but ask the question, \"Is there someone else?\" I got hit with the Billy the Kid quick draw of \"Of course not\" and \"I'd never do that to you.\"  I believed her (she had never given me a reason not to).  I go to bed that night next to her holding her in an embrace that can best be described as uncomfortable.\n\nSome more days go by and I schedule marriage counseling for us, surprise her with flowers at work and take her to lunch and just try to be a good husband and supportive in her feelings.  I'm sure at times I probably seemed needy because all I wanted to do was talk, but to my defense, my heart was breaking. Sunday she's goes golfing with some friends and comes back without her rings on.  I immediately say something, but she ensures me that she takes them off for golf and forgot to put them on after.  I don't know a damn thing about golf (never really been my sport) so I assumed that was normal.  I did sleep on the couch that night because my stomach was tossing and turning and I felt like I was going crazy.  My marriage was falling apart and all I got was cliche lines about it not being me and a cold distant wife 90% of the time. My gut was trying to tell me what my heart and mind didn't want to admit.\n\nFast forward to tonight. She gets home and I'm making dinner for my stepdaughter after a work-out.  Still no ring.  I text her (an idea my therapist gave me to try different modes of communication) and it works! I got more out of her tonight then I did in two months.  I'm spilling my heart out over text trying to not break down in front of our stepdaughter (not great to have her in the room, I know) and she's basically telling me that she's uncomfortable in our marriage (wtf does that mean) and she can't see us getting back to good ever.  It's crazy because while she's texting all this directly across from me, there's really no sadness in her face at all. It really broke me. I ended up going to shower and just kind of sulked while she did some stuff with my stepdaughter.\n\nSomething at this point just doesn't make sense to me.  It was like there's a massive puzzle in front of me and one piece was missing, but I kind of knew what should be there. I've never checked her phone before, but I decided to check the phone call/message log on our phone accounts.  At first nothing stuck out but then I saw text messages/picture messages from a number way to much at inappropriate times in the last months log.  There was also 40–60-minute phone calls daily to the same number as well. I went back into September, and it was happening there. Literally 3AM texts on the day i got home next to me in bed.  I tracked over 12000 messages and phone calls going all the way back to about a month after I left. The worst part was I knew the number.  It was friend of ours from the softball team we play on that I literally had just gone out for drinks with a couple weeks back. There was 40 minute phone calls after our lunch from the other day and god knows what else.  I'm sure I'll deep-dive the dates later since I saved all the logs.\n\nAt this point I was furious, and my anger took over when I should've remained cool calm and collected.  I asked her to come to the bedroom and send the kids to bed so we could talk some more.  When she got in there and sat on the bed, I demanded to see the text messages between them. Her face panicked and she quickly took off into our bathroom. When she came out, she handed me the phone, and I couldn't find any messages between the two of them.  Nothing at all. I looked at Facebook messenger and saw some flirty texts going back to November 10th but everything before that was deleted. I couldn't believe what I just saw her do.  I handed her the phone back and asked if she just deleted them and she said yes.  At this point I realized that I could look at the deleted message log, but she refused to give me the phone back.  When I asked why, all she could say was \"It's to personal.\" LIKE WTF. To personal to share with your husband but not with what I assumed is now your new boyfriend. She swears there was nothing physical between them or anything sexual at all and then when I explained to her what an emotional affair was and how this was blatantly one, she played stupid and acted like she had a tadaa/lightbulb moment and just came to the realization it was. (BS, I know)\n\nWe argued some more and she kind of did the usual nervous laugh and emotionless face she's been doing.  I told her I wanted a divorce, and we need to start working on selling this house.  Whether it's an emotional or physical affair, it really doesn't matter. She had me believing I was losing my mind for nearly two months while she was investing all her time and interest into another person that we both know well. On top of that, she then had the nerve to tell me I never text her and that this new guy is basically her best friend.  Now here I am wishing I would've trusted my gut sooner. Between losing what I thought was my partner in crime for life and these kids having their lives uprooted because she decided to cheat, I'm honestly more heartbroken for the kids. We've got dogs, cats and a beautiful home and all I want to do is burn the bridge and run off to some other coast forever. She's already guilting me about the kids having to leave their home when we we're talking about selling the home. I guess I just need some advice on what the next steps should be.  I probably know them, but more advice has never hurt.\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p66v3z/my_35m_wife_35f_has_played_me_for_5_months_and_i/","permalink":"/r/relationship_advice/comments/1p66v3z/my_35m_wife_35f_has_played_me_for_5_months_and_i/","score":88,"num_comments":45,"over_18":false,"stickied":false,"created_utc":1764057867.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p638qe","name":"t3_1p638qe","subreddit":"relationship_advice","author":"throwRAnoun","title":"My (32f) mom’s (59f) boyfriend (65m) used to harass me at work when I was 19. She doesn’t believe me and thinks I’m tearing apart the family. How to move forward?","selftext":"I used to work at a shop when I was 19 and one of the regular customers asked me out multiple times. He was way older than me, I always told him no and that he was making me uncomfortable. Instead he started calling me beautiful and once passed me a note while I was at the register. When I angrily told him to leave me alone, he started making comments about how I don’t smile, and how I have a bad attitude every time he came in. This went on for weeks until I refused to work the register if he was there.\n\nFast-forward ten years. My mother goes through a horrible divorce after being abused by my father. Her mom, my Grandma, dies tragically. A few months later my mom introduced me to her new boyfriend, whom she met at the place I used to work. There was something super familiar about him, and he kept telling me that he couldn’t believe I didn’t remember him, because he definitely remembered me. Something was nagging me, but I couldn’t quite place it. My mom made a comment about him writing her a bunch of sweet notes when it hit me like a ton of bricks. My mom was dating a guy who had harassed me at work.\n\nI am ashamed to say that I didn’t tell my mom right away. This was so shortly after her divorce/her mom dying, and I figured this boyfriend wouldn’t be around for long. My mom also has a history of alcoholism and problematic behaviors (she has bordlerline PD), and I was really worried about how she would react when she found out. I wondered if what he did was “bad enough” to share. But it was eating me up inside to hang out with him as a family for holidays, and just pretend like everything was normal. He kept staring at me. I knew that he was waiting for me to figure out who he was. It was a mess.\n\nTwo years ago I couldn’t fake it anymore. I spent Christmas day with my mom cooking. Then I told her that I wasn’t going to stay for dinner (when her boyfriend got there). I asked her if we could talk sometime soon. She pressed me about what was going on. I didn’t want to answer because I didn’t want it to affect her holiday, but eventually I told her that I didn’t want to spend my Christmas with her boyfriend there. I didn’t tell her why, because as soon as I said that, her whole demeanor changed. She sneered at me and told me to leave immediately. She called me later that night and I told her the whole story. She was upset, but she was more upset with me for not telling her sooner and for talking about it with my sister before I had spoken to her. She accused me of lying and of manipulating the situation because I’m “attached” to my dad, whatever the fuck that means. She said I had deliberately turned people against her, and that I couldn’t be trusted. She asked for a few days to process. \n\nAfter a few days she called me to inform me that she had talked to all of our family members who live in town, and had told them what I said. She asked each of them to vouch for her boyfriend’s character and they all said he would never harass anyone. She very coldly told me that she did not believe me. That maybe if I had “come forward sooner” or made an official complaint at work it would be believable, but that she thinks I am just confused. She said would not tolerate another word about this ever again, and that I would not be welcome in her home until I could accept her boyfriend.\n\nThis was devastating to hear from my own mom. It also activated some trauma I have after having been sexually assaulted and taking my abuser to court. (And all the other trauma that having a parent with borderline comes with.) I didn’t see or speak to my mom for about a year, but over the months we have been pretty much on normal terms. I see her probably once a month and we talk on the phone sometimes. She’s still dating her boyfriend. She’s still an alcoholic. She is in therapy. She has a career and friends. She recently lost her job, and is thinking of marrying her boyfriend so that she can enjoy her old age without working full time. \n\nShe called me a few nights ago to tell me that she wants to have a real conversation about her boyfriend, and ask what can be done to move forward. She says that the situation makes her really sad, she feels like she has to make a choice and she doesn’t know what to do. She asked me why I find her boyfriend “hateful” and why I “want them to break up.” I told her that I don’t find her boyfriend hateful. I think the way that he acted was creepy. But what makes me the most uncomfortable is the fact that my mom treated me so coldly. I told her that ultimately my issue is with her. I told her I would never like her boyfriend, but I want her to be happy and I do not want her to break up with him. What I want is for my mom to love and show up for me in a way that she might not be able to. I told her all of this, and to her credit, she mostly listened to what I had to say. There was a weird moment where she insinuated that I was attracted to her boyfriend and manipulative, but we moved past that. We ended the conversation with me saying that I needed to take some time to work through my emotions and figure out what I needed to heal my relationship with my mom and be okay hanging out as a group with her boyfriend. She told me she wanted him to be present at Thanksgiving and she would be OK with me not going to Thanksgiving if I felt like I needed some time. I thought it ended well and made other plans for Thanksgiving.\n\nShe sent out a group text today saying that her boyfriend was not coming to Thanksgiving, so she hopes she would see us all there.  \nWhen I asked her what was going on, she said that she would never “replace” me with her boyfriend and was not going to choose him over me. I reminded her of our conversation. I asked her if we were on the same page? I asked her if she understood that I did not want her to choose between the two of us? She said “I believe we have different takeaways. Come to thanksgiving or not, I don’t mind either way.” \n\nI am so confused. This situation is incredibly draining. More than that, I feel like I’m going crazy. It’s not normal for a parent to date someone who harassed their kid. It is not normal for a parent to cut a child out of their life and home for something that was not their fault. This isn’t my fault! I didn’t want this guy to harass me at work! I didn’t deserve to me cut off because of this. It is not healthy or okay to accuse your child of lying, of being attached to your partner, of manipulating people just for telling the truth. But my family thinks this has gone on long enough, and that I just need to “get over it.” Family members have asked me why I won’t “let my mom be happy,” why I won’t “let her retire and get married,” and why I am “turning people against her.” My sister acknowledges that my mom sometimes manipulates people/situations to create emotion, but doesn’t see why I can’t just go to Thanksgiving if he’s not there.\n\nI just want distance from this fucked up situation. As far as I am concerned, this is all my Mom’s choice. Who she dates is her choice. When she retires is her choice. What she believes is her choice. But all of a sudden, it’s MY choice that matters. Thanksgiving dinner has become the tipping point. If I don’t go, then I am being dramatic and creating problems. If I do go, I am reinforcing my Mom’s false narrative that I am forcing her to cut out her boyfriend. \n\nAm I being dramatic, do I actually go to Thanksgiving and suck it up? Or am I desensitized to how fucked up this is?\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p638qe/my_32f_moms_59f_boyfriend_65m_used_to_harass_me/","permalink":"/r/relationship_advice/comments/1p638qe/my_32f_moms_59f_boyfriend_65m_used_to_harass_me/","score":54,"num_comments":33,"over_18":false,"stickied":false,"created_utc":1764045104.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6if8l","name":"t3_1p6if8l","subreddit":"relationship_advice","author":"bgui17","title":"My [24M] girlfriend [20F] wants me to sleep with another girl and record it for her. How do I respond?","selftext":"My girlfriend wants me to sleep with another girl and record it for her. We’ve been together for 2 years now and she’s had this fantasy for a long time. I’m her first partner so she wants me to sleep with other girls and record it to better understand what I like and learn what she can do for me. I’m unsure myself on how to feel about this. I told her multiple times that I don’t want that but she’s really insisting on it and won’t take no for an answer. I love my girlfriend more than anything and to me this feels like cheating. \n\nI don’t want to upset her and make her jealous / think I don’t love her because I slept with someone else. Not only that, I don’t even know where to begin to find someone who’d be interested in this. We live in England and I have no experience with online dating / hookups since I’ve never used anything like that and met my current girlfriend in person.\n\nI told my friends about this and they said it’s because she’s cheated and wants to feel better about it by having me sleep with another person. I know that’s not the case because she never leaves the house or practically never leaves my side nor does she talk to anyone else because her anxiety is really bad. This is something she’s always loved the idea of and keeps pressuring me to do for her. \n\nAny advice with how to go about resolving this or making her happy would be much appreciated\n\nTLDR: Girlfriend 20F wants me 24M to sleep with another girl and record it for her.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6if8l/my_24m_girlfriend_20f_wants_me_to_sleep_with/","permalink":"/r/relationship_advice/comments/1p6if8l/my_24m_girlfriend_20f_wants_me_to_sleep_with/","score":34,"num_comments":102,"over_18":false,"stickied":false,"created_utc":1764091316.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p68o31","name":"t3_1p68o31","subreddit":"relationship_advice","author":"No_Honey_5492","title":"I (29M) am completly in love with my coworker (29F) and do not knwo what to do..","selftext":"Dear all,\n\nThis is my first serious post here, which was not easy for me to write. I hope some of you can share your own experiences and maybe give me some advice on how to behave.\n\nThis story is about me (29M) and my female co-worker (29F). We have been working together in the same team for about a year and a half. When we first met during her interviews, I had joined the company a year earlier. We liked each other immediately, as two people on the same level would. As we started working more closely together (she is somewhat my substitute when I am on holiday or travelling), we started to form a bond. First, we started writing to each other daily at work and afterwards, sharing funny memes and Reddit stuff with each other. Initially, we also used to do private things together at the weekends, but that doesn't happen anymore. I'm not 100% sure why, but she has a second job at the weekends which is really important to her, and she spends almost all her time at the gym. As I am also quite busy in my free time, we just don't find time anymore. At some point, I stopped asking. Looking back, I realise that it was mainly me who was trying to initiate something. This went on for almost a year, during which time I think we got to know each other quite well. \n\nGoing forward, we had a team restructure, which means we now sit next to each other. There is basically no distance between us anymore, and we spend our whole working day together, seeing each other (needless to say, I think she is one of the most beautiful women I have ever seen), chatting, and working alongside each other. From my perspective, there is still something between us. We even have cute nicknames for each other and refer to ourselves as 'work wife' and 'work husband'. We are also quite affectionate with each other, like stroking each other's arms or leaning our heads against each other's bodies when standing next to each other's tables, which we only do with each other. This is definitely not regular behaviour with other colleagues. However, a topic we never spoke about in detail was each other's love life. I know that she is single and, as far as I am aware, not currently dating or in a sexual relationship with anyone. I know what kind of guys she likes, which is with a southern touch and muscles - which is not really me, but as I would say I am also quite well build and fit - but not a bodybuilder. Additionally, she never asked me about potential hookups I could have had (which I did have, but they never meant anything to me). She knows that some girls have a crush on me, and sometimes she jokes that those girls would love to have sex with me. I always respond by saying that I have zero interest in doing that with any of these women. On the contrary, I think I compliment her on basically everything I like about her, such as her style, kindness and humour, as well as how well I think she's doing in her job.\n\nSo, at some point, I realised that I had started to develop feelings for her because I found myself thinking about her more often: when I woke up, when I went to sleep, and wondering how she was doing when we weren't together. The first time it really hit me was two weeks ago when she interviewed someone for a junior position in our team. When she came back, she and our boss bragged that this guy will be definitely hired as he thinks that she thinks how handsome, smart and 'rich' this guy was. She confirmed that he was indeed very handosme and bragged about his chest and biceps msucle. Hearing her talk about another man like this absolutely killed me. I got stomach pains and felt like I was going to be sick. Maybe she has noticed my reaction becasue she immediately wrote to me, that - calling me by my nickname - is only one for her- which really felt nice at ths moment. Nevertheless, since I realised how much I am into her, things have been going badly for me and i fear that I am fucking up thins badly at the moment. As I realised how flirty she is with a lot of people, I started to feel really bad about it, as it started to hurt my feelings and make me feel unwanted by her, even though we are much closer than she is with anyone else. Since then, I have been completely confused and lost about my feelings. She has noticed that I am behaving a bit oddly; for example, I am much quieter than usual, and she has asked me what is going on. However, I could not tell her because I am afraid that if I open up to her and tell her that I like her more than is appropriate for colleagues/friends, I will destroy everything we have built up over the last year and a half, as she does not like me in a romantic way. But if I'm right and she only likes me as a friend, I don't understand her gentle touches and sexual innuendos.\n\nI tried to communicate my current \"problem\" or dilemma in a way that would help her understand it, but after two long conversations, I think she either has no idea that I like her more, or worse, she knows what's going on but wants to avoid it at all costs, because then there's no going back to normal behaviour between us.\n\nIt's also worth mentioning that this current state is seriously affecting my day-to-day life and work. I can't eat anymore as I'm constantly feeling sick, I don't have the energy to pursue my hobbies (which are normally very important to me), and I can't think about anything else except how the hell I'm going to get out of this rabbit hole. It's worth mentioning that when I like someone, I develop quite strong feelings. This has always been the case. For example, when I was in Year 7, I fell in 'love' with a girl who didn't like me, and I couldn't eat anything for four days because my body was producing so much stress. Today is the same, as i even had to call in sick today as I don't feel able to work next to her at the moment because everything is just taking my breath and energy away. I don't know what I'm going to do if the new guy starts in our team, they hit it off and I have to see them every day.\n\nOn top of that, I am somewhat of an overthinker. I am already trying not to make up fictional scenarios in my head, but sometimes it works and sometimes it doesn't. Does anyone have any tips on how to stop being like this? \n\nIt was quite tough to write this, but I hope I have painted a somewhat traceable picture of my current situation. I hope it's not too confusing, as I am really confused and seriously have no idea what to do in my situation. \n\nI really hope someone here can shed some light on the topic. It would be great to hear from a woman shedding some light on her behaviour and how someone could interporet it.\n\nMany thanks! \n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p68o31/i_29m_am_completly_in_love_with_my_coworker_29f/","permalink":"/r/relationship_advice/comments/1p68o31/i_29m_am_completly_in_love_with_my_coworker_29f/","score":30,"num_comments":47,"over_18":false,"stickied":false,"created_utc":1764064953.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6twh5","name":"t3_1p6twh5","subreddit":"relationship_advice","author":"Gigigirl90","title":"Husband (34m) trying to get me (30f) to stop playing tennis","selftext":"My husband (34m) and I (30f) have been married for 2 years. I started playing tennis two weeks ago. I just go once a week with a female coworker and we do an hour lesson with two other women and a female coach. After, we go play at a court by her house. We spend maybe 2 hours total while he is at work once a week so it doesn’t take from our time together. I even got him a racket in case he wanted to play too.\n\nThe problem is that the place is 20 miles away. He wants me to find a closer one. But I really like the coach who is female and that I get to do it with a friend from work. He is saying the place is too far and then he said it’s too expensive. I make significantly more than him and we just recently started sharing a joint account. To save money, I don’t get my nails done anymore even though I use to love to. I pick up overtime every now and then too and picked up a contract to work weekends so I get paid a little more too. And I don’t see how 20ish dollars once a week is too much. \n\nI told him that I felt that that was controlling and he got mad at me. I also mentioned that I didn’t get why he was suddenly worried about how much I drive with my car when I drive that much to just get to work and he doesn’t want us to move closer to my job. I feel like he is trying to control me and take something that I truly enjoy. He then went on to say if I can do anything I want then he can stay up all night and play video games (he used to do it for like 48hours straight with no sleep and act like a totally different person). \n\nTLDR; husband trying to get me to stop tennis lessons that I’m currently enjoying. I feel like it’s controlling. How can I get him to see my side of things? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6twh5/husband_34m_trying_to_get_me_30f_to_stop_playing/","permalink":"/r/relationship_advice/comments/1p6twh5/husband_34m_trying_to_get_me_30f_to_stop_playing/","score":29,"num_comments":47,"over_18":false,"stickied":false,"created_utc":1764118235.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6501q","name":"t3_1p6501q","subreddit":"relationship_advice","author":"spicyprincessxo","title":"Has anyone ever left a lover for a country? M26 F26","selftext":"Hi guys,\n\nJust needing some input. Have you ever left a lover for a country? \n\nI (F26) been with my boyfriend (M26) for about 3 years and living together. \n\nI met him back at home and we always planned to move to Australia one day and start a life there. This was going smoothly until last year he travelled to Thailand and fell in love with it. \n\nHe compromise with me and tried Australia for 6 months last year, and this year I took a chance and moved to Thailand with him to try it out and also to hold onto the relationship. \n\nI recently got laid off work and due to the tough job market, I was thinking of just going back home and told my boyfriend. He wasn’t willing to come back, even though he works remotely as well. \n\nThis really broke my heart, and everyday I have been thinking about it since. On top of that, he already told me earlier this year, that marriage is not on the table. He said it has nothing to do with me and it’s just him.  \n\nIt sucks, cause I really do love him, and I’m afraid I won’t find anyone better. \n\nSo I’m just wondering if any of guys have went through something like this? Have you left a lover for a country? Did it turn out well for you?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6501q/has_anyone_ever_left_a_lover_for_a_country_m26_f26/","permalink":"/r/relationship_advice/comments/1p6501q/has_anyone_ever_left_a_lover_for_a_country_m26_f26/","score":27,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764050948.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6h1lg","name":"t3_1p6h1lg","subreddit":"relationship_advice","author":"BetterDevious","title":"My 20/F boyfriend 20/M is obsessed with himself.","selftext":"So, my bf and I had this conversation last night and I don’t know how to feel about it. I want to understand him and know him better as a person so I’m gonna need some help from you guys.\n\nHe came to me last night saying that he figured his biggest fear out and it’s “being normal like everyone else.” He said. It took me a minute or two to understand what he meant so I asked him to explain. He got a haircut the other day and dislikes how it looked on him because it looked too “normal”, like it looked like everyone else’s haircut. I told him that he looked great and that he was the most handsomest man to me but he told me that he still felt ugly. He also says that he wants to be admired and looked at by other people, to leave an impression wherever he goes, to be close to “perfect.” He mentioned one time that him being in a room with people supposedly “better” than him, looks-wise or whatever makes him feel worthless. \n\nHe’s always been very particular about how he looked, taking more time to get ready than me, wearing a faux leather jacket outside on a hot day just to look less normal. I’ve never really thought about it much over time but now it’s starting to bother me a little. I don’t know if this is a valid thing to feel but it’s like he wants attention from other people, wanting to be looked at all the time and whatever. Have I not been complimenting him enough? Is it normal for him to feel that way? What can I do to help him? \n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6h1lg/my_20f_boyfriend_20m_is_obsessed_with_himself/","permalink":"/r/relationship_advice/comments/1p6h1lg/my_20f_boyfriend_20m_is_obsessed_with_himself/","score":23,"num_comments":32,"over_18":false,"stickied":false,"created_utc":1764088285.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6833z","name":"t3_1p6833z","subreddit":"relationship_advice","author":"zaixko","title":"what's the next step? (F21) and my girlfriend (F21)","selftext":"hey, so recently things have been off between me and my girlfriend. quite frankly, it's been rough a few times and almost ended twice. I wanted some advice to see if it's not normal behavior or i'm the one with high standards. been together for two years now.\n\nwe're long distance so it can definitely be hard at times, but it seems more hard on her than me. for instance, she cried two days ago saying it's been really hard that i'm not physically there. it's understandable to be emotional about that, but it came out in a \"i'm not sure i can do this anymore\" type of way. she even said today, \"i don't know if i'm cut out for us dating\" all because i asked her to not text me dryly. i'd get empty conversations most of the time or one word responses. her excuse, constantly, is she is tired from school and exams, but i'm here working two part time jobs and studying, yet not doing that to her. to me it's something very simple; texting. moving your fingers. not only that, but having a certain care and respect for your partner. all we have is the phone to communicate...\n\nother than that, there have been a few issues with her. she entertained a semi famous tiktoker for laughs and jokes, all because he liked her. she would tell everyone about it, join his lives, etc. even sent a text to her friend saying, \"i left him on delivered for a few days, is that bad (eyes looking to the side emoji)\" ... as well as go to the library with a guy in her class who quite obviously liked her. it was meant to be a 3 group project, but the other person bailed. she did not tell me about it until days later, to which i respectfully told her that i would've liked to know the day of. she took it as an attack, that she now suddenly needs \"permission\" from me.\n\ni'm someone that cares about the little things, ones that are very simple yet so impactful to me. all i wanted was that and even that's impossible, it seems. i feel that i'm being pushed to the side, not given enough effort. to her, giving effort to certain things i care about is \"too much\" and she simply \"grew up this way.\"\n\nShort version of ALL my issues with her:\n\n\\- lack of words in conversation; feels empty, one word replies sometimes. spoke to her about it numerous times, excuse is always being tired, even though that's not fair. it's just texting \\[your partner\\].\n\n\\- entertained semi tiktok guy. boasted about it to friends and me, kept joining his lives and not blocking him until i said how i felt about it. even then, it was met as an attack and that it was a \"joke.\"\n\n\\- went to library for a project with the guy who liked her, without telling me. it was meant to be 3 people, other person bailed. she didn't tell me until days later. when i respectfully told her to let me know the day of next time, it was taken as an attack.\n\n\\- been called insecure for having simple boundaries.\n\n\\- would not open the videos i send, but open all her friend's things just because she \"sees them in school\" and it would be awkward. also, that i apparently send too much (most times it's just 3-5 reels/tiktoks) but she is scrolling on the app anyways.\n\n\\- told her many times how much i like waking up to a good morning text since she wakes up first, she'd either not do it at all or send it hours later after she already woke up. (one of the small things that i really like my  partner doing. i always give her a goodnight text since i stay up, and she loves it)\n\n\\- i'm always the one making plans to do something, and even then it mostly gets shot down. if it's school, extreme exhaustion, or just simply not wanting to sometimes, i get it. but we haven't done anything like watch a movie, play a game, or facetime in two months. played roblox once, actually. she gets excited when there's a party or drinking involved though. gets so happy. never like that with me to hang out.\n\n\\- noticed that recently only if something sexual happens between us, that's when she's texting me a lot and sending me a bunch of \"i miss you. i've been thinking about you\" texts. then when that dies down, back to neutral or lack of conversation.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6833z/whats_the_next_step_f21_and_my_girlfriend_f21/","permalink":"/r/relationship_advice/comments/1p6833z/whats_the_next_step_f21_and_my_girlfriend_f21/","score":22,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764062706.0,"edited":1764065776.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t9pj","name":"t3_1p6t9pj","subreddit":"relationship_advice","author":"ATTILMTY","title":"My (22F) girlfriend (20F) penetrated me after I told her I was in pain","selftext":"After we were intimate for about an hour or two with me giving to my girlfriend, she wanted to give to me. When she initially tried, it hurt a lot because she hadn’t cut her nails. I was fine with her cutting them, then we resumed. But when she tried again, even if I was lubricated enough, it still hurt. Eventually I just told her it hurt and to stop. \n\nWe were just making out while she rubbed her fingers on my clit which I was enjoying a lot, but then as minutes went by, I felt my girlfriend slip a finger inside me. It hurt once again, but I froze up while she continued kissing me. Eventually the pain got too bad and I pretty much pushed her off me. \n\nWe talked about it afterwards, and she apologized, but then said something like “would it be helpful to come up with a safeword?” It makes me feel like she thinks it’s my fault and I should have said something to stop it, which I did. I am staying over at her place tonight and feel super uncomfortable sharing a bed with her. She knows I have been previously sexually assaulted by my ex girlfriend and by my brother when I was a teenager. I’m just sitting in the bathroom crying as I write this and I don’t know what to do? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6t9pj/my_22f_girlfriend_20f_penetrated_me_after_i_told/","permalink":"/r/relationship_advice/comments/1p6t9pj/my_22f_girlfriend_20f_penetrated_me_after_i_told/","score":21,"num_comments":30,"over_18":true,"stickied":false,"created_utc":1764116521.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jhll","name":"t3_1p6jhll","subreddit":"relationship_advice","author":"Away-Royal5569","title":"My 20f longtime partner 21M wants to join the reserves","selftext":"My partner of 2 years and I have been living together for 6 months now. We are both completing schooling to get bachelor's degrees, he works full time and i work part time. We are living in college dorms. He is never fulfilled no matter what he is doing. He has goals but then completely changes them and constantly self sabotage himself. \n\nI can't live on my own without him and he knows that. I have disabilities (chronic pain) so I can't work full time for my own sanity, and im in school full time so I wouldn't be able to balance it. \n\nHe wants to join the Marine reserves, just because he wants to. We have talked about how it won't give him any real benefits and he doesn't care. He just wants to do it.\n\nI have expressed my anxiety about him going into this, especially because if there is a war and American troops are sent he will be sent. I also expressed how we'd have to get married if he wanted me to get benefits and he wouldn't be able to plan stuff well because once he is done with training he will need 1 weekend a month, and he doesn't know which. Not to mention a boss who is understanding. \n\nHe doesn't care because he says he doesn't want to regret not doing it, but I moved here (to a new city) to be with him because he promised me we'd go through life together. \n\nThe training period will take a toll on both of us, we won't be able to talk and im scared his personality will change. I also just don't like the military and I never wanted to be a military partner. I've hated it my whole life. He knows that. We've talked about it. How you're nothing but a dog that they use and throw away once you have no use anymore.\n\nI love him so much. I've talked to him multiple times about this. He says he doesn't like where he is in life right now and wants to do more, but he doesn't care about serving the country or anything. (Like most army/reserves don't) he just wants to do it because he thinks he can. \n\nI can't see a future without him. I don't want a future without him. How do I go along with this? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6jhll/my_20f_longtime_partner_21m_wants_to_join_the/","permalink":"/r/relationship_advice/comments/1p6jhll/my_20f_longtime_partner_21m_wants_to_join_the/","score":18,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764093661.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6amxi","name":"t3_1p6amxi","subreddit":"relationship_advice","author":"General_Choice_1686","title":"So turned out the friend ‘F 31’who is a girl that my bf ‘31 M’ keeps telling they are just childhood friends is actually his ex","selftext":"Me ‘31F’ and my bf ‘31M’ been together for over a year. He usually went to his ‘childhood’ friend to visit her and her cats. He used to go every week until I confronted him that I dont feel comfortable of him being with her alone in her apartment and he said he just wanted to see the cats and that she is his childhood friend, nothing more but tonight I just found out that she was his ex. Even though he stopped seeing her for couple months and through their messages I know they remain just friends but I feel so cheated the whole time that he was seeing her and I cant stop thinking what they were doing at that time behind my back. Now that I’m 20 weeks pregnant with him I feel so stucked and what would you do in this situation? \n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6amxi/so_turned_out_the_friend_f_31who_is_a_girl_that/","permalink":"/r/relationship_advice/comments/1p6amxi/so_turned_out_the_friend_f_31who_is_a_girl_that/","score":17,"num_comments":43,"over_18":false,"stickied":false,"created_utc":1764072035.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62cq0","name":"t3_1p62cq0","subreddit":"relationship_advice","author":"Dense-Temporary7000","title":"I’m (20f)Struggling to trust my boyfriend (22m)again because his recent behavior feels secretive?","selftext":"Struggling to trust my boyfriend again because his recent behavior feels secretive My boyfriend and I have a complicated history. In the past, he crossed several boundaries with porn and cheated on me. We eventually got back together, but ever since then I’ve been struggling with trust. Lately his behavior has been making that feeling worse.\n\nEvery time he picks me up from my house, he immediately puts his phone on Do Not Disturb. When we get to his one-bedroom apartment, we usually hang out in the living room. While I’m there, he’ll go to his bedroom to put his phone on the charger and won’t touch it unless I’m out of the room. He’s been secretive with his phone before, but something about the way he’s doing it now feels different.\n\nHe’s also been more distant and unpredictable lately. Today he suddenly went to a event right after work. He normally never does spontaneous things like that. He didn’t invite me, and he said he bought the tickets at the last minute when the event had already started. The whole situation felt out of character and confusing to me.\n\nI’m trying to figure out how to navigate these feelings and how to understand whether this behavior is something I should take seriously or if my past with him is affecting how I’m interpreting things.","url":"https://www.reddit.com/r/relationship_advice/comments/1p62cq0/im_20fstruggling_to_trust_my_boyfriend_22magain/","permalink":"/r/relationship_advice/comments/1p62cq0/im_20fstruggling_to_trust_my_boyfriend_22magain/","score":14,"num_comments":21,"over_18":false,"stickied":false,"created_utc":1764042347.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rlng","name":"t3_1p6rlng","subreddit":"relationship_advice","author":"Background-Gap-9038","title":"Is it fair I (25f) end my relationship with my (26m) boyfriend over our sex life?","selftext":"TLDR AT THE END.\n\nFor context, out of all the guys I have dated, my boyfriend meets the expectations I have always had for a partner. If anything he exceeds them. I love him so much and we have been together for a year. I have a high income and he has a higher income which is hard to find (not that making less than me is bad but I don’t want to be the breadwinner in a relationship). He makes sure to make me feel loved and makes me feel valuable. But I’m starting to resent our sex life.\n\nWhen I met him he was a virgin. Obviously porn was something he used consistently. I never had an issue with occasional porn in relationships. But I noticed he followed only fan models and after 3 months I told him that was inappropriate and he unfollowed them. His ig feed was filled with explicit photos of girls and I said that makes me uncomfortable. He said he stopped looking but I see random explicit photos pop up and he says it’s the algorithm but why doesn’t it pop up for me? \n\nWhen we first started having sex he would randomly get soft or never finish. He told me he wanted to have sex less. I found out he had a lot of saved folders and links to subreddits of porn. It was specifically nude women not just people having sex. He said he would stop and he deleted the folder. I feel like he did because that was the first mention of that folder I ever heard. I was crazy for the first while I knew and would check his phone and he didn’t stop. For context my last relationship was 5 years ago and I had gotten cheated on by my ex. But I realized that’s not the person I want to be in a relationship. I gave him my full trust and said do what you think is right. I said occasional porn would be fine but the whole Reddit only fans thing has got to go. So I stopped looking at his phone. A part of me tried to accept porn was okay cause I really wanted this to work out. I told him as long as it doesn’t interfere with our sex life like it is right now.\n\nI felt things got better after that briefly. His sex drive got better and he was harder and would finish during sex. But then I felt a shift again and I saw a whole bunch of tissues in the garbage next to his bed and I felt he wasn’t as hard and I asked if he jerked off and he said no. Of course he did. He lied to me and I said there was literally no reason to lie. So obviously he’s probably still active on these only fans and subreddits. Once again he said he would change and I was gone for two weeks on holiday. I come back and I realized he always has to jerk off at the end of sex for 10+ minutes after we’ve had sex for half an hour just to finish. I realized we’ll have sex for like an hour. I’ve never told him this but in the past guys have never lasted more than 20 minutes with me. So last night I asked him on text if he has been watching porn because he kinda got soft during sex and he got defensive and said no then sent me goodnight and never answered me. I got pissed off and I said the meanest thing like “enjoy jerking off to online whores” and haven’t spoken to him in a day. Maybe he has actually quit but I can’t tell and I don’t want to go through his phone and obsess over that kinda stuff.\n\nI’m a really attractive girl and I get guys in my dms at least once a week. When I’m out and about I’ll have guys ask me for my number. I have a good career and a good family. I’m afraid I will waste my youth on a man I will eventually divorce over this. But it sucks because nothing else is a problem in our relationship. This is the only thing we fight over and I can’t even tell if he has stopped. Has anyone gone through this? I’m thinking of ending the relationship but I’m afraid every man is gunna be like this. I don’t know what to do and maybe I’m fixating on something that shouldn’t be a big deal?\n\nTLDR: my boyfriend used porn heavily in the past which affected our sex life. He said he stopped, I can’t tell but sex is different. Everything else in the relationship I am happy with. Is it fair to breakup over this and how big of a deal is sex in a relationship?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rlng/is_it_fair_i_25f_end_my_relationship_with_my_26m/","permalink":"/r/relationship_advice/comments/1p6rlng/is_it_fair_i_25f_end_my_relationship_with_my_26m/","score":12,"num_comments":34,"over_18":true,"stickied":false,"created_utc":1764112157.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p613x8","name":"t3_1p613x8","subreddit":"relationship_advice","author":"Playful_War_4009","title":"I 18F have become fwb with my flatmate 19M - am I insane?","selftext":"I posted on here a week or so ago talking about the minor predicament I found myself in. I have no clue how to put updates so I thought maybe as well write another post.\n\nThe situation is just like the title says. We are opening fwb with each other, but keeping it completely secret in public. This has led to many a nights flirting in either of our rooms, sex etc followed by long chats and sleeping in each others beds.\n\nI’m being very careful not to develop and emotional attachment, but there is definitely tension there. I don’t think this will go any further than fwb, I also feel quite guilty having normal conversations with him in front of our friends, without them knowing we’re fucking.\n\nAny advice/judgement?","url":"https://www.reddit.com/r/relationship_advice/comments/1p613x8/i_18f_have_become_fwb_with_my_flatmate_19m_am_i/","permalink":"/r/relationship_advice/comments/1p613x8/i_18f_have_become_fwb_with_my_flatmate_19m_am_i/","score":12,"num_comments":35,"over_18":false,"stickied":false,"created_utc":1764038728.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dnlo","name":"t3_1p6dnlo","subreddit":"relationship_advice","author":"lonely_sweetpotato","title":"Venting frustations about mismatched sexual drive F25-M27","selftext":"TLDR; mismatched sexual drive is starting to weight on me\n\nI (F25) have a much higher drive than my partner (M27). I’ve seen lots of posts similar to mine. Any advice is always welcome but I just need to get these things off my mind.\n\n \n\nWe’ve been together for close to 6 years now. Like in a lot of relationships we were sexually intimate a lot in the beginning phase. We had sex nearly daily. We both initiated about the same amount back then. Since this lined up basically perfectly with my drive I didn’t realise how different our drives were back then. It seemed to me like he had a very similar drive.\n\nOf course a few months later this all slowed down quite a bit and we were intimate a lot less. This started to make me feel a bit insecure, I couldn’t really understand what had changed and why he suddenly seemed to desire me less. We had a really open conversation about this and for a while it got better. Not that we had more sex, but he started to explain why he didn’t feel in the mood. For a while it helped me but gradually we started being sexually intimate less and less. Over the years we had about 5 more pretty big conversations about intimacy, our respective needs, how to communicate. I have always been the one to bring the topic up.\n\nDuring these conversations it also feels like I mainly get vulnerable. He just listens, tries his best to validate my feelings (though this often feels devalidating since the message is ‘I understand that this is hard for you but there’s nothing I can do about that’) and ensures me he will try to be more open in communicating about this. After these kinds of conversations it gets better for a little while. For a month or two I can tell he makes more of an effort to be affectionate, give me kisses without me having to ask for it, holding me etc. This fills some of the gaps in my sexual desire and makes it easier for me to manage the rest by myself. He also doesn’t really give me much insight about his feelings surrounding this topic, he says he’s just more vanilla but he’ll let me know if there’s ever something he’d want to try out. He says he’s never really had kinks and that just thinking about sex doesn’t really give him sexual desire either. I can understand this but when asked if there is anything I could do to stimulate this more the answer is usually ‘I don’t know’. I’m at my wits end, I feel like it’s no use to keep having these conversations. They take a lot out of me mentally and any changes are only temporary. Since we’ve gotten together I have bought myself some sex toys and use those a couple times each week. Though I still feel unsatisfied after using those, it's better than nothing.\n\n \n\nNow we have sex about every other week and I can’t remember the last time he initiated this. I can feel myself starting to get frustrated and resentful. It’s been 3 weeks since we were last sexually intimate. I know it’s petty but it does bother me that I get rejected nine out of ten times while I’m basically always available if he’s in the mood. It’s gotten to a point now where I don’t even want to have sex with him anymore. I feel so on edge and tense all the time, not even masturbation offers relief. It’s also starting to feel unbalanced to me. For about 6 months of the relationship my sexual needs actually felt fulfilled, the remaining 5 years and 4 months it’s felt like I’m always waiting for him to fulfill his needs so I can get some scrap intimacy. I’ve seen a lot of lower drive people on here talking about the feelings of guilt surrounding repeatedly rejecting the other partner. And while rationally he probably feels this too I also can’t shake the feeling that he’s just not bothered by this at all. I know a lot of my feelings come from insecurity but I do need something more than this. Some words of affirmation would already bring me a lot of peace, but any reassurance I need is something I actively need to ask of him. This makes it feel less authentic and more like he only says it so I’ll feel better, not like he actually thinks or feels these things.\n\n \n\nI’m not sure how much longer I can do this, I know compromise is important but it does feel like I’m the one mostly compromising on their needs. I’m tired, I just want to feel desired again..\n\n How have others coped with this? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6dnlo/venting_frustations_about_mismatched_sexual_drive/","permalink":"/r/relationship_advice/comments/1p6dnlo/venting_frustations_about_mismatched_sexual_drive/","score":10,"num_comments":17,"over_18":true,"stickied":false,"created_utc":1764080479.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67ksj","name":"t3_1p67ksj","subreddit":"relationship_advice","author":"EduardoParada999","title":"I 20M Found worrying content on my girlfriend’s 20F Instagram Explore — not sure how to bring it up","selftext":"\nHey everyone. Not really sure which subreddit this belongs to, but I could use some advice on how to approach this.\n\nMy girlfriend and I have been together for a while and we’ve never been controlling with each other’s social media. I’ve never read her messages, checked her followers, or anything like that. And she doesnt either\n\nAnyway, a few days ago she wanted to send me some recipes she had saved on Instagram. We were in a hurry, so I logged into her account to find them. All good so far.\n\nBut then I opened her Explore page and it was full of posts about ending a relationship, what to do if you’ve cheated or been cheated on, healing after a breakup, etc. Super weird, because every time I’ve seen her Explore page before, it was full of cute relationship posts, cooking recipes, or dog videos. This was a complete shift.\n\nWe’re long distance, and she’s coming to visit me tomorrow. I don’t know if I should bring it up or just talk to her when she’s here. I don’t want to accuse her of anything or start drama, but it left me with a really bad feeling. I’m not sure if I’m overreacting or if it’s something I should be worried about.\n\nAny advice on how to approach this in a mature way without sounding controlling?","url":"https://www.reddit.com/r/relationship_advice/comments/1p67ksj/i_20m_found_worrying_content_on_my_girlfriends/","permalink":"/r/relationship_advice/comments/1p67ksj/i_20m_found_worrying_content_on_my_girlfriends/","score":10,"num_comments":11,"over_18":false,"stickied":false,"created_utc":1764060675.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6io54","name":"t3_1p6io54","subreddit":"relationship_advice","author":"ssugarliciouss","title":"My (26F) boyfriend (28M) refuses any practical steps toward living together or supporting my housing stability. How can I decide what next steps to take in this relationship?","selftext":"My boyfriend (28M) and I (26F) have been together for 2.5 years. We only see each other about once a week because we live 1.5 hours apart, and I’ve always imagined that by the 3-year mark we’d start planning to live together or discuss marriage more seriously.\n\nHe lives with his mother while pursuing acting and saving for a house. I rent a room in a shared house and don’t have family support while I’m estranged from my parents due to childhood abuse.\n\nWhenever I bring up moving in together, he says he won’t live together until we’ve saved a deposit for a house. But there’s no plan, no timeline, and he becomes frustrated when I try to talk about it. I end up emotional, and the topic gets dropped.  \nHe often talks about “us saving for our future house deposit,” but the situation feels unbalanced. He’s living at home rent-free and can save aggressively, while I’m paying London rent alone with no family support. I’ve tried explaining that it doesn’t feel fair for me to shoulder the cost of renting while also trying to contribute equally to a future deposit. He repeats that we should “both save,” but doesn’t acknowledge the difference in our circumstances or suggest a joint plan that accounts for that imbalance.\n\n**Edit - Hey all, appreciate the comments and reading through. Thought it would be useful to point out that he has been successful acting-wise and has been pursuing it since he was quite young. He also has a day job to keep money coming in rather than relying on acting. I don't know if this makes a difference to your opinions but I really appreciate your time.**\n\n**Recently**\n\nI was made redundant in September. He did help me, buying groceries and lending me money for rent, which I appreciated. During this time, I felt the gap between us more strongly, especially when friends talk about living with their partners or taking next steps.\n\nI eventually found a cheaper room (£750 instead of £1070), which would massively help me rebuild. But the landlord required a guarantor who is a UK citizen, homeowner, and above an income threshold.\n\nI don’t have anyone who fits that. My boyfriend isn’t a homeowner. I asked him if he would *try* being my guarantor even though he wouldn’t qualify, more as a sign of support than anything. He said absolutely no, because he won’t agree to anything legally binding.\n\nMy uncle eventually agreed to be my guarantor. Even my friend’s boyfriend offered to help.\n\nThen the landlord asked for a witness for the guarantor signing, literally just being in the room. I asked my boyfriend. He said no if it was “legally binding,” otherwise he would happily agree even though being a witness isn’t a binding role. He then did agree to being a witness.\n\nThis made me feel like he doesn’t see us as a team in any practical sense.\n\n**There's other stuff too-**\n\n* He won’t share a Netflix password unless *he* types it in every time.\n* During a disagreement once, he told me to leave his mother’s house, even though I had driven over an hour and had only passed my test the month before. I ended up crying in my car and he told me to call him when I was “calmer.”\n* He talks abstractly about marriage and kids but never wants to discuss timelines, budgeting, or what building a life together would actually look like.\n\nI feel torn. He shows love through gifts and affection, and we have great chemistry. But when it comes to commitment in practical, everyday life decisions, it feels like I’m alone.\n\nI don’t want to make decisions driven by fear of being alone or comparing myself to others my age. But I also don’t want to ignore signs that someone isn’t willing to build a future with me in a real, concrete way.\n\n**TL;DR:**\n\nTogether 2.5 years, only see each other weekly. Boyfriend says we shouldn’t live together until we “save for a house,” but won’t create a plan or timeline. When I needed a guarantor for a new rental, he refused even to be a witness because he won’t be part of anything “legally binding.” Combined with past incidents, I’m unsure how to assess whether this relationship can realistically move forward. Looking for advice on what steps to take and how to evaluate our future.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6io54/my_26f_boyfriend_28m_refuses_any_practical_steps/","permalink":"/r/relationship_advice/comments/1p6io54/my_26f_boyfriend_28m_refuses_any_practical_steps/","score":9,"num_comments":53,"over_18":false,"stickied":false,"created_utc":1764091866.0,"edited":1764105401.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6snpo","name":"t3_1p6snpo","subreddit":"relationship_advice","author":"throwaway-anonymous0","title":"I (F21) have a boyfriend of 4 years (M21). His best friend from middle through high school passed on Saturday. How do I help him in these difficult times?","selftext":"Hey, So my boyfriend has a bestfriend, we’ll call him B. Said friend unfortunately took his own life on Saturday. I’ve been trying to help him throughout all of this but I’m not sure of the proper ways to go about this. I did however tell him that grief is not universal and is weird and have tried to make him comfortable with expressing his emotions. B’s obituary just came out tonight and it’s affecting my boyfriend so much more. I didn’t know B very well other than when he helped us relationship wise while we were together 6 years ago. He always seemed to be so happy and carefree. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6snpo/i_f21_have_a_boyfriend_of_4_years_m21_his_best/","permalink":"/r/relationship_advice/comments/1p6snpo/i_f21_have_a_boyfriend_of_4_years_m21_his_best/","score":9,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764114902.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kkz2","name":"t3_1p6kkz2","subreddit":"relationship_advice","author":"Due-Character7149","title":"My girlfriend (26f) called me (27m) disrespectful for not cancelling plans to catch up with a friend?","selftext":"I'm 27 now but from the ages of 20-24 I had a close friendship group. We used to meet up most weekends. In the group there was a guy I've been friends with since school, a few other guys we met after school and a woman we met after school, lets call her Megan.\n\nWe'd hang out as a group but also individually. I'd hang out one on one with the friend from school quite a lot and also one on one the woman.\n\nThen we sort of drifted apart as we got full time jobs, some moved away etc so I haven't seen a few of them for years. Megan moved quite far away a few years ago and we lost contact. I've been with my girlfriend for two and a half years and last weekend we were in own and I saw Megan.\n\nShe mentioned she'd moved back to town this month. I introduced her to my gf and she suggested the three of us meet up sometime for drinks and we can catch up. I said it sounds good and said I'd message later to sort out a date and time.\n\nWhen we got home my gf said she wouldn't be going and that I shouldn't either. I asked why and she just said I shouldn't be drinking with another woman on my own. I pointed out I'd only be on my own because she's refusing to go and if it's that much of a problem for her she can join us. I said I wouldn't be cancelling and she can choose if she wants to join us or not. \n\nShe said I was disrespectful and that I should be listening her but I just said I am listening with her but that doesn't mean doing what she tells me.\n\nDoes anyone have any advice on how best to approach this or have any other views on it? \n\nTl;dr I had plans to catch up with a friend. My girlfriend was invited but chose not to attend but is now calling me disrespectful for not cancelling. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6kkz2/my_girlfriend_26f_called_me_27m_disrespectful_for/","permalink":"/r/relationship_advice/comments/1p6kkz2/my_girlfriend_26f_called_me_27m_disrespectful_for/","score":6,"num_comments":37,"over_18":false,"stickied":false,"created_utc":1764096038.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jagm","name":"t3_1p6jagm","subreddit":"relationship_advice","author":"PardoisTardo","title":"My GF (24F) said she is tired of wasting her time with me (27M)","selftext":"My girlfriend (24F) told me that she is tired of wasting time, that she really wants me (27M) to be the one, but that my inaction bothers her and she doesn't want to waste any more time.\nMeanwhile, I am finishing my engineering degree and trying to get training whenever I can, all so that we can have a peaceful life and not have to deal with minimum wage. In the end, I feel like none of my actions are enough for her.\n\nMaybe I should do more. I know I can give a little extra, but it still hurt a lot that she thinks she's wasting her time with me. It's as if the time I invest in her isn't worth it either.\nWhat do you think? I'm asking here because I don't have anyone else to talk to about it.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6jagm/my_gf_24f_said_she_is_tired_of_wasting_her_time/","permalink":"/r/relationship_advice/comments/1p6jagm/my_gf_24f_said_she_is_tired_of_wasting_her_time/","score":7,"num_comments":53,"over_18":false,"stickied":false,"created_utc":1764093239.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ix92","name":"t3_1p6ix92","subreddit":"relationship_advice","author":"No_Philosopher5720","title":"My(18F), boyfriend(19M) accused me of being lesbian, any advice for this situation?","selftext":"I've never posted before, so sorry If my storytelling has some mistakes,\n\nAs I mentioned in the title, I was with my boyfriend at my house last night when he had asked for my phone. He never has asked for it before, but I have nothing to hide so I didn't see a problem in giving it to him. He wouldn't let me see what he was doing, which was somewhat suspicious, but I let him stay on my phone anyway. After around 10-15 minutes, he gives it back and tells me he has confirmed his suspicion and that now I can just \"admit to it\". I had  no idea what he was talking about obviously so I was asking about what in the world I was supposed to admit to. After some arguing, he finally tells me he thinks I'm Lesbian because of the way I text one of my friends, I'll call her Lily. Lily lives outside of my state, so we text often because it's our only way of communication. I explained this to him, and we got in another argument because he couldn't shake the feeling that I was secretly texting this friend in a romantic way. I have nothing against gay or lesbian people, I just don't want my boyfriend thinking I'm into girls, when I'm literally dating him. He finally left my house, telling me not to text or call him, and he didn't even want me to walk him to his car like I normally do. We ended up calling, because he said he wanted to talk. During this call, we finished our conversation from earlier and I reassured him I'm not into girls (this is honestly so silly), but then he started talking to me about breaking up. We've only been dating for several months, but I really love this guy, and I didn't want this silly argument to end our relationship. We talked it out, and he told me some things along the lines of how I'm different from the other girls he's dated, that apparently I'm a \"loser\" in his eyes, but he loves me and my family and doesn't want things to end. He thinks my hobby is obsessive (I collect merch from different anime, manga, and gacha games) and wants me to tone it down. There was so many things said last night, and I honestly don't know what to do. This is the first real connection I've had with a guy, but I can't shake the feeling that my own boyfriend doesn't truly even love him like he says. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6ix92/my18f_boyfriend19m_accused_me_of_being_lesbian/","permalink":"/r/relationship_advice/comments/1p6ix92/my18f_boyfriend19m_accused_me_of_being_lesbian/","score":8,"num_comments":34,"over_18":false,"stickied":false,"created_utc":1764092424.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p687nz","name":"t3_1p687nz","subreddit":"relationship_advice","author":"throwawaybluespruceg","title":"I'm (39/F) not sure how to tell my boyfriend (39/M) that I want to disappear?","selftext":"I'm at the point now where I've realized that I'm not good enough to be with him. I know I'm a burden, even though no one else says so.\n\nI can't reach the expectations I set for myself. The way I look, work, or even just exist isn't good enough for anyone to be around. It doesn't matter what anyone else says, I'm not good enough for myself. \n\nAny changes I need to make can only be made by me, no one else. I know that. All words of encouragement, love, compliments, etc. I hear from people mean little because I know I don't deserve it.\n\nWhat I'm trying to ask is, what's the best way I can communicate to my boyfriend,  that I love/is my best friend, that I hate myself and I know that I'll just be more of a burden to him in the future. I'll get uglier and fatter, have more health problems, etc.\n\nI don't want to leave him, but I want to un-burden him. I just know that me not being around anymore would best for everyone. I want him to know it's not anything he did and I'm not leaving him for another guy. I'd like some ideas on how to say it. Thanks.","url":"https://www.reddit.com/r/relationship_advice/comments/1p687nz/im_39f_not_sure_how_to_tell_my_boyfriend_39m_that/","permalink":"/r/relationship_advice/comments/1p687nz/im_39f_not_sure_how_to_tell_my_boyfriend_39m_that/","score":8,"num_comments":138,"over_18":false,"stickied":false,"created_utc":1764063200.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65dr1","name":"t3_1p65dr1","subreddit":"relationship_advice","author":"Puzzleheaded-Many717","title":"I feel broken because my sexual urges are hardly there in my relationship and I need help (19F/20M)","selftext":"I apologize if something doesn’t make sense I have Covid right now with some brain fog.\n\nJust like the title says my husband and I moved into our first apartment together in September and it was kind of stressful and ever since we moved I went from wanting him constantly to maybe once a week. Granted before he was constantly away due to his job, he has quit that job for that reason. Now that he is home I have no urge. We did have some issues because he did something that really betrayed my trust about a month and a half ago and we were struggling for a while. (No he did not sleep with someone else) Regardless he wants me constantly and I just don’t and I don’t have a clue as to why he is blaming his weight gain and I tell him it’s not that. We have been together for three years only married since may I was just wondering if anyone has any tips on getting that spark back? This is just really become the only thing we are struggling with I know I am stressed and that can affect libido I work and I’m a full time student. Is it normal to only be horny for like a window of time like I can want him a few times during the day but if he isn’t there it’s like oh well and even if I see him later the urge doesn’t come back? I just don’t want to be having sex just to have it that feels fake and transactional. Please any opinions are fantastic. \n\nAlso he is an amazing sexual partner he will do anything to make sure I finish when we are intimate it’s amazing that why I am so confused as to why my libido is gone.","url":"https://www.reddit.com/r/relationship_advice/comments/1p65dr1/i_feel_broken_because_my_sexual_urges_are_hardly/","permalink":"/r/relationship_advice/comments/1p65dr1/i_feel_broken_because_my_sexual_urges_are_hardly/","score":8,"num_comments":4,"over_18":true,"stickied":false,"created_utc":1764052308.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63zxk","name":"t3_1p63zxk","subreddit":"relationship_advice","author":"ElleBee18","title":"Is my 45f relationship over with 46m","selftext":"I have been with my partner for six years. We have never been married, no kids, professionals, cook good food, great sex and have a pretty good relationship 95% of the time. We have two dogs.\n\nThe probldm I have is that sometimes he gets really angry and screams at me, so loud that the neighbours can hear. This is usually for things, like tonight when I got up from the dinner table while he was still eating. I was getting dessert and didn't wait for him to finish.\n\nI told him that my mom was physically abused by my stepdad and my grandmother was verbally and emotionally abused by her husband and that is not the life I want. He promised several times before that he will not do it again but alas. \n\nI am not sure if I should stay or leave, any thoughts on this?\n\nTL;DR Not sure if I should stick it out if my relationship is generally good with occasional verbal abuse.","url":"https://www.reddit.com/r/relationship_advice/comments/1p63zxk/is_my_45f_relationship_over_with_46m/","permalink":"/r/relationship_advice/comments/1p63zxk/is_my_45f_relationship_over_with_46m/","score":6,"num_comments":21,"over_18":false,"stickied":false,"created_utc":1764047518.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qgpn","name":"t3_1p6qgpn","subreddit":"relationship_advice","author":"Itchy-Firefighter352","title":"I, 28F, dating 29M for 2.5 months. Should a closure text be sent after they lied?","selftext":"I’ve been dating a guy for 2.5 months. By week 3, things got serious with affection, sleepovers, and intimacy. About a month in, he admitted he’d been in a funk, had lost his job, and couldn’t fully focus on a relationship, but he said he wanted to do everything he could to eventually be committed to me. I told him I could step back if needed, but he didn’t want that. I decided to stay and bent my boundaries, trusting his plan to work toward a committed relationship.\n\nLast Monday, during a feelings check-in initiated by him, he told me he still couldn’t commit. He told me he was sorry he couldn’t give me what I wanted said I didn’t deserve this, but insisted he wanted to keep working toward us by communicating and staying on the same page. I asked him to be honest if anything changed, because I valued honesty more than anything. I also knew I needed to break things off eventually, and had planned to this week. \n\nHe went on a weekend getaway this past weekend, and when he returned on Sunday we FaceTimed. He was showing me videos and photos from his trip, and in the photo album grid I noticed a text that said “miss you more babe” and “I’ll be back Sunday…” I calmly pointed it out, and he first claimed it was an old screenshot from a girl he had hooked up with during his travels that he’d shown friends. I then pointed out it said he’d be returning Sunday and asked if it was still old, and he said yes, then offered me to check his phone. I didn’t accept but told him something felt off. Eventually, he admitted it was from his ex, who had reached out a month or two ago and the message was from Friday. He admitted that he had met her for coffee a few times and planned to meet again this week, though he said they hadn’t been intimate.\n\nHe then told me that within the last 48 hours (his weekend get away), he decided he didn’t want to rekindle things with her, that he was happy with me, and he planned to tell her it wasn’t going to work out. He asked what I needed from him to continue, but I told him honestly: I don’t need anything and I don’t want to continue this relationship. He continued trying to convince me, saying he doesn’t cheat and this is what he wants, but I told him I had nothing more to say and wanted to sleep.\n\nThe next morning, he texted that he had dropped off a poem for me and wanted to continue our relationship, he was embarrassed for hiding things and saying he wasn’t wasting anyone’s time. I haven’t responded, and it’s been 31 hours.\n\nPart of me wants to just stay silent & not respond bc I am hurt by the lying & text message, but another part wants to send a closure text, like:\n\n“Hi, thank you for the poem. And thank you for the friendship we shared. There are no hard feelings. Wishing you the best in all life has in store for you. Take care of yourself.”\n\nAny advice would be helpful. Thank you. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6qgpn/i_28f_dating_29m_for_25_months_should_a_closure/","permalink":"/r/relationship_advice/comments/1p6qgpn/i_28f_dating_29m_for_25_months_should_a_closure/","score":7,"num_comments":20,"over_18":false,"stickied":false,"created_utc":1764109334.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fufu","name":"t3_1p6fufu","subreddit":"relationship_advice","author":"Ikn0wguacisxtra","title":"How do I (F29) tell the guy I’m dating (M29) I would need to see him being more independent to move forward?","selftext":"I have been seeing this guy for a little over a year. We met on a dating app. He lives about 2.5 hours away, in a large metropolitan area where I live in a more rural area. We have had a lot of fun- going to concerts, hiking, road trips, lots of small alt shows and fun restaurants, etc. \n\nHe has a job answering phones for a state park. I make $20/hr as a medical assistant. I just started living on my own in august because it took a really long time to be able to afford rent. he only has his own place because his parents pay for it. i’m pretty sure they pay all his utilities as well. he just pays for grocery, gas, and fun money. \n\nHe calls his parents for all his needs. anything going on with his car. needing to make a doctor’s appointment. they even do his laundry most of the time. \nNow here’s the thing. I have ADHD and low-level autism (would formally be asperger’s). Figuring out how to “adult” especially with the cost of living nowadays took me longer than it did for a lot of my peers, mostly because i struggled with college and getting and keeping jobs. \n\nBut, i’ve been working at my job in my field for a year now. He also has ADHD and I think had like a mild learning disability as a kid. A part of me thinks his parents think he’s not capable of doing any more than he is. But i’m telling you, he is. He is more organized and aware of what all is going on than me at times. \n\nBut, he doesn’t seem motivated to be more independent or think about how he could get a better job or even what he wants to ultimately do. And who could blame him? why make your life harder and more stressful if your parents do all the work for you? \n\nThere’s nothing wrong with needing help. but there’s a difference between asking for help on navigating something and your parents just doing it all for you. And i also know him getting everything paid for is the only reason we can do all the fun things we do. \n\nHe wants me to move to his area. he thinks it would be a lot easier for me to get a job than him because healthcare is always hiring. But a part of me knows he just doesn’t think he could figure out what he’d even apply for here. We would absolutely have to share an apartment. \n\nIf we were to get into a serious adult living-together relationship, we would have to deal with the adulting and finances together. It could not be me splitting the rent with his parents. \n\nI don’t really want to end this. I want to see if he can be motivated to do hard things. He has a lot of learned helplessness. If he doesn’t know how to navigate something he doesn’t try. I am afraid though of being offensive because what if he really CANT do these things (which i don’t think is the case). I also don’t want him to think this is about like, how much money he makes or what “kind of” job he has. I just want to be on an equal level with a partner who is willing and able to figure out how to do adult stuff with me. \n\nHow do I bring this up to him in a kind and respectful way? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6fufu/how_do_i_f29_tell_the_guy_im_dating_m29_i_would/","permalink":"/r/relationship_advice/comments/1p6fufu/how_do_i_f29_tell_the_guy_im_dating_m29_i_would/","score":8,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764085628.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p696u1","name":"t3_1p696u1","subreddit":"relationship_advice","author":"cutiepatootierosette","title":"My father (46m) cheats on my mother (45f) for over 20 years by now and she does not want to leave him","selftext":"Idk if this is the right sub to ask about this, but my  parents are pretty much going through the shittiest relationship ever since 2004 or something.\n\nMy dad is someone who doesn't just cheat, he cheats on his cheats too ... he fucks around with hundreds of women in the internet and god know who he meets irl.\n\nAnd he would fucking starve himself to send them money, and even though he acts nice alot of times and hides that side because he is a very smart person with huge knowledge (reads constantly about history/science/maths since he was in middle school) and people just assume he is the angel and also because he is a doc.\n\nMy mom has gone through hells with him like back in 2006 she found out he put up his number in a marraige channel on tv (she was the one feeding him because his monthly could barely feed them for few days) he basically wanted to bigamy.\n\nAnd since eternity they fight over it and when i ask her why not leave him she says its for me and he still cheats, and everytime we catch him my mom screams and him and pulls victim card starting to cry that he is alone all his life and all that shit.\n\nAnd yesterday i found out again that he is doing worse things with women.\nI don't know what to do anymore and she is not taking any action, he is starting to be more of a \"miser\" not even letting me buy some 4$ nugget pack, he sometimes pays big things for me i won't lie but that can be barely happening.\nMost of the time its just we are short on money don't do this don't do that same goes for my mom who is even refusing to get her medicine, i hate him and i despise him.\n\nI know a part of it is my mom's fault but she is afraid he might not pay my expenses like he do now (barely) and she going through a mental crisis.\n\nCan someone tell me how can i help her? I'm going crazy too and i feel like i will go through another mental breakdown, i already have alot of personal crisis and crazy issues with anger and stress that are making me have strange symptoms because of him and he refuses to even take me to therapy because its \"too expensive\" as he says and my mother goes through the same things.\n\nI want to convince her to leave him but by all means thats a whole another story she refuses.\nI'm simply tired of it, so i hope anybody can give me an advice.","url":"https://www.reddit.com/r/relationship_advice/comments/1p696u1/my_father_46m_cheats_on_my_mother_45f_for_over_20/","permalink":"/r/relationship_advice/comments/1p696u1/my_father_46m_cheats_on_my_mother_45f_for_over_20/","score":6,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764066940.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67my3","name":"t3_1p67my3","subreddit":"relationship_advice","author":"Fainted___","title":"My (20F) gf has been at least emotionally cheating on me (19F)","selftext":"Hello all, this post will probably get some flack for me being a hopeless lover boy but I met my current gf online on hinge (surprise surprise) while away at collage and being not freshly but a couple months removed out of long term relationship before me and my current gf. That previous relationship ended because I moved away for collage and she didn’t want to do long distance. Moving on, I met my current gf on hinge and I was kinda just lost at the time didn’t know what I wanted and my gf was looking for something long term so initially I was like “eh idk about this I just got out of a long term relationship” but she asked to hangout and when we did that first time we hit it off, and she seemed like everything I’d ever dreamed off, loyal, nice, didn’t have any boy friends, caring and most of all, not a whore lol. So to me it seemed perfect. We had started hanging out regularly for a month then I asked her to be my gf now being that we met away at collage she isn’t from were i am so we did long distance of the summer, was hard but we did it, and getting ready to come back from my second year of collage I had decided I had enough of my sport I was playing and wanted to try a semester at a collage closer to home with a better degree plan, my gf.. did not like this at all. This in my eyes is the start of where things went sour very quickly. We made it through most of the semester driving up to see her every couple of weekends and then one night while I was with her I said some regrettable things in a heated argument. I told her to go to hell which now looking back was pretty horrible to say and I regret greatly. Not my finest moment. We stayed together for a couple of weeks after that then on another visit up there to see her we got into another heated argument and I was planning on coming back into town by transferring to another local school where she was with my major, and I told her that “no matter if we’re still together or not I’m going to come back” which was true but she didn’t like that, she stormed out of my vehicle back into her house and claimed we needed to be on break, I have never been on a break before and she has told me that breaks are stupid and she doesn’t believe in them so me at the time I was distort , we still texted daily but we called a lot less frequent and she didn’t want me to come visit, she constantly pushed back the date that I come and see her, well after about a month of our break she very half assedly asked me to be her bf again lol. And I obviously said yes, now it’s the weekend of thanksgiving break aka this weekend and we spent this weekend together and it actually went really really well almost no fighting or anything. Then tonight when I had a weird feeling trying to go to bed next to her I decided to look through her phone (yes I know this is wrong without permission but I normally don’t do this) I had seen the normal… her calling me, her calling mom, some of her girlfriends then I seen too names I didn’t recognize. Two boy names, I then looked through her messages and seen that she has seemingly texted them back and forth too, the texts seemed a bit odd with one being a “miss u” but all this happened during our break. She doesn’t have guy friends like that and I don’t have any girl friends we both mutually agreed that was weird. The one guy she had not texted since 2024. Now it’s currently 3:47 am at the time of writing this Ive gone through the grief process of everything but now I’m not sure what to do, do I ask her about it? Do I ask why she would lie to me about staying faithful during our break. I’m sure to be honest, I’m sure there are lots of plot holes so if you have questions just ask and I’ll answer. Thank you for your time reading. I hope you enjoyed lol.","url":"https://www.reddit.com/r/relationship_advice/comments/1p67my3/my_20f_gf_has_been_at_least_emotionally_cheating/","permalink":"/r/relationship_advice/comments/1p67my3/my_20f_gf_has_been_at_least_emotionally_cheating/","score":7,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764060908.0,"edited":1764061211.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6uidn","name":"t3_1p6uidn","subreddit":"relationship_advice","author":"RemoteEmotions","title":"Girlfriend [28F] Upset that I [34M] hang out with a female friend","selftext":"For context my girlfriend hates cars and my friend loves cars. I don’t have any feelings for her.\n\nI am currently fixing a car for her and it’s been a two day project; I am getting paid. \n\nToday, I was wrapping up and figured hey why not get an extra set of hands to get my old Volvo to the tire shop so I had her ride with me in case the tires blew up and have an extra set of hands.\n\nI had my girlfriend pick us up and she was super cold and didn’t say much.\n\nWhen we dropped her off, she was upset saying that I’m flirting because I opened the door for her. \n\nShe was also upset that I didn’t ask her for help, even though she hates my cars and never wants to really help out anyway. \n\nHow can I reassure my partner that she is just a friend?\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6uidn/girlfriend_28f_upset_that_i_34m_hang_out_with_a/","permalink":"/r/relationship_advice/comments/1p6uidn/girlfriend_28f_upset_that_i_34m_hang_out_with_a/","score":5,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764119920.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rrrm","name":"t3_1p6rrrm","subreddit":"relationship_advice","author":"WillNotBeKept","title":"25F GF offered 30M to break up but stay close friends after a bump in our relationship","selftext":"My girlfriend (25F) recently told me (30M) that we should break up mutually but stay friends. I said okay, but made it clear that if we’re going to be friends, I would start dating other people and wouldn’t treat her the same way I did as my girlfriend.\n\nShe got mad at the fact I said I couldn’t treat her like a gf by complimenting her and being romantic, because we’re not in a relationship. Also the fact I mentioned dating others if we are friends. Then she said something like, “if we do this to get back together, because we’ll figure each other out.” My opinion is we stay as bf/gf and work through this if we like eachother.\n\nI feel like I’m being led on. I want to date other people if we’re going to be friends, and this doesn’t feel like a normal or mature way to handle things.\n\nWhat is going on here? What is she doing?\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rrrm/25f_gf_offered_30m_to_break_up_but_stay_close/","permalink":"/r/relationship_advice/comments/1p6rrrm/25f_gf_offered_30m_to_break_up_but_stay_close/","score":5,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764112597.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6hm6a","name":"t3_1p6hm6a","subreddit":"relationship_advice","author":"_dish_soap_","title":"When did you know you loved your partner? (21 F, 22 M)","selftext":"I’m 21F and I’ve been dating my boyfriend 22M for two months know. I know in retrospect this is very short amount of time and there isn’t a ‘correct’ time frame for these things but it’s my first relationship and would just like some outside perspective of what love is meant to feel like if that makes sense :) He dropped the L bomb two days after we started officially dating which I know is early and as somebody who’s been quite emotionally avoidant my whole life it really took me by surprise. I really like him but when does it become apparent that you love somebody? I think it sometimes but I feel like if I say it it’ll come out wrong and i’ll convince myself I don’t actually mean it and it just spirals from there. Is there a moment when it will all just ‘click’?\n\n**TL;DR;** : When did you know you loved your partner and how long did it take?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6hm6a/when_did_you_know_you_loved_your_partner_21_f_22_m/","permalink":"/r/relationship_advice/comments/1p6hm6a/when_did_you_know_you_loved_your_partner_21_f_22_m/","score":5,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764089544.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zwrz","name":"t3_1p5zwrz","subreddit":"relationship_advice","author":"Ghoulsplatters","title":"Jealousy 20M 22F","selftext":"Everytime my bf and I had an argument he talked to the same girl. I told him I didn't like it, especially since someone I know sent me a screenshot of him saying that she's a virgin. If they were talking about that, what else are they talking about? Anyway, after I told him I was upset, he said he would block her and showed me he did. But now, months later, I'm still upset about it. Like, if we are having a little disagreement, is he going to start talking to her again? Is there anyway to fix me thinking like this? We have been together for 3 years.","url":"https://www.reddit.com/r/relationship_advice/comments/1p5zwrz/jealousy_20m_22f/","permalink":"/r/relationship_advice/comments/1p5zwrz/jealousy_20m_22f/","score":6,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764035318.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mv09","name":"t3_1p6mv09","subreddit":"relationship_advice","author":"ConcentrateOk7009","title":"Boyfriend (22 M) indirectly said I'm (22 F) ugly and his initial thoughts about me are changing. what to do now?","selftext":"This can be divided into 3 parts. Our initial friendship, start and progress of our relationship, current feelings and thoughts\n\n1. **Initial friendship:** we met here on reddit. My point of interest(platonic, just curiosity) was his vast knowledge on many things including tech. His interest in me was a post where I was asking fashion advice and how I didn't care about how \"classiness\" of the background. His other interest was the college I went to (which is quite popular for its tough admission test).   \nWe used to talk about random things and mostly our views of life matched. \n\nslowly, it transformed into a mutual support environment where we encouraged and supported each other through our daily life (mostly struggles regarding goals). At a point he was so lonely so we decided to hang out since we lived nearby at that time (now far from each other). There were zero thoughts about relationships or anything.\n\n2. **Relationship progress:** In the first meet, we started to catch feelings. After second meet, he had to go home in a different state. We didnt confront our feelings or anything. But the news of seperation kindof hit us and we went through FOMO. After a few tiny conflicts, we confessed and hence started the relationship.\n\never since, we were talking consistently on video calls almost everyday. In between, surprisingly, we even had a chance to meet. And since then, we have been falling apart.\n\nThe thing is, maybe he thought I am very smart. But I was depressed for past few years and lost most of my spark after joining college. I don't keep up with the current tech updates (not as much as he does) or have much knowledge in as many fields as he has. So he gets bored in the video calls nowadays.. Anything I try to talk about is cringe according to him (tbh he does have interesting things to talk about and I.. not much). I was mostly strong in the emotional suite and I still am. But ig that won't keep the relationship standing..\n\nInitially in the relationship, he used to find me attractive and beautiful. But nowadays, he gets bored looking at me. He even says I need to become more beautiful and finds imperfections in my body (I grew a bit muscle in the gym 8 months ago but stopped going. and I think a few health issues are showing up a bit so I look a little like melted muscle)  \n  \n3. **My thoughts:**   My conclusions are \n\n* I'm bland compared to him \n* He's more unstable compared to me\n* I'm less attractive compared to him\n\nConsidering how well our life view matches, we even thought we should get married in the future. ofc we were well aware that conflicts will arise. What's scary now is that IDK he's not communicating very well with me. I've tried to bring up this not so visible conflict many times.. That's why I said he's unstable. \n\nThat aside.. I'm really not feeling good about the comments \"you're boring\" and implemented \"looks are not your suite\".. I know those both. But ig I expected him to like me for my emotional strength and overall maturity and kindness and my view of life. ANd them only. I feel weird about him taunting my few physical traits. Maybe I'm being insecure here. Maybe he's just encouraging me to be more presetable.. \n\nBut I don't feel like I deserve him in the attractiveness suite. I always had this morale that I should date only the people who are similar level attractive.... \n\n  \nAnd I'm finding myself wanting to break up with him... but because of looks feels unfair..\n\nhelp me figure out what I'm feeling please\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6mv09/boyfriend_22_m_indirectly_said_im_22_f_ugly_and/","permalink":"/r/relationship_advice/comments/1p6mv09/boyfriend_22_m_indirectly_said_im_22_f_ugly_and/","score":2,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764101029.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6l6gz","name":"t3_1p6l6gz","subreddit":"relationship_advice","author":"DistributionSea6103","title":"Got rejected (32 M) after my first date (31F) right after a major breakup and it’s hitting harder than I expected","selftext":"32M here. I went on a first date with a 31F after getting out of a serious relationship a few months ago. The date felt genuinely great, good conversation, real chemistry, everything flowing naturally. Then out of nowhere she told me we’re “not compatible” and that we should stop talking.\n\nGetting dropped twice back-to-back is hitting my confidence harder than I expected. I’m trying to figure out how to bounce back without letting this spiral into self-doubt.\n\nHow do you pick yourself up when it feels like every new attempt just knocks you down again?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6l6gz/got_rejected_32_m_after_my_first_date_31f_right/","permalink":"/r/relationship_advice/comments/1p6l6gz/got_rejected_32_m_after_my_first_date_31f_right/","score":4,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764097323.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6iute","name":"t3_1p6iute","subreddit":"relationship_advice","author":"andromacheofscythiaa","title":"I (25F) & BF (21M) May be Doomed","selftext":"forgive my grammar \n\ni’m writing this because i’m severely mentally ill. i know many of you are probably like if you have to ask that question, you know the answer. i wish it were that easy with my chemically unbalanced and trauma-full brain. we’ve been together for almost 2 years. i will start off by saying he’s great. like genuinely patient, kind, nerdy, handsome, & funny. he’s so gentle. he’s like the exact opposite of me. we were raised so differently. & i’m still unlearning many negative patterns. \n\nthe problem is that i’m constantly annoyed, constantly questioning our relationship since the beginning. i honestly feel like i’m in fight for flight mode 24/7. i get irritated, tense, and ready to “bark” at any moment. i’m not patient, i’m not gentle. i yell. i withdraw. \ni was in a bad place when we met, making impulsive decisions. we got together quickly, moved in together like 6 months into the relationship. so it almost feels like our relationship was rotten from the start? this is the most stable (besides my constant breakdowns) situation i’ve ever had. things seem boring, monotonous, and like i’m settling. the other issue is that i have no desire to date someone else, so it’s nothing like that. i’m not imagining an ideal partner. i do miss being alone, a lot more lately. i feel suffocated. i feel trapped. i’ve explained all of this to him. it’s hard for me to hide my emotions, so he can easily read me. i constantly apologize to him and recognize how he has to deal w my crap. but he just responds that he loves each & every part of me & that he’s not “putting up” with anything. i truly don’t understand. idk how he still feels that way. we don’t really have sex anymore, i’m rarely in the mood, which is weird because i’ve always been hyper sexual (to a detriment). that makes everything feel broken. and i struggle with kissing as well. i love him so much and don’t want to hurt him. but ik that i hurt him by staying even if he says i don’t. no one wants to feel like they’re walking on eggshells around their person. no one wants to be yelled or told they’re annoying. i don’t want to regret leaving him because of my mental illness. \n\ni truly can’t trust myself, in any area of life, but especially this. i believe at this point, it’s okay to admit that even if this relationship is/can be great, maybe the mental illness isn’t capable of letting me be in a loving relationship. maybe it’s better to be alone than to hurt someone who deserves to be loved softly and intentionally. i know that my mental illness isn’t an excuse to treat someone poorly. \n\nas you can see, this is all over the place. but this is a snippet of what my brain is constantly cycling through, constant emotional disregulation. it’s like a big, tangled mess. please help me make sense of it. therapy isn’t working, meds aren’t working.  i’m not looking for pity. i just feel so lost right now & i just need unbiased, tough words.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6iute/i_25f_bf_21m_may_be_doomed/","permalink":"/r/relationship_advice/comments/1p6iute/i_25f_bf_21m_may_be_doomed/","score":4,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764092272.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67hwy","name":"t3_1p67hwy","subreddit":"relationship_advice","author":"Worried_Wafer_1761","title":"My gf (27F) can’t stand some of my (28M) friends","selftext":"TLDR: my GF (27F) is an introvert who really despises the women in my friend group because she thinks they don’t like her, don’t include her in things, and are fake to her and only interact with her to be friends with me, and it has gotten to the point where I can no longer hang out in a group all together without a fight happening at the end of the night.  \n\nFor background, I have been dating my GF for 5 years now, and we have been living together for a year. In general, she is more introverted and has a hard time socializing and making a ton of friends whereas I’m more extroverted. I started graduate school and I had to move and we did long distance for a year. During this time, I made a really good group of friends, both guys and girls. She moved in with me the following year, and she has grown to hate this group of friends to the point where it becomes a problem if I want to hang out with them. I think she dislikes how they (particularly the women) don’t include her in anything (e.g. girls brunch with the original group without inviting her) and feel they are very fake towards her and only interact with her to stay friends with me. On one hand I understand how it’s not very inclusive that the girls don’t include her in a lot, but from what I see when we all hang out in a group they have plenty of small talk and seem to get along. It’s also tough because we’re all in the same graduate school so we all relate to things that my GF can’t. Regardless the girls can probably do better to include her I guess. My GF is also pretty introverted so she’s not great at going out of her way to make friends and get to know these people. Regardless at this point she despises me hanging out with them, saying I’m choosing them over her. If she does come, she’ll only want to stay for 1 hour before wanting to leave, and will sometimes just disappear and leave without me which to me is a really bad look. I honestly wouldn’t even mind not being friends with the women in the group, but often times we do big events all together and I just feel like I can’t go to them anymore and actually enjoy myself; and also this makes me much more distant from the group. I’m wondering if there’s a way to fix this, because currently this is unsustainable and causing a massive strain in our relationship. What would be the best course of action? Do I no longer hang out with my friends? Do I break up with my girlfriend over her inability to socialize with them? Somewhere in the middle? I feel like I am becoming distant with my friends and even when I do hang out with them I’m in a constant state of distress because it’ll cause a problem with my GF who doesn’t want to be there and thinks I’m choosing them over her by spending time with them when she thinks they don’t like her. \nSometimes I’ll go without her but then she’ll be mad I went to spend time with them and not her when she knows that I know she hates them and thinks they don’t like her, and she’ll be sitting at home ruminating and gets mad. To reiterate this is only with the women of the group, she doesn’t have a problem with the men. Also I’ve tried to reassure her that the girls don’t have any problems with her and like to have her around. \n\nNow that I think of it, this situation is the main problem but in general she is pretty introverted and doesn’t like to socialize like I do. When we go to events together we’re always the first to leave because she wants to go home. In general I feel like I’ve become much less social and said “no” to a lot of events since we’ve become more serious. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p67hwy/my_gf_27f_cant_stand_some_of_my_28m_friends/","permalink":"/r/relationship_advice/comments/1p67hwy/my_gf_27f_cant_stand_some_of_my_28m_friends/","score":5,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764060351.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67h00","name":"t3_1p67h00","subreddit":"relationship_advice","author":"TwiggerWord","title":"Long Distance girl [18F] I [20M] was talking to suddenly needed space. It's been a while, not sure what to do?","selftext":"I've been talking to a girl online for about a month. We clicked really fast, calls, gaming together, joking around, and just generally enjoying each other's company. Felt very natural.\n\n  \nWe do live far apart with a big time difference, so our schedlues don't always mtach, never felt like a problem though.\n\n  \nA few weeks ago she told me she was stressed, wasen't feeling all to well, and needed some time alone to deal with personal stuff. I told her I completely understood and that she could take all the time she needed.\n\n  \nShe sent a couple of short updates over the next two weeks saying she was still overwhelmed and not doing great. Since then, it's been silence. It's now been around two weeks since I last heard from her.\n\n  \nI haven't messaged her again because I don't want to pressure her or make her feel guilty, especially if she's genuinely struggling. But at the same time, I care about her and the silence has been though to sit with.\n\nMy plan was to wait a bit longer and then send a simple \"Hope you're doing okay\" check-in without expecting a reply.","url":"https://www.reddit.com/r/relationship_advice/comments/1p67h00/long_distance_girl_18f_i_20m_was_talking_to/","permalink":"/r/relationship_advice/comments/1p67h00/long_distance_girl_18f_i_20m_was_talking_to/","score":4,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764060251.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63u0i","name":"t3_1p63u0i","subreddit":"relationship_advice","author":"Aggressive-Length927","title":"I (f23) don’t know why he(m24) said love you","selftext":"Hi, It’s been almost three months since I started dating him.\n\nOne day, we were on the phone and he said “love you” before hanging up. I was so surprised but it just passed without much comment.\n\nI thought he had started to love me☺️ but I realised he hadn’t, because when I talked about our future, he told me it was too soon to talk about love.\n\nA week later, he said “love you” before hanging up again, so I asked him why he said that. \n\nI don’t know if he’s shy or what but he tried to avoid the question so I told him don’t say ‘love you’ if you don’t mean it, because it confuses me\n\nWhat do you think?","url":"https://www.reddit.com/r/relationship_advice/comments/1p63u0i/i_f23_dont_know_why_hem24_said_love_you/","permalink":"/r/relationship_advice/comments/1p63u0i/i_f23_dont_know_why_hem24_said_love_you/","score":4,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764046985.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6twgk","name":"t3_1p6twgk","subreddit":"relationship_advice","author":"kugkfokj","title":"How can I (36M) deal with a partner (34F) that cannot control their emotions?","selftext":"My wife has difficulty regulating her emotions, particularly when she is feeling stressed or unappreciated (not necessarily by me). She often directs her frustration toward me, which manifests as either overt anger or passive-aggressive behavior.\n\nThroughout our relationship, I have attempted to overlook this issue because she is otherwise a wonderful person, and she frequently apologizes when she realizes she is being, in her words, \"a bitch,\" which I do genuinely appreciate. However, I have recently noticed that my patience is wearing thin. I entered this relationship believing, based on her assurance (and perhaps it was my error to fully rely on that), that she would eventually mature into a person more capable of expressing her feelings in a calm and rational manner, but this has simply not happened.\n\nFor context, my wife does not lead a particularly stressful life; she has a relatively low-stress job and I am the primary financial provider, and she mostly works from home. Knowing that she struggles with self-esteem, I make every effort to acknowledge and appreciate all of her contributions (which are many!). She is the daughter of two very stern and emotionally unstable parents, and she generally attributes her mood swings to her childhood.\n\nWe have both tried implementing changes in our personal lives and within our marriage to address this problem, but without success. I am now at a point where I am starting to feel resentful toward her because of all the positive moments her mood swings have ruined, including many significant occasions. Furthermore, I feel I am developing what I can only describe as a mild form of PTSD: the constant fear that every time we interact, she will eventually lash out at me.\n\nI do not want this marriage to end. Yet, I also want to be happy, and I want her to be happy as well. I recognize that a platform like Reddit cannot solve this problem for me, but perhaps you can help me see this problem from a different angle or point me toward helpful resources.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6twgk/how_can_i_36m_deal_with_a_partner_34f_that_cannot/","permalink":"/r/relationship_advice/comments/1p6twgk/how_can_i_36m_deal_with_a_partner_34f_that_cannot/","score":4,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764118234.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rj7h","name":"t3_1p6rj7h","subreddit":"relationship_advice","author":"gothfa3rie","title":"(22F) My 22M partner hasn’t had a job in around 2 years","selftext":"So I’ve 22F been dating my partner now 22M for around three years. He had a job the first year at a supermarket. He ended up over time just not attending shifts and as a result was let go however the issue I have with it is that he lied to me that he was just not getting shifts when I had in fact found the letter stating he was being let go. He still doesn’t know I found that and has told me he left as he didn’t enjoy it. Since then he hasn’t been able to get another stable job. He worked for a couple months around a year ago at a warehouse I’m not sure what happened with it. \nI’ve offered to help him do his resume, suggested he go into places to actually hand it in and go help him look for jobs. He said this is something he likes to do in his own time however it’s been a year since that warehouse job and I haven’t heard anything from him about call backs interviews or even whether they get back to him at all. I haven’t seen his resume either. He’s rejected all the help I’ve offered. \nI’m beginning to get to the point where I’m not sure I even believe he’s applying because I can’t understand how he hasn’t had a single interview.\nHe’s said to me he doesn’t want another job in a supermarket or hospitality or fast food but he has no qualifications so I personally feel like it doesn’t actually matter what your preferences are. Like you haven’t worked properly for two years you just need to get something for the time being? He’s on Centrelink and has been for around a year and has told me he has savings which I guess I see as a good thing but I also see it as you’re saving money you didn’t actually earn. That is not equal to having a job and putting aside savings from that. It’s essentially free money for him at the moment he lives at home. \nAlso worthy to mention he does not study. He built a PC around six months ago with some of his money and some of his parents (he told them it was so he could learn to use 3d game design modelling programs) which is why it was a hefty price, he wanted to apply for a university mainstreaming in game design however he is yet to download a single program for it or start an application for the course. \nI asked him a couple days ago and he said he’s going to join doordash bc they’re doing a Christmas bonus but he’s done uber eats before and his parents don’t like him using all that petrol and kms on the car which is split between him and his dad. My perspective on this is that it is still not a proper job and strikes me as an easy way to get a bonus and not actually continue it. It’s not a stable career with a stable income. \nI’m just feeling very stuck because I love and adore him but every day I am stressed about our future. When I say things like I can’t have a husband without a job at 30 he is adamant he would have a job by then but it’s like you aren’t actually doing anything to work towards that. Keep in mind he also does not exercise or look after himself properly. I’ve been told by people like my brother his friends and my friends that it’s not worth it and they personally would not put up with it but what am I supposed to do when I love him so much but it seems no matter how I approach it whether it be with support encouragement anger stress or threats nothing seems to change. It’s also causing me to resent him which pains me so much to say but it’s so incredibly frustrating to watch someone I love waste their time away like that, especially when I’m wanting to have a future with them. I feel like I’ve been so patient and supportive but eventually it’s going to run out. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rj7h/22f_my_22m_partner_hasnt_had_a_job_in_around_2/","permalink":"/r/relationship_advice/comments/1p6rj7h/22f_my_22m_partner_hasnt_had_a_job_in_around_2/","score":3,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764111985.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6quov","name":"t3_1p6quov","subreddit":"relationship_advice","author":"pawpewcat","title":"I 20F ask my partner 27M why he never buy me flowers","selftext":"Me and my partner have been in a relationship for 3 years, 2 years long distance relationship.\n\nWe were just chilling and I saw a video where an old couple surprised her with flowers - and I ask him nicely and playfully to my partner that why he never get me flowers and his response is I have to ask if I want a flower because he can't read my mind. I said, you don't have to ask if I want flowers or not because mostly women want flowers. He said, he is sorry but that's just bullshit and women still have to ask if they want flowers or not. I was like that's not the point no matter what kind of flowers even wild flowers they'll still be happy.\nNot that because they wants specific flowers, they want romance or something like that which I know romance is not always about flowers but that's just for example I gave him.\n\nAnd we have little arguments about it. I'm not being petty about it but the way he responds is make me think what people thinking about the argument we have?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6quov/i_20f_ask_my_partner_27m_why_he_never_buy_me/","permalink":"/r/relationship_advice/comments/1p6quov/i_20f_ask_my_partner_27m_why_he_never_buy_me/","score":3,"num_comments":54,"over_18":false,"stickied":false,"created_utc":1764110274.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p4jt","name":"t3_1p6p4jt","subreddit":"relationship_advice","author":"Proud_Present2080","title":"Why is he (34M) not responding to texts but he IS viewing my (38F) dating profile?","selftext":"Okay, Reddit, I need outside brains on this because mine is fried.\n\nI was talking to a guy for a couple weeks. Great vibe, great banter, 4.5-hour phone call, lots of joking, flirting, all that good early-connection stuff. He preached about “communication being key” on his dating profile - literally wrote it like a slogan.\n\nThen he left for a trip.\n\nI expected light communication (not paragraphs, not constant texting, just normal human “hey, made it” energy). And for the first couple days, he was reaching out! Then after sending a meme that made no sense and me not responding? Nothing. The next day I finally did reach out to say hi. Still…NOTHING! Messages started going from “read” to just “delivered”.\nThree days. \nFIVE days. \nA full week. \nRadio silence.\n\nSo after a week of silence, I finally got on his dating profile which showed his location was HOME (I didn’t know when he would arrive home but figured when he did, he’d surely reach out). I finally texted him something simple and calm - I basically said I was disappointed in the total lack of communication/ghosting, but that I hoped he had a great trip.\n\nAND HERE’S THE WILD PART:\n\nA few hours after the sending the text I got on my app and was alerted that he had viewed my profile 25 times. Before, it was just 24 times so AFTER receiving my final text, instead of responding, he just got on my dating profile instead🤔\n\nLike dude - you can’t text me but you can creep on my dating profile??\n\nSo Reddit, help:\n\n1. Why would someone ghost me for a week but still look at my dating profile over and over?\n2. Does this mean “I’m interested but avoidant,” “I’m bored and still jet lagged,” or “I’m scouting to see if I’ve been replaced”?\n3. And do I just take this as the universe telling me to let him go permanently?\n\nI’m not planning to reach out again.\nI just want outside opinions because this behavior is…A LOT","url":"https://www.reddit.com/r/relationship_advice/comments/1p6p4jt/why_is_he_34m_not_responding_to_texts_but_he_is/","permalink":"/r/relationship_advice/comments/1p6p4jt/why_is_he_34m_not_responding_to_texts_but_he_is/","score":3,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764106193.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nvoy","name":"t3_1p6nvoy","subreddit":"relationship_advice","author":"Substantial_Noise497","title":"F24/M24: He asked for space after a tough conversation — how do I cope with the silence and not spiral?","selftext":"My boyfriend of two years and I had a tough conversation last Thursday. It came up really suddenly, and I wasn’t mentally prepared to get into some of the heavier topics we ended up talking about: things like our future, the possibility of long distance, and how we’re trying to meet each other’s needs during an already busy and stressful time.\n\nWe’ve touched on this stuff before, and the past few months have been a little rocky as we’ve tried to navigate a lot of uncertainty and external life factors. I tend to have a more anxious reaction to thinking about the future than he does, and in the past, whenever I’ve brought up concerns, he’s been really comforting and reassuring. But Thursday felt different.\n\nWe started talking about something small, and it snowballed into whether long-term is actually feasible right now, given that we might end up in different states and different life transitions. I told him I want to make it work with him, I just don’t know how yet. He said he had always assumed we’d try long distance and that my hesitation caught him off guard. Then he said he was emotionally tired from the doubts I’ve brought up over the past few months and suggested we both focus on ourselves for now.\n\nNeither of us actually wanted to break up, so the conversation ended with him saying we should take space for a few days and talk again later. But I had a really rough night after that, and I messed up by texting him a few times to apologize, and then to say I’d respect his space and he could reach out when he’s ready. He hasn’t replied, which is expected, but it’s been really hard. I haven’t been sleeping or eating well, and generally I'm having a hard time thinking straight.\n\nIt’s now Tuesday afternoon, which I know that is still probably within the realm of \"a few days,\" but the prolonged silence is making me spiral. I sent a short check-in with a voice memo yesterday just saying he means a lot to me and that I’d really appreciate the chance to talk whenever he’s ready. And then I messed up again by calling him later because I was having a panic attack and I just needed a word of reassurance, even if just small. I feel guilty for reaching out at all since he asked for space, but I’m genuinely struggling. There was no clear timeline given, and he’s never ignored my texts like this, even during our tougher moments over the past two years. It’s starting to feel like a breakup, and all I want is the chance to talk again and try to figure this out together.\n\nI know my anxiety is making all of this feel even worse. I guess I just need reassurance that taking space for an unknown amount of time doesn’t automatically mean he’s preparing to break up with me, and that not hearing from him doesn’t mean the door is closed.\n\n**TL;DR:** My boyfriend (M24) and I (F24) agreed to take space after a heavy conversation about our future. I reached out a few times because I was really anxious, and he’s been completely silent. I’m struggling with the uncertainty and don’t know how to cope while waiting for him to reach out again.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6nvoy/f24m24_he_asked_for_space_after_a_tough/","permalink":"/r/relationship_advice/comments/1p6nvoy/f24m24_he_asked_for_space_after_a_tough/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764103358.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6f3do","name":"t3_1p6f3do","subreddit":"relationship_advice","author":"ChoiceBullfrog4860","title":"I (20F) don't know if I should try again with my ex (21F)","selftext":"So I'll try and keep this short. My ex and I dated for 9 months, and around a month ago we made the transition from a romantic relationship to a friendship. Our relationship broke down as she was struggling with her mental health and decided that a relationship just wasn't on the cards. \n\nI wanted to work it out with her, and in the end we agreed that we would maintain a friendship, but we would try again in three months once she had the time to get on meds, and try treatment for what may be bpd and schizophrenia. Now I'm aware of the difficulties around these disorders as I have studied psychology for years, and I would like to make it clear that they are not a deal breaker for me.\n\nThe problem is I feel old patterns repeating themselves in our friendship. There are times where I can feel there's less communication and that she is struggling with something, but opposed to talking it out she just shuts down on me. We'll have a week where she is messaging me every night when she finishes work, asking about my day etc. And then a couple days where she won't message me, and if I reach out I get ignored or one word replies.\n\nNow I know that if we were to get back together I'd need to reinforce better communication right off the bat, but I don't know if I want to wait the three months in order to do that. Part of me thinks that if we both tried then communication could improve dramatically. But I don't know if she is willing to try and would like to ask this.\n\nRight now this lack of communication is making me feel as though she has changed her mind and is not willing to try again anymore. But I don't want to bring this up with her and smother her with questions whilst she is trying to heal. So my question is, would make more sense to wait 3 months or bring up my concerns now?\n\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6f3do/i_20f_dont_know_if_i_should_try_again_with_my_ex/","permalink":"/r/relationship_advice/comments/1p6f3do/i_20f_dont_know_if_i_should_try_again_with_my_ex/","score":3,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764083913.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6d6bu","name":"t3_1p6d6bu","subreddit":"relationship_advice","author":"AccidentalGhostx","title":"I believe My (F26) boyfriend (M39) is married","selftext":"I’m (F26) and my boyfriend is (M39). \nWe’ve been dating about six months now, I met him while I was working temporarily in his city. I wasn’t interested in dating him at all at first but he was persistent and I folded lol. I liked him\n\nI went back to my city about a month ago and he sent me a pic of himself. I don’t think he realizes the ring on his chain is showing... I’m saying this because I never saw the end of his chain in any of his other pics when I looked back at them to check.\nTo say I was shocked, angry, and disgusted is an understatement. We’re long distance for now and I was planning to move to his city and to move my work there too. But after this.. I feel so ashamed because there are some explicit pics of me out there iykyk, plus we $ext sometimes, ew just thinking about it make me wanna throw up\n\nI never thought he could be married!! Saying I hate him rn isn’t enough. That hate is starting to turn on me and I hate myself for it. I couldn’t find anything about him in public court records and now I’m paranoid it’s not even his real name I don’t know how to find out if he has a wife or kids, I’ve asked him before and he said no obv because why would he say yes (:\n\nI feel like throwing up and I don’t know what to do. Advice please?\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6d6bu/i_believe_my_f26_boyfriend_m39_is_married/","permalink":"/r/relationship_advice/comments/1p6d6bu/i_believe_my_f26_boyfriend_m39_is_married/","score":3,"num_comments":73,"over_18":false,"stickied":false,"created_utc":1764079268.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6cr3x","name":"t3_1p6cr3x","subreddit":"relationship_advice","author":"anxiousgoogle","title":"I (22F) feel like I gave my life to be a gf to (24M). Where am I supposed to go from here?","selftext":"My boyfriend N (24M) and I (22F) have been together for nearly 3 years. In the beginning I absolutely adored him, and I felt like he felt the same. But then his mom got sick- she was diagnosed with ALS. I moved in with them to help, tried to be the best gf I could be and the best to her as well. She passed in August. \n\nThis is where things get hard and I don’t know if I’m a selfish asshole or if he truly just doesn’t care the way I do. I feel like the majority of our relationship has been me giving things - moving away from my family, helping with his mom and babysitting nieces/nephews. Now that his mom is gone I pay all the rent and buy all the groceries. I was in the room when she was unplugged from brain death, took care of the kids that night so the adults could say goodbye, worked on getting the medical equipment back to loaners, etc.\n\nI asked that we move closer to my family because I’m lonely, all the time. We finally agreed on spending at least an hour together per night, but most nights he games and I’m just… here. He agreed to this, but…\n\nFor one, his dad recently said I can’t call him by the nickname the whole family uses for him. He said it was “too personal” which after 3 years and never even hearing his real first name, felt like a total slap in the face. He also didn’t tell me when his moms ashes came back, or that he’d decided not to keep any (which is a personal decision, obviously, but something I wish I’d have known about and could’ve supported him on.) and lastly, last night he told me he’s not willing to split thanksgiving between our families; he’d rather us just go to our own and not spend the day together.\n\nI’ve talked about all of this with him, multiple times- and it almost always either turns around on me, or I get a big apology before nothing changes. I am trying so so hard to have grace but it’s hard. It is so hard keeping us both afloat financially and then being treated like I don’t matter after everything I gave for this family because of how much I loved both him and his mom. I can’t even show sadness or missing her because I know logically it’s worse for him, and he doesn’t have any grace for me when I do say that I’m thinking about her.\n\nI feel like I’ve given up years of my life to go through something traumatic, and I am *just* a girlfriend, like none of it happened. Half of the time I can’t stand myself because I feel like I am disgusting and selfish for not just hushing. I don’t know where to go from here. Do I give him more grace and space? Do I stay with my mom for awhile (something we’ve talked about, in passing)? Do I just leave? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6cr3x/i_22f_feel_like_i_gave_my_life_to_be_a_gf_to_24m/","permalink":"/r/relationship_advice/comments/1p6cr3x/i_22f_feel_like_i_gave_my_life_to_be_a_gf_to_24m/","score":3,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764078169.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6aw6o","name":"t3_1p6aw6o","subreddit":"relationship_advice","author":"KwazieGFX","title":"My (23M) mentally abusive now Ex-GF(26M) is trying to reel me back in, I need words of wisdom because this has been absolutely devastating to me mentally","selftext":"Me and her had been dating for 7 months and it’s had a few up and down moments some kind of like this one I’m about to tell. But I’d had enough because I’ve had far too much grace with this woman’s behavior and it’s been hurting me mentally. Today I dumped her. And now she’s trying to get me back.\n\nThis all happened because out of nowhere she said “since you work third shift until January how about we just not see each other until then”. Why on earth would I not see you for two months when I have days off and you are 2 miles away. Just had a great date 2 days ago and now this out of nowhere. Then she said “I don’t think we’re a good match”. That’s what stated the conversation that led to what she said below. \n\nIt takes almost nothing to make this woman think you are uncaring or be extremely suspicious of you. I’m not perfect but I’m honestly a loving and affectionate man and being non attentive or unloyal is NOT me. \n\nLike I spend every day off and every chance we get with her. (I work 3rd shift for the time being, she doesn’t). I call her several times a day. Apparently I don’t give her attention. \n\nShe was mad today that I wanted to call her and my sister on my way to work today (1hr commute, 30 minutes each person approximately). And I was gonna call just her (my gf) on my breaks as I always do. Nothing out of the ordinary right. Nope, she said I should have called my sister yesterday and I don’t prioritize her enough and don’t plan accordingly. \n\nDo I really have to sit down and plan my phone calls to family and tell her days ahead of time to appease her? Who does that\n\nAnd she was mad at me today because I text and Snapchat her all day and sometimes I respond to her Snapchat then immediately after respond to her text. “You snapping me first shows you care more about a photo than a conversation”. Like what??? How does that make sense when I immediately resume to texting you? \n\nAnd keep in mind I started that habit of snapping her first because she had an outburst when I was texting her and forgot to answer her Snapchat. Claiming I did it on purpose to piss her off. I don’t do anything on purpose to piss my partner off, that’s not how I operate.\n\nAnd my favorite of tonight’s outburst. A month ago I got her a strawberry chai at starbucks instead of a strawberry açaí, because the employee misunderstood me due to my bad pronunciation and me not knowing what the drink looks like. I offered to get her the correct drink but she said it’s fine and tastes good. But today it’s on her list of reasons she believes I don’t care about her. Because she said I didnt care enough that I got her the wrong drink. I literally wanted to go back and get her the right drink but she declined. My fault I guess.\n\nAnd why this hurts so bad is this happens in cycles where 2 days ago I was apparently her future husband and she was talking about how we’d make a great family. Then again, I get blindsided by this. It’s kind of pathetic how depressed I get when somebody is clearly walking on me. \n\nNow she’s contacting me telling me “I’m so sorry baby🥺, we are best friends you can’t shut me out like this”. 3 fucking hours after apparently we “weren’t a good match”. I cannot believe this woman is 26 years old. Even saying “are we serious, you don’t even want to talk about it”. We talked about it, walls of text and she started the convo with that she thinks we are a bad match. What is there to talk about.\n\nAgain I’m not some perfect man but with all the times she’s acted like this I have never cussed her out, belittled her, hit her, nothing. And she accuses me of being toxic. It’s so confusing. \n\nI have a laundry list of little shit thats set her off, she has one that was valid. I was supposed to pick her up from work because she doesn’t have a car and I fell asleep like an idiot and I cried that night because I felt so bad. She got a ride to her house from her coworker. That was irresponsible and I apologized several times for that and owned up to it when it happened.\n\nI know I sound angry which I am but I’m also really depressed. this has taken a toll on me and I can’t sugar coat it, she’s an emotionally abusive person. And for somebody like me who loves hard and to be honest I’m kind of sappy and simpy sometimes, this is horrible for me mentally. But I can’t put up with being labeled a bad boyfriend who doesn’t care because I absolutely am not. This woman was actually the center of my world.\n\nThe times where she’s not like this she acts like I’m actually the best man ever and she imagines marrying me and having kids. And she’s super physically affectionate and it’s intoxicating. So it makes these outbursts even more confusing.\n\nI’m bad with the feeling of losing somebody I love even when I realize this person I fell in love with is not capable of the relationship I want, and not really the person I fell in love with in the beginning. And I’m susceptible to her trick she’s trying to play, where she’s so sorry and it was all a big misunderstanding. I’m not gonna take the bait but the part of my brain that says she’s really sorry and that I’m hurting her will be loud. It’s tough man. I appreciate everybody who took the time to read this.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6aw6o/my_23m_mentally_abusive_now_exgf26m_is_trying_to/","permalink":"/r/relationship_advice/comments/1p6aw6o/my_23m_mentally_abusive_now_exgf26m_is_trying_to/","score":3,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764072827.0,"edited":1764073359.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ahwk","name":"t3_1p6ahwk","subreddit":"relationship_advice","author":"geh1234","title":"Boyfriend [27M] doesn’t want to have sex with me [27F]","selftext":"My boyfriend and I are very happy together, our relationship has been so smooth running from the start. We are kind, respectful, honest and playful. I think the absolute world of him and it feels reciprocated. For context we are both 27 and have been together for 1 year.\n\nHowever, he has absolutely no sex drive. His T levels have been checked and they’re normal (we are in the UK). We are both physically fit, and I believe he finds me attractive.\n\nWe cuddle and kiss, we’re very affectionate and loving, but it’s like he just has no sexual desire at all.\n\nHe said he felt he had a ‘normal’ sex drive up until 2-3 years ago, when it just disappeared or very quickly decreased massively. He said he feels like he’s been depressed for a while, and something had just killed his sex drive.\n\nWe had sex maybe about 10 times at the start of the relationship (spaced out a few weeks each time) and it was nice, although still a bit awkward. I felt that was because we were new, and you have to work through that awkward/slightly embarrassing phase.\n\nI don’t know what to do. I absolutely don’t want to leave him. For me, I would just love to have the physical connection and intimacy that comes with having sex with someone you love, and I’m sad we don’t have that.\n\nDoes anyone know what might have caused this for him? Is it depression? Could there be another factor?\n\nHe’s never taken anti depressants. I think he might have adhd although not diagnosed, and he does say he feels very stressed a lot, although we are both physically fit, we gym a lot together and run. \n\nWe now haven’t had sex in 4 months, but our relationship is only getting stronger. I can get changed and he doesn’t bat an eye, he doesn’t touch me at all in a sexual way, but loves to be close to me, cuddle, spoon all night etc. It feels like we are in love but he just has absolutely zero sexual engagement. \n\nI don’t pressure him, our conversations are all very gentle round the topic. He’s said it makes him feel broken, and that he has no control over it. Like it’s something he wants to desperately fix but can’t. \n\nAny help is appreciated. Maybe someone has experienced the same thing? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6ahwk/boyfriend_27m_doesnt_want_to_have_sex_with_me_27f/","permalink":"/r/relationship_advice/comments/1p6ahwk/boyfriend_27m_doesnt_want_to_have_sex_with_me_27f/","score":3,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764071573.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p66qx9","name":"t3_1p66qx9","subreddit":"relationship_advice","author":"courageouspoet","title":"I (24F) love my boyfriend (25M) but he's filthy.","selftext":"We moved into an apartment already infested with german roaches a few months ago-  I have tried my best to keep them at bay with whatever I could, keeping it clean the best I can. I have recently given birth last month and my colicy baby takes up alot of my time, so I haven't been cleaning as much. It's gotten to the point where I tell my bf \"you don't have to clean, just PLEASE make sure to clean after yourself and don't make a mess.\" but nothing has changed. He'll only clean if I ask, to which its done hours later or half assed. He leaves trash and food out in the living room, on the floor, and in our room. Dishes with food in the kitchen and grease on the stove, his dirty laundry everywhere, walks around our carpeted apartment with his dirty work boots etc. \n\nHe has two dogs he brought with him that he claimed full responsibility over- such as feeding, cleaning, walking them etc. (i'll be honest, i'm not a huge animal person or a fan of dog hair being everywhere by any means- but that's the least of my concerns.) What is though, is ever since bringing baby home his uncut male dog has decided to piss inside whenever, regardless of having already peed outside. When my bf cleans it, he doesn't clean it correctly bc I go back over it and there's still pee he didn't bother to soak up. The same dog gets into trash and chews on personal items so he stays kenneled at night or when we're out. \n\nWhat's pushed me to make this post is the fact that we came home today, he went to take dog out of the kennel and said \"he peed a little in it but it's okay, I picked it up with napkins\" which made me side eye because, what? Once baby fell asleep and he put the dog in the kennel for the night, I decided to deep clean everything including the kennel bc I wanted to properly clean it and realized he never removed the blanket from it. I found that find that it, and said blanket, was caked in piss and dried shit that I know he saw but chose to ignore. I cleaned it, threw the blanket out, and took the poor dog a bath. I'm fuming but I know if I show my frustration about it he'll just get mad. He doesn't want to give his dog, who is clearly lacking activity, away to a better home and he doesn't bother to clean after him or himself. He only really helps with baby on weekends, which just consists of him holding her while I finally get sleep or time to clean. I stay because I love this man and I want us to be together as a family. I'm also not working at the moment due to EBF and being paranoid about leaving baby with a babysitter for a job due to past trauma. I don't know what to do, or if i'm overreacting. But this makes me not want to live with him at all.","url":"https://www.reddit.com/r/relationship_advice/comments/1p66qx9/i_24f_love_my_boyfriend_25m_but_hes_filthy/","permalink":"/r/relationship_advice/comments/1p66qx9/i_24f_love_my_boyfriend_25m_but_hes_filthy/","score":3,"num_comments":58,"over_18":false,"stickied":false,"created_utc":1764057444.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65zao","name":"t3_1p65zao","subreddit":"relationship_advice","author":"cAtEAtINgWorMS","title":"I (19f) need help w/ my boyfriend (19m)","selftext":"TLDR: my boyfriend is unstable+stressed and i dont know how to help him.\n\nI have been in this relationship for about 50 days, he's my first boyfriend. About 3 weeks ago, his mom was diagnosed with early-stage leukemia. He's been dealing with it pretty well, but alot of our recent phone calls (we dont really talk during school) have just been him crying and me trying (and pretty much failing) to comfort him. He's been extremely stressed and absolutely none of his friends pick up their phones when he calls. He's been pretty strong (and im proud of him for that) but he hasn't been coping well--understandably. he's been getting high, (which he barely does) barely sleeping, and probably isn't taking good care of himself. i don't know what to do--i know i can't make it much better for him, but i want to. How can i help him cope/comfort him?","url":"https://www.reddit.com/r/relationship_advice/comments/1p65zao/i_19f_need_help_w_my_boyfriend_19m/","permalink":"/r/relationship_advice/comments/1p65zao/i_19f_need_help_w_my_boyfriend_19m/","score":3,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764054493.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64t1g","name":"t3_1p64t1g","subreddit":"relationship_advice","author":"Secure_Hall8676","title":"Boyfriend (29M) completely lied to me (30F) about his past relationship. Am I being too nice by forgiving him?","selftext":"Been in a relationship with my (30F) boyfriend (29M) for 6 months. I only recently discovered the truth about his past. \n\nWhen we first started dating, he told me that he went through a terrible breakup with his ex of 2 years. He knows the name of my ex and has seen pictures of my ex on social media, so I was curious about his ex too. I asked for to see her Instagram, but he said he can't find her no matter how hard he looks because she blocked him everywhere and changed all her social media handles. I thought this was weird, but shrugged it off. \n\n  \nFor additional context, he said he is super against keeping any kind of contact with past exes, and that it is a big red flag to keep pictures with exes. He assured me that he no longer has contact with any ex and has unfollowed them and deleted them from every platform. Therefore, I did the same with my ex (blocked everywhere and deleted all photos).\n\n  \nFast forward a few months, I found out that he's still following his ex on multiple social media accounts, in addition to keeping photos of him with his ex on his phone. When I questioned him about it, he kept denying that it was his ex, and even decided to say it was his cousin. I asked more questions, and he continued to lie. Eventually, I got him to admit that it was his ex. He said he lied because he was embarrassed. I told him to delete the pictures, unfollow her on social media, and I would forgive him. And so he did... or so I thought.\n\n  \nFew days later, I am looking through his Instagram followers and found out he was still following his ex's other account. When I asked him why he's still following her, he started crying. I asked if he had lingering feelings. He said no, but he is curious on how she's doing. I asked why he made me unfollow my ex, but he's still allowed to follow his ex. He then says that his \"ex\" is technically not his ex because they never became official. This contradicts what he's previously told me (that his ex asked him to be official after a month of talking).\n\n  \nSo it seems like he keeps making up lie after lie. I can't stop thinking about how many of things he's told me are just complete lies. We've shared many good memories, so I would hate to ruin our relationship over this. Am I being too nice by forgiving him for this or is it reasonable? Is this something that you would forgive your partner for?\n\n  \nTLDR - My boyfriend completely lied about his past relationship. It wasn't a one-time lie, but he's lied about it over and over again. Would you forgive your partner for this?","url":"https://www.reddit.com/r/relationship_advice/comments/1p64t1g/boyfriend_29m_completely_lied_to_me_30f_about_his/","permalink":"/r/relationship_advice/comments/1p64t1g/boyfriend_29m_completely_lied_to_me_30f_about_his/","score":4,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764050277.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p60kzh","name":"t3_1p60kzh","subreddit":"relationship_advice","author":"johnnybanks786","title":"I (20m) have been talking to this girl (18f) for the last couple weeks and I am terrified. I dont know what i should do?","selftext":"I've been talking to this girl for the last few weeks and she is amazing. She is unbelievably out of my league. Looks, personality, everything.\n\nI have had a really busy and hectic few weeks and whilst all that she has been talking to me the whole time and just being the best person. I've had issues and she has supported me like no one else. \n\nI've opened up to her, I'm an open book to be honest, and I open up too quick. In the past I have not been treated the greatest by women so it just makes me hesistant when talking to them. \n\nBut she is so different. She has perspective and views that I have never seen before. And she is just so considerate and caring. Sometimes I'm doing too much and instead of judging me she tells me to relax and calm down. \n\nTo be honest I feel like I can be so vulnerable and open around her. She communicates excellently and I love it so much. But in the back of my mind I am fucking terrified. \n\nAll the women I've talked too have used what I've told them in a sensitive moment against them. And I just can't handle it again. She said she would never and I trust her but there's always this fear in the back of my head. \n\nI would just be crushed, in every way if something like this happens. And that fear its just overwhelming me...","url":"https://www.reddit.com/r/relationship_advice/comments/1p60kzh/i_20m_have_been_talking_to_this_girl_18f_for_the/","permalink":"/r/relationship_advice/comments/1p60kzh/i_20m_have_been_talking_to_this_girl_18f_for_the/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764037230.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tu44","name":"t3_1p6tu44","subreddit":"relationship_advice","author":"AdFluid2576","title":"Yo I'm M/28 and she's F/25 and I don't think if I'm reading everything too much or I'm self-sabotaging.","selftext":"Hi! My problem is that I overthink every small detail and as a result, I'm self sabotaging.\n\nWe've only known each other for about 7 weeks. I am not assuming anything yet but the moment we got introduced, we instantly clicked and we have a lot of things that we both like. We've been talking back and forth on our soc med apps but not always because we're both adults. We always workout that's our common ground since we love working out. Laughing together. In as much that I do not want to assume, I got a feeling that she kind of like me around. As in she's comfortable around me. As for physical contact, we're almost always at each other's personal space. Sometimes we're grazing each other's hands and she's not pulling away. I try to hold her hands for long when we greet each other and I'm the one who ends up pulling away because I'm afraid that I am holding her hand for far too long. Somehow I also notice that she's somehow within proximity and I confirmed it when I walked past her and she call me by name and asked me about my opinion about which dress she should buy. She agreed to a date with me but she asked if one of our common friend should join us. I immediately said yes because I don't want her to feel pressured around me and I thought that It might be a chance to show a side of me whenever with I'm other people. She went without sleep and came from an errand. She could've cancelled or postpone at any moment because she's tired but she still pushed through and I appreciate that kind of effort. We were together for hours and I mean hourse alone since our friend already went to work and oh boy we don't have any dead air and we talked about random stuff. Food, hobbies, travels and family. We parted ways after that and she took our pictures together. She posted me on her page and she's not someone who posts on her page on a random day. She also gave me a gift for my birthday. I can't help but think that she's just reciprocating because I'm being nice.\n\nEarlier this week I gave her sweets since she said she'd love to try that specific store. We planned on meeting at our area so that she could get her sweets. She went there straight from an errand and to my surprise she brought me something as well. She just went there to give and take. We talked about a lot of things later that night. We talked about me being sick and told me I shouldn't have moved that day I didn't feel well. When I was sick and she thought I was feeling better since I'm always working then we asked for each other's review for the food we bought for each other. She's glad that I liked what she picked.\n\nI asked her for a second date playfully, She jokingly said she's not available for next 2 years then I asked her again she said she have some free time. She asked what's the agenda and I told responded with a playful reply and she just haha reacted my message. I think I'm just reacting out of fear.\n\nDo you guys think she's attracted to me or it's too early to tell?   \nI want to know -  is she just being nice to me? or she's showing clear signs that she's also attracted to me but doesn't want to seem too eager?  \nMy reactions are based on her response. Though I don't act on impulse, ( because I know if I did I will ruin everything.) I still can't help but overthink. \n\nHelp a brother out.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tu44/yo_im_m28_and_shes_f25_and_i_dont_think_if_im/","permalink":"/r/relationship_advice/comments/1p6tu44/yo_im_m28_and_shes_f25_and_i_dont_think_if_im/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764118058.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rtio","name":"t3_1p6rtio","subreddit":"relationship_advice","author":"throwRA_solardisc","title":"I 19f, feel lost due to my 19m bf’s feelings about where we’re at?","selftext":"Sorry confusing title, but I didn’t know how to phrase it. My boyfriend and I have been dating for three years and it’s been great. We’ve had ups and downs due to personal family circumstances and stuff but it’s been smooth overall. There’s been a couple of times where he’s pulled away and said that he doesn’t know what he wants in the future. He did it again two days ago. He sobbed and told me he didn’t know what he wants and that he feels like he doesn’t know himself. He said i’m the most amazing person he’s ever known, but that he thinks he hasn’t had enough time to get to know himself and that he’s conflicted about whether he wants to commit to a serious relationship at this age. He said he doesn’t feel as excited to see me anymore. But I thought, well, isn’t that normal? It dies out a little eventually - and he said he doesn’t think it is. We’re on a two week break and he said he thinks he just needs time. I don’t know what to do, or think, i’m just confused because he didn’t even understand himself what he was saying or what he wanted. He said he wanted to be with me but he also wanted to be alone. I don’t know what to feel because he didn’t have a definitive answer or feeling about anything. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rtio/i_19f_feel_lost_due_to_my_19m_bfs_feelings_about/","permalink":"/r/relationship_advice/comments/1p6rtio/i_19f_feel_lost_due_to_my_19m_bfs_feelings_about/","score":2,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764112719.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rls6","name":"t3_1p6rls6","subreddit":"relationship_advice","author":"playfulpanthera","title":"My fwb m22 might have feelings for me f23 or is it just in my head?","selftext":"Okay, I need help with this. \nSo there is this guy. I have been seeing as a friend with benefit, but over the period of time, we actually started play pretending boyfriend girlfriend while hanging out like we would have deep conversations and he would ask me really personal questions, and sometimes he would indulge in answering those too. Couple of times I have nursed him back to health when he was sick. Even lately, I have noticed like the frequency of sex has drastically reduced Infact, my boy here like to cuddle and sleep. And like  he also kisses me a lot in sleep. He says he does this very instinctively almost unknowingly.\n   He says he comes over to play with my house cat and my house gives him very homely feeling. He also apparently ‘instinctively’ calls me to accompany him for haircut or to accompany him to Dentist.  \nPlease tell me, it’s not in my head that this guy might be into me, inspite of him softly denying his interest ?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rls6/my_fwb_m22_might_have_feelings_for_me_f23_or_is/","permalink":"/r/relationship_advice/comments/1p6rls6/my_fwb_m22_might_have_feelings_for_me_f23_or_is/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764112166.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rge4","name":"t3_1p6rge4","subreddit":"relationship_advice","author":"Separate_Wheel6590","title":"2 years, long distance she broke up with me (20m,19f)","selftext":"First time poster, me and my now ex were together for 2 years. What to me felt random, we were playing games together laughing together overall just felt like a good time. We got into one fight because I didn’t like her calling another guy (nothing bad happened and she told me everything they talked about) a day goes by of us not really trying to fix it then during that afternoon she broke up with me. She’s been going through some rough times in life and feel like she’s taking it out on me. Any advice on how to get her back. I feel like long distance makes it so much harder. I think one of the main things is that we never really talked about our future on how we will close the gap or what will happen once we do. Any advice on how to get her back?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6rge4/2_years_long_distance_she_broke_up_with_me_20m19f/","permalink":"/r/relationship_advice/comments/1p6rge4/2_years_long_distance_she_broke_up_with_me_20m19f/","score":2,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764111787.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ppsb","name":"t3_1p6ppsb","subreddit":"relationship_advice","author":"junejiehuang","title":"Exclusivity talk - what happens if he says no? (28M 28F)","selftext":"So I’ve been on 5 dates with someone and on the last date we spend 48 hours together, he pays for everything, we FaceTime, etc. It feels like we’re already a couple and that he’s not seeing anyone else but we haven’t talked about it yet. I plan to bring it up on the next date, that I want to be exclusive, but I’m also preparing for the worst. \n\nWhat if he says that he’s not ready yet? How do I respond or navigate the convo then, and what would you suggest i do? And if he does, does that mean he’s just leading me on and I should stop seeing him? Or is it okay to keep seeing him until he’s “ready”? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6ppsb/exclusivity_talk_what_happens_if_he_says_no_28m/","permalink":"/r/relationship_advice/comments/1p6ppsb/exclusivity_talk_what_happens_if_he_says_no_28m/","score":1,"num_comments":31,"over_18":false,"stickied":false,"created_utc":1764107589.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o11f","name":"t3_1p6o11f","subreddit":"relationship_advice","author":"Physical-Ad3619","title":"My partner (25F) and I (28M) had back to back arguments","selftext":"My partner and I had back to back arhuments today and things have grown tense and cold between us.\n\nThe first argument was about her upcoming medical visit to another GP (not the original one) to check the results of her breast ultrasound. I told her that the previous GP must have made notes or something like this to help the next GP understand. She said she had thrown it away and that it is irrelevant and only the results will be needed (the results did not provide a worded report just the images). She then got upset saying that I didn't trust her judgement. I told her that it could have been useful but if its gone then its okay. I approached this whole thing calmly cause I didn't want to add fuel to the fire. I asked her if we could talk about it so that we can resolve the issue multiple times but she insisted on not. I tried to do so while giving her some time to herself to calm down. Eventually it was resolved and we went to the GP together.\n\nThe second occured just us we were about to sleep. She asked me why I did not give her much attention nowadays and why I don't text her much. She said she always messages me and calls me (from time to time) while I'm at work. I told her that I understand that but consistently replying \"Okay\" only isnt really what I consider substantial messaging and we only really talk for barely 5 mins or less. When I leave I make sure to atleast tell her goodbye and I love her and if I'm not in a rush I give a kiss. But it isn't reciprocated the entire time we've been together and I just felt that I wanted to tell her that's how I felt. She went absolutely ballistic after I told her that and she went on and about how I think she doesn't care about me and that we should just do our own thimg and she misses her old life. As always I tried to approach it as calmly but there was no getting through to her this time. So we basically slept in high tension and cold. Uppn waking up it is still the same tense and cold atmosphere between us.\n\nWhat can I do to approach her and improve our current tense environment?\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6o11f/my_partner_25f_and_i_28m_had_back_to_back/","permalink":"/r/relationship_advice/comments/1p6o11f/my_partner_25f_and_i_28m_had_back_to_back/","score":2,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764103688.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mmha","name":"t3_1p6mmha","subreddit":"relationship_advice","author":"FunBake6240","title":"I (18M) and my ex (18F) are trying to restore a friendship but we are going about it in different ways and I'm not sure what to do?","selftext":"I'm pretty confident that we both want to be friends, we had a pretty long past together and we both hold a lot of gratitude towards each other. But the way we are approaching this \"lets be friends again phase\" are completely different.\n\nFor me, I feel like I am the only one initiating the hard things. I was the one who reached out first after months of time apart. I was the one who had shown a lot of accountability for why the relationship ended, but I also feel like I'm the only one who feels like we should be building this friendship actively and together.  \n  \nShe has repeatedly claimed that things are \"chill\" between us. And has repeatedly stated that things don't have to be that deep, which is okay, but its almost like she is completely avoiding the impact that she had on me after the breakup. I feel like she has avoided real accountability for the fact that she broke up over text and her failure of being able to navigate the breakup or the future together. However, despite that, she repeatedly claimed that she feels like she has shared everything she needs to say.   \n  \nShe does want to be friends though, because she has invited me out to hang out with some friends several times, but whenever I do go, its just extremely awkward between us. Not awkward in the way that we can't laugh or share things, but awkward in the way that we basically never talk one one one, we actively avoiding walking or sitting next to each other at all times, and we struggle to even look at each other in the eyes. She also has been a terrible texter to me when I try to bring up these things, responding hours late and completely ignoring my feelings. Which is really funny to me because I know with 99% accuracy that she has no job, is on a gap year, and has repeatedly said that she just chills around and is bored. \n\nI feel so conflicted because I dont know how to communicate things without feeling like I have to minimize my emotions, or if I do share my emotions, that she just pushes them away because she wants things to be \"simple\" and \"chill.\" I get that being friends again has to have awkwardness to it, but I still feel like the way we are building it now isn't making it safe or sustainable for either of us. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6mmha/i_18m_and_my_ex_18f_are_trying_to_restore_a/","permalink":"/r/relationship_advice/comments/1p6mmha/i_18m_and_my_ex_18f_are_trying_to_restore_a/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764100509.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6j34y","name":"t3_1p6j34y","subreddit":"relationship_advice","author":"beantown710","title":"I (28F) ended things with the guy (32M) I was seeing for two months and I'm instantly regretting the decision?","selftext":"We met both looking for something casual, as he was fresh out of a relationship (only 3 weeks out, to be exact...). But the thing is, we really clicked. We had so many honest conversations about where we were at and we also have so much in common. We had so much fun together, honestly everything felt so perfect and our feelings were actively growing stronger. The last couple of weeks, we started spending more time together and we both noticed a shift. And I knew I wanted to be with him in a more serious way.\n\nHe was going on a short weekend vacation and said he was gonna miss me and when he came back into town he immediately asked to stay the night with me. For whatever reason, this sparked a lot of anxiety. I told him sure, but I'd like to check in. He came over and I asked him where his head and heart were at. He said he was really enjoying his time with me, and was starting to feel some attachment. He said he was still curious about other people/not ready for commitment, however, he went on a date with someone else last week and he said it only made him want to be with me more.\n\nThen, he opened up to me about the fact that he had developed strong feelings for a close friend during the last few months of his last relationship. When his relationship ended, he wanted to give things a shot with this other girl, but she ultimately turned him down. This was all during the first month of us dating, and he told me his heart was still really tender and he was still feeling attached to the idea of her. And \\*this\\* is why he couldn't commit to me. He said his feelings for her have nothing to do with me (I agree) and that he was really scared to tell me because he was afraid it would change my perception of him.\n\nTurns out, it did. We went to sleep and the next morning I felt awful. I felt so distant from him and pulled away from his touch. He had to leave for work and we didn't get to speak much more about it until he came over last night to continue the conversation. I apologized for my distance and then I felt a coldness from him. He said he thinks I'm simply more excited about the idea of a relationship than he is, and I agreed. \n\nI really wanted to take things slow with him but his actions didn't feel casual at all. I met his mom, his friends, he told me he wanted to go on a trip together, and we were opening up on a deeply emotional level. He would say the sweetest things to me, and texted me one morning saying he rolled over in his bed looking for me. He claims this is just the type of person he is, but to me it all felt so serious. And also, unintentional. I suddenly pictured us slipping into a deeply emotional and connected relationship, and a year would pass, and he would feel some sort of resentment because he never took the time to be single. \n\n  \nWe both agreed he needs to take the time to be alone, and that maybe we could revisit things in time, but obviously no guarantees. It felt like the right thing in the moment, but now I'm scared I acted out of anxiety, and he acted out of avoidance. At one point, we were limiting ourselves to seeing each other once a week and that time and space felt \\*so\\* good. It wasn't until we started seeing each other more frequently that I got really nervous. I feel like I should have just reset that boundary of time and space, but instead I cut things off entirely and I am really regretting it. I can't tell if I made the right decision, or if this is for the best.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6j34y/i_28f_ended_things_with_the_guy_32m_i_was_seeing/","permalink":"/r/relationship_advice/comments/1p6j34y/i_28f_ended_things_with_the_guy_32m_i_was_seeing/","score":3,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764092791.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6isdv","name":"t3_1p6isdv","subreddit":"relationship_advice","author":"t4ctic4lc4ctus","title":"Is it too much if I (29F) stop making plans with/inviting my husband (33M) to things?","selftext":"He forgets everything all the time. I tell him I’m going to bring him lunch at work tomorrow since I have a day off, then I get home that day and he’s come home for his lunch break and is eating a burrito because he forgot, then says it doesn’t matter that the plans changed and he forgot because we can just eat what I brought at home right now (but I didn’t even have the chance to buy the actual meal I was going to get him yet, just dessert). \nI’ve been doing swing dancing lessons with my friends every Friday that start at 6pm, and he wanted to go with me to one, but when we got there it was cancelled, so he said we could go to the next one. The next one came around and I texted him to cancel because our friend got out of surgery and was doing badly and needed to be taken care of. I get home thinking he’s working out downstairs but then at 6pm he comes downstairs and asks if I’m ready to go dancing, to which I remind him that I couldn’t go because our friend is all fucked up, plus the lesson would already be started by now, and over by the time we got there if we left immediately anyway. He has been informed that the lesson starts at 6PM every other Friday at least a dozen times, yet he forgets it. I text him to change or cancel plans and he forgets. I make plans for the next day and he forgets. \nHe also forgets my work and school schedule nearly every week. He gets home on wednesdays (an online school day for me) and asks why I’m not at work, and I remind him that I don’t work wednesdays because I have online school. He also texts me nearly every Monday (in person school day where I’m not home and class runs till 9pm), and asks where I am, to which I remind him that I’m at school in person every Monday. \nI’m worried because his memory has always been sort of spotty but it’s getting worse. I told him that it’s frustrating that he always forgets stuff, to which he said I need to text him and remind him (which I did about the lunch thing???), and I told him that he should just put an alarm in his phone as soon as we make a plan. He didn’t seem to care about this idea. I was annoyed and I told him that it’s not normal to be as forgetful as he is, and that it’s seriously concerning, to which he said “ok I’m going back to work now”, then left. I’ve told him several times that I’m worried it could be a medical thing and he should see a doc, but he stonewalls me. \nNow he’s mad at me and I feel like I’m not allowed to be upset or disappointed about it. I ended up apologizing for being mad during the conversation. \nI don’t think I’ve ever received an apology for all the times he’s forgotten something and let me down, because he’s the sort of person who will never apologize if he didn’t mean to hurt me. \nWould it be too dramatic if I just stopped inviting him to stuff and making plans with him? I don’t think he’s going to actually bother putting reminders in his phone, and the onus being on me to remind him all the time is just a massive bummer since it makes me feel like he doesn’t care. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6isdv/is_it_too_much_if_i_29f_stop_making_plans/","permalink":"/r/relationship_advice/comments/1p6isdv/is_it_too_much_if_i_29f_stop_making_plans/","score":2,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764092127.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6gwky","name":"t3_1p6gwky","subreddit":"relationship_advice","author":"Pretty_Solution_7955","title":"Looking for serious advice on my new relationship. I (31F) have started dating a guy (30M)..","selftext":"\n\n\nHi all,  I’d really appreciate your honest thoughts on something that’s been on my mind.\n\nI recently met a guy through the dating app, and we’ve spent two weekends together so far. We agreed to keep seeing each other every weekend, which has felt right, but soon, I’ll be moving to another country for a research posting, which means our relationship could become long-distance.\n\nNeither of us has been in a long-distance relationship before, and to be honest, it makes both of us uneasy. On one hand, he seems genuine: loyal, honest, and capable of commitment. On the other hand, he’s hesitant to make things “official” just yet. He wants to spend more time with me to really see how life feels together and whether I’m “worth” making big sacrifices for, like relocating.\n\nTo me, our conversations feel a bit transactional like there’s a contract being negotiated, rather than a natural, emotional bond forming. I want to build something deeper than just “if-this, then-that.” But I also recognize that we need to plan realistically, especially given the distance.\n\nSo, here’s what I’m wondering:\n\n* Is this kind of very practical, conditional talk normal when you’re starting a serious relationship, especially when long distance is a possibility?\n* Do you think I’m reading too much into things and he’s just being careful or is he being more calculating than is healthy?\n\nThanks in advance for your perspective.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6gwky/looking_for_serious_advice_on_my_new_relationship/","permalink":"/r/relationship_advice/comments/1p6gwky/looking_for_serious_advice_on_my_new_relationship/","score":2,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764087968.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ftjn","name":"t3_1p6ftjn","subreddit":"relationship_advice","author":"TiredAllTheTime43","title":"We (F28 & F25) can’t get engaged until she picks The Ring - and she hasn’t yet","selftext":"When we first got together 5.5 years ago, my partner said she wanted to get engaged to someone after a minimum of 7 years together. I was like okay cool that’s fine. But after 4.5 years together, I started thinking that 4.5 years was well enough time to decide whether you wanted to be with someone, and I asked her what she thought about moving the timeline sooner. She and I had a long discussion and she shared her concerns, which included “how it would it would look to other people”, “only wanting to get married once”, and “not having the money for a ridiculously fancy destination wedding”. I said it felt like she just didn’t want to commit to me. She insisted that wasn’t true and eventually, she agreed that we should engaged sooner. We discussed getting engaged sometime this summer.\n\nIn the past year, we have gone ring shopping 5 times and gotten engaged zero times. She has initiated all of those instances but one. Every time we go, she looks at rings in the case, doesn’t try any on, and then we leave after 20 minutes with her feeling overwhelmed and stressed out. She tells me that “it’s not about me, she knows she wants to marry me, it’s about the ring”. She says she’ll have that piece of jewelry until she dies, so it needs to be perfect. I think it’s worth noting that the type of ring she wants is a very simple gold band, the type that men usually wear.\n\nWhat I’m starting to feel though is that it’s less about the ring and more about me. Over the past year, most of the time we do not talk about getting engaged or being married. I try not to bring it up at all because I don’t want to pressure her. Maybe 3 times this year, she will go through a period of about a week where she will say things like “baby I can’t wait to marry you!” and “I need the ring already!!”. But then I tell her okay let me know when you want to go ring shopping, and then we won’t for months and months. The last time we went was 6 months ago.\n\nThings needing to be perfect is a bit of a theme in our relationship. I am a doer, she is a thinker. I am decisive and she is not. I knew in the first few months of dating that I wanted to spend the rest of my life with her, and after almost 6 years together and 1 year of half-heartedly looking for rings occasionally, on her whim, I’m starting to feel like she still doesn’t know whether she wants to spend the rest of her life with me. She told me she is constantly worried about “messing up her life”. Maybe she feels that way about marrying me.\n\nAnyways, at this point, I’d love to shoot my shot and just propose. But she has insisted that the ring I propose with has to be The Ring. And I don’t have The Ring because she has been thus far incapable of picking The Ring. I know, I know, talk to her. But it would be helpful to get some insight first. Can anyone relate? What should my read be on this situation? What would my next steps be?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6ftjn/we_f28_f25_cant_get_engaged_until_she_picks_the/","permalink":"/r/relationship_advice/comments/1p6ftjn/we_f28_f25_cant_get_engaged_until_she_picks_the/","score":1,"num_comments":57,"over_18":false,"stickied":false,"created_utc":1764085574.0,"edited":1764085895.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6f9rq","name":"t3_1p6f9rq","subreddit":"relationship_advice","author":"irecalllatenovember","title":"My (23F) boyfriend (24M) and his parents want me to go on family vacations with them.  When is it too early?","selftext":"We have been dating for 2.5 months.  The trips would be in summer, so by then we will have been together at least 6 months.  \n\nOne trip would be overseas which feels like quite a big deal to me.  I’ve only taken a trip like that with my own family once.  They seem to take an overseas trip once a year so maybe not as big a deal for them.  His parents would be paying for the whole thing. \n\nThis sounds exciting but also kind of terrifies me because it feels very “serious”.  I feel like by agreeing I’m committing to stay in this relationship for at least the next 9-10 months or maybe more (or else I’d be an asshole who let them pay for my holiday and ditched… and I’d never want to hurt them like that!)\n\nI love my boyfriend but I do not feel certain he’s the one.  Some days I could see us together forever, other days I am highly anxious because I can’t see it at all.  I do have a mild-ish case of relationship OCD which definitely isn’t helping me make this decision.  \n\nEdit to add: I’ve only met his parents once as they live out of town.  They are nice and very generous people.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6f9rq/my_23f_boyfriend_24m_and_his_parents_want_me_to/","permalink":"/r/relationship_advice/comments/1p6f9rq/my_23f_boyfriend_24m_and_his_parents_want_me_to/","score":2,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764084321.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dqou","name":"t3_1p6dqou","subreddit":"relationship_advice","author":"r_lumi","title":"What are some ways I (35f) can stop relying on my boyfriend (44m) for all my social life?","selftext":"I’m realizing I’ve become way too dependent on my boyfriend for my social life. I only have a handful of friends, and I know I should reach out more, but they’re usually busy, and I don’t want to bother them. I live in a lively city with so much to do, yet I tend to stay home unless my boyfriend and I are going somewhere together.\n\nI used to be much more active: I took ballet and Pilates classes, went to a yoga studio, and would go to the beach all the time. Lately I’ve been telling myself I’ll get back into it once the new gym near me opens in December, and it feels too cold to enjoy the beach right now anyway. But honestly, I just don’t have the motivation or drive to do anything except work.\n\nI work from home and technically could work remotely from other places for short periods, but I prefer being at my desk with my big monitors because I’m more productive. Either way, the lack of motivation to get out and do things on my own has become a real issue, and I can tell I need to make a change.\n\nFor anyone who’s been through this: what actually helped you build a life outside your relationship? How did you make friends, find hobbies, or get comfortable doing things alone?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6dqou/what_are_some_ways_i_35f_can_stop_relying_on_my/","permalink":"/r/relationship_advice/comments/1p6dqou/what_are_some_ways_i_35f_can_stop_relying_on_my/","score":2,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764080690.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dg02","name":"t3_1p6dg02","subreddit":"relationship_advice","author":"Lanky_Ad4870","title":"How do I(20M) deal with feeling insecure about my partner’s(21F) past relationship?","selftext":"I need some guidance about a situation with my girlfriend. Recently, while we were cuddling, she mentioned that I’m her 4th relationship and that her previous relationship, which lasted two years, was her “greatest love.” Ever since she said that, I’ve been feeling insecure. Her “I love you” and “I miss you” sometimes feel less genuine now, and I’m worried that I might just be a rebound or replacement.\n\nI’m not trying to rant I just want advice on how to handle these feelings in a healthy way. How can I communicate this without causing unnecessary conflict? I’m from the Philippines, if that helps with context.\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6dg02/how_do_i20m_deal_with_feeling_insecure_about_my/","permalink":"/r/relationship_advice/comments/1p6dg02/how_do_i20m_deal_with_feeling_insecure_about_my/","score":2,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764079951.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6d792","name":"t3_1p6d792","subreddit":"relationship_advice","author":"Brilliant_Silver8158","title":"Unsure about my future with my girlfriend (40F) who has two kids and I (35M)","selftext":"Hello everyone,\n\n  \nThis is my first time posting here and I’m feeling quite lost.  \n\n\nI’m 35M and my girlfriend is 40F. We’ve been together for almost 4 years.  \nShe is honestly an amazing woman kind, funny, supportive, beautiful, sexy, fit… she really checks a lot of boxes for me.  \nShe also has two kids (8 and 12) who are really sweet and kind to me. On paper, we look like a happy, stable family.\n\nBut here’s the main issue: **she doesn’t want any more children**.  \nAnd me… I’m not even sure if *I* want kids. I don’t have a strong “yes,” but I also don’t have a strong “no.”\n\nWhat confuses me is that every time a friend tells me they’re expecting a baby, I feel this strange sadness  like a sense of missing out or maybe fear that I’ll never experience that part of life. I don’t know if this means I want kids, or if it’s more about social pressure and comparison.\n\nAt the same time, I often feel out of place in my “stepdad role.”  \nI care about her kids, but when I pick them up at school, go to football practice, or handle family logistics, I sometimes feel like I’m living someone else’s life. Like I’m the extra adult in a family that isn’t really mine.  \nIt’s a weird mix of attachment and disconnection.\n\nThere are other things too:  \n– My girlfriend is quite jealous sometimes, which drains me.  \n– We live far from my work, and the logistics of a blended family are heavy.  \n– I struggle with the idea that, if we break up one day, I’ll have no rights and will lose the kids emotionally anyway.  \n– Sometimes I even browse forums like “childfree and happy” or “people who had kids later in life” because I’m trying to understand what I actually want.\n\nToday things got really emotional and we almost broke up. I had a complete breakdown because I’m so unsure about my future, hers, and the kids’.\n\n**I love her, she’s a great partner, but I can’t tell if this life is truly aligned with who I am or if I’m just staying because I’m afraid of being alone and starting over.**\n\nI don’t know what to do.  \nHas anyone been in a similar situation?  \nHow do you make a decision when both staying and leaving feel painful?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6d792/unsure_about_my_future_with_my_girlfriend_40f_who/","permalink":"/r/relationship_advice/comments/1p6d792/unsure_about_my_future_with_my_girlfriend_40f_who/","score":2,"num_comments":40,"over_18":false,"stickied":false,"created_utc":1764079329.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6cyfi","name":"t3_1p6cyfi","subreddit":"relationship_advice","author":"Used-Independence814","title":"how do i (22F) stop being jealous of my boyfriends (24M) previous relationship?","selftext":"my (22F) boyfriend (24M) have been together for a couple months now. he had been in only one previous relationship with a girl (23F) for four years. the four year long relationship and the fact that he is still somewhat in contact with her (his friends are still friends with her) is what makes me jealous. also the fact that she was his first. its not even logical jealousy because whenever i bring her up (i know i should stop) he tells me not to worry bcs he doesnt like her at all. but still i have a weird jealousy about how long they were together and that she was his first. i don’t know how to stop.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6cyfi/how_do_i_22f_stop_being_jealous_of_my_boyfriends/","permalink":"/r/relationship_advice/comments/1p6cyfi/how_do_i_22f_stop_being_jealous_of_my_boyfriends/","score":3,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764078692.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6crtc","name":"t3_1p6crtc","subreddit":"relationship_advice","author":"Wide-Ad7593","title":"25 f, 29 m","selftext":"Hi everyone,\nI (24F) have been in a complicated situation with a man (29M) I’ve been seeing since July. We’ve known each other since February.\n\nBefore we started seeing each other, his closest friend and a few other people warned me that he has a reputation for being surrounded by multiple women and not taking relationships seriously. I liked him, so I decided to give things a chance.\n\nLooking back, neither of us really got the opportunity to get to know each other properly. His friend said some negative things about me to him (slut-shaming and exaggerating things I told him), and I came into the situation already expecting the worst because of everything people warned me about.\n\nThroughout the months, we had small issues. I’d see makeup in his apartment that he said belonged to his ex. Because of everything I’d heard, I assumed the worst and kept looking for signs he was cheating. I realize now that my mindset wasn’t healthy.\n\nRecently, I was diagnosed with a sexually-related bacterial infection. I panicked and accused him of giving it to me. Later I learned it can develop from stress or even something as simple as public bathrooms. He got very upset, told me he hasn’t slept with anyone unprotected for two years, and said that I’ve brought too much chaos into his life. He told me he didn’t want anything to do with this anymore.\n\nSince then, he hasn’t said a word.\nI’ve apologized multiple times, sent a voice note, and even bought him a gift I can’t give him because he won’t see me.\n\nRight now he’s completely silent, and I’m struggling emotionally with how abruptly everything ended.\n\nWhat I need advice on is this:\n\t•\tHow do I let go when I still have feelings for someone?\n\t•\tHow do I stop overcommitting emotionally to people who aren’t ready for me?\n\t•\tHow do I break the cycle of apologizing too much?\n\t•\tHow do I accept silence and move forward without closure?\n\nI’m not looking to blame anyone or argue who was right or wrong. I genuinely need support and advice on how to emotionally detach and heal.\n\nThank you.\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6crtc/25_f_29_m/","permalink":"/r/relationship_advice/comments/1p6crtc/25_f_29_m/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764078219.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6bspi","name":"t3_1p6bspi","subreddit":"relationship_advice","author":"Boring-Bear9037","title":"How do I deal with year-old break up (26M and 26F) causing me grief?","selftext":"I'm basically still in love with this girl. It's impossible for me to go a day without thinking about her, and as much as I try, I still find myself drafting (although seldom sending) texts to her and flicking through old photos.\n\nWe broke up in August of 2024, and I have been in two relationships since. Both have been deeply sabotaged by my own constant adoration of my ex. It feels impossible to move on.\n\nI'm not looking at reconciliation, I am just hoping to find a way of extracating myself from the hope of one. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6bspi/how_do_i_deal_with_yearold_break_up_26m_and_26f/","permalink":"/r/relationship_advice/comments/1p6bspi/how_do_i_deal_with_yearold_break_up_26m_and_26f/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764075546.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6aqfr","name":"t3_1p6aqfr","subreddit":"relationship_advice","author":"SupermarketSignal148","title":"26F and 30M just confused","selftext":"We’ve been together for 5 years and engaged for 1. The past few months I’ve been feeling like the relationship is at its end. Nothing has changed but for whatever reason, I just feel like I’m not In love with him anymore. I kind of just view him as another chore I have to keep up with and maintain, and the thought of having kids in a couple of years where I will spend years doing laundry, cooking, cleaning, picking up after them is making me not look forward to it at all. We had a conversation about this about a week ago, where I said I didn’t feel as in love anymore. He said he feels the same and I said I think we should take a break. He said it’s done, he’s going to get his things and go with his brother. Then at the end said he was joking and we’re going to work on it…. Ngl I was kind of relieved at the moment he said it was done. It just feels like I’m surrounded by people who have a ‘Man’ that will do some element of contribution to the relationship like providing, or driving them somewhere, or say for example I need something when I’m cooking and they’ll nip out for them. I just look at my partner like, he has no want to learn to drive, asking him to take his shoes off at the door is a task of its own. He has one job in the whole house, which is to take out the bin, which will amass to a pile of things stacked up and he still has no proactive thought to change it. I feel like I’m with a child, a lazy slob of one. I don’t know, we used to be so in love, I used to love taking care of him….which is why I’m so confused about how this has changed so quickly. Has this been experienced by anyone else? I’m scared of breaking things off and this being just a phase and me regretting it. Also because of how I feel I haven’t initiated/wanted to be intimate with him for a longgggg time, which he mentioned he needs to change but I just don’t feel it.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6aqfr/26f_and_30m_just_confused/","permalink":"/r/relationship_advice/comments/1p6aqfr/26f_and_30m_just_confused/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764072328.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p69uee","name":"t3_1p69uee","subreddit":"relationship_advice","author":"ShoddyInspector2122","title":"Me (27M) and my GF (28F) are at a crossroad in our relationship. Looking for advice.","selftext":"Sorry this will be long but to give context, we’ve been dating for the past 6 months and everything has been going amazing. Probably the most happy I’ve felt in relationship and she has said as well (we both said we you each other around the 5th month mark btw). However we’ve recently come to a point where things have shifted. From what we talked about this stemmed from an argument we had around Halloween time. We had matching costumes and everything so I assumed we were going to spend Halloween together but she just wanted to be with her friends. At first I was a little upset but I understood her point. So I made plans to hang with some other friends and but we agreed to meet toward the second half of the night. End of the night comes and I mention that we should probably start meeting up but she was persistent on not meeting up and that she still wanted to be with just her friends. Again, I was a lil upset, we had another small argument and I ended up just going home. Before something is said about this, we both give each other space to hang out with friends no problem it was more so I was just upset that we agreed to something and that I was just sad cause we had the matching costumes which I thought would’ve been fun. She said this is what threw her off (looking back it was a dumb reason to argue)\n\nFast forward, we talk about this of course and we end up getting back on the same page or so I thought. As time passes she starts to mention that she’s annoyed of my awkward tendencies, and how we have similarities but so different in other ways etc. For example she now gets irritated that I find certain things funny when they aren’t to her. I very much can be an awkward person and at times have an interesting sense of humor but she knew this about me beforehand. However I have been working on myself to become get rid of those awkward tendencies and be more mature in certain things but growing up I was always awkward, shy, etc so it’s been a hard thing to completely get rid of. Or how I also like to spend quality time so I’ll block off time to spend a weekend with her (which we’ve done plenty of of times in the past) but now it’s too clingy for her. I like to have my alone time but can admit that I also love to make time for my partner because I do crave that time with them so maybe it is clingy at times. \n\nShe’s now mentioned the possibility of a break because she’s dealing with other things in her life and can’t be present enough for a relationship. We talked briefly and she mentioned that these incompatibilities make her question us. She also mentioned that in the past she hasn’t had the best dating history and tends to self sabotage when she gets stressed/emotional. To me it seems that maybe we’re starting to learn that maybe we’re not as compatible as we thought. At the same time I thought it was the imperfections, how we can be different but similar at the same time and other things that made us click so good. Then for her to kind of just easily want to walk away and now find those things annoying makes me question if we said we love each other too soon and in all honesty really hurt. \n\nPart of me wants to fight to keep things going but to see how she could easily just kind of walk away from everything makes me question if things meant as much for her as it did for me. To me it’s like if we say we truly love each other then we should be able to work through the ups and downs of life that could take time away from a relationship and not just break up when things get tough. We’re supposed to talk again sometime this week. How would you go about this and what would be your thoughts? I want to respect myself but don’t want to lose something good. Any thoughts on this is appreciated and sorry for the long read. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p69uee/me_27m_and_my_gf_28f_are_at_a_crossroad_in_our/","permalink":"/r/relationship_advice/comments/1p69uee/me_27m_and_my_gf_28f_are_at_a_crossroad_in_our/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764069290.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p69sps","name":"t3_1p69sps","subreddit":"relationship_advice","author":"ThrowRAUpbeat_","title":"What can I do to handle our situation? F 22 & M 29.","selftext":"I am F 22 and my partner is M 29. We have been together for 5 months. It started as long distance. Nung una, he was very consistent. He gave updates and made time for me. Pero ngayon, he became very distant. I understand na busy siya, but I am getting less and less time and assurance from him.\n\nNgayon, he sends only one or two messages tapos bigla na lang siya mawawala. Minsan he leaves me on seen pero he always views my stories. I also noticed na most of the new people he follows are girls. I try to share my feelings and be honest with him pero he ignores it. I feel like ako lagi yung nag aadjust. I only want konting time and assurance pero wala talaga. Kahit sa free time niya, wala man lang short message, and I feel like parang nanghihingi ako ng oras niya.\n\nKaya ngayon, I feel confused and unsure about what to do.\n\nHow can I handle this kind of situation, and what can I do para maging better yung communication namin kahit na nagiging distant siya?\n\nAny guidance would really help. Thank you.","url":"https://www.reddit.com/r/relationship_advice/comments/1p69sps/what_can_i_do_to_handle_our_situation_f_22_m_29/","permalink":"/r/relationship_advice/comments/1p69sps/what_can_i_do_to_handle_our_situation_f_22_m_29/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764069118.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p694kc","name":"t3_1p694kc","subreddit":"relationship_advice","author":"Burnt_Applez","title":"My boyfriend (21M) feels bad when I (22F) make him gifts and that he doesnt do enough in return","selftext":"So I recently gave my boyfriend his birthday present, mostly handmade except for some candy and a box of legos. It included loving messages from his friends and family, and a jar full of positive messages. He recently talked with me that he feels bad when he gets gifts and that he feels he doesnt do enough when it’s gifts for me. I just feel kind of shitty now about it because i worked for weeks on it. As well as the past gifts ive given him. (ex. Metal Wire flowers, love notes)\n\nIm unsure if I should keep doing gifts like this, Would it be better if i just did a card and something else instead? I will be talking to him about this when ive thought it all thru","url":"https://www.reddit.com/r/relationship_advice/comments/1p694kc/my_boyfriend_21m_feels_bad_when_i_22f_make_him/","permalink":"/r/relationship_advice/comments/1p694kc/my_boyfriend_21m_feels_bad_when_i_22f_make_him/","score":2,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764066700.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p68v2r","name":"t3_1p68v2r","subreddit":"relationship_advice","author":"SpiritualAstronaut53","title":"I (21F) want advice for my first relationship with my neighbor guy(21M)","selftext":"I (21F) had crush on this guy who is my neighbor(21M) for almost 2.5 years and had no hopes for a relationship but 2 weeks before he confessed that he likes me too and want to be in relationship and i was so shocked when he confessed as i never expect him to like me. I never thought i am his type of girl.\n\nFor little context we both have on and off connection from the starting as we don't talk daily. He message me in every 3-4 month and we have a small talk on text and then he disappeared for a while and came back again after few months.\n\nNow on to current situation i told him to wait for my answer as i want to get to know him well and wanted to built a strong bond before starting a relationship but he always seems rushing to start this relationship and asking for an answer everytime we talk. \n\nLater after few days i said yes for relationship and i was happy to be in relationship with him as i liked him for so long and finally i am getting what i once imagine in my dreams and here things started to get a little tough for me. He always ask for my snaps and photos daily and i am an introvert girl and i am not so comfortable to send my photos freely like this( i did send him 2-3 photos and snaps) but he doesn't seems to be satisfied and wanted more but i am not comfortable enough for that right now. We are neighbors so we see each other almost everyday. \n\nHe is also seems very lustfull like he said he genuinely likes me but can't control his emotions and lust for me and i am uncomfortable like this because i want that slow burn romantic feelings before we engage any lustfull activity and i am not ready for any this things right now but he seems not to be able to control it and wanted to kiss me in neighborhood but i am scared to do this because of fear of getting caught by any of our families and neighbor. \n\nIts only been a week since we are in relationship and all of this happened and he get upset when i say no. Last night he said he can't seems to be continue this relationship cause he still miss his ex and he is not over her and it breaks my heart but he told that we can still talk but i don't know what to do and what to expect. I truly like him and want to give him all my love but he doesn't seems to be patience enough to give me some time to adjust and understand him and be comfortable with him. I am very confused and emotionally burnout and don't know what to do and what not.\n\nWould you guys wait or move on if you were in this situation??\n\n( This is my first post on reddit and English is not my first language so please forgive me for any mistakes)\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p68v2r/i_21f_want_advice_for_my_first_relationship_with/","permalink":"/r/relationship_advice/comments/1p68v2r/i_21f_want_advice_for_my_first_relationship_with/","score":2,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764065701.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63mwi","name":"t3_1p63mwi","subreddit":"relationship_advice","author":"Reflekdol","title":"Is divorce worth it if I’m not technically being abused? (33M/32F)","selftext":"My husband (33 M) and I (32 F) have been in a committed relationship for 15ish years. We have a young child together. A few months ago, I was finally able to admit to myself and my bestie that I’m not in love with him anymore. I don’t want him. He rarely makes me anything but miserable unless I’m not thinking about him. I find myself more often than not wishing I hadn’t married him. \n\nThe thing is, he doesn’t technically abuse me. But he makes me feel like shit almost every time I talk to him. If I ask him to do something to help around the house or with our child, he complains or asks me why I can’t do it. It’s 50/50 on whether he’ll actually do it. And he absolutely will not do it without me asking; rather, he will do precisely 3 things without me asking, and the rest will not get done if I don’t do it. \n\nFor example, Tonight was my birthday. We had guests coming over. I asked him to wipe the table off. I had already cleared it of clutter. I was working on cooking the dinner. He came downstairs with an attitude, scowling at me, wiped half the table (no scrubbing, did not remove any food stains or crumbs) and left. I had to rewash the table after him because it was still dirty, even where he had wiped it. \n\nIf I tell him I am unhappy with anything he has done, he acts like I am attacking him, being an ungrateful bitch, or that I am a hypocrite because I didn’t do it either. He gets angry and makes me feel bad, so we can never have a civil discussion about it. To be fair, I no longer pussyfoot around the topic, so I am often blunt about what he has done wrong. I know I could be more careful with my words to not offend him, but we had to do that with my dad, who was actually abusive, and I promised myself I would leave any man who abused me or my children. \n\nIn the past, this man has stolen thousands of dollars from me. He ruined my credit by taking out a credit card in my name, putting $3500 worth of debt onto it, and not paying it off for 5+ years. He told me a year ago that he would start paying off our debt (80% of which he accrued; the rest is my medical debt (American)). To date, he has only worked on things in his name, and nothing in mine. I constantly get calls from debt collectors, and my credit is still in the 500s even though I pay both of my bills early every month, so I know the debt is not getting paid. We have the budget for more, but he still runs out of money every paycheck. He has stopped stealing from my account at least. I was smart enough to only link our accounts but maintain my own separate ones. I have asked him multiple times what all he spent money on to make the debt, and he has only ever accounted for $700 of it. He claims the majority of his checks go to food (for him; he does not contribute to groceries). He pays my mom $500 a month(when we actually pays it) for our rent. The rest is for entertainment. He doesn’t contribute to the insurance or car payment. I even pay for the health insurance for the family. And any money that is given to “both of us” he pockets and does not share with me unless I take it out of his account before he can spend it all. There is so much more he has done that is horribly fiscally irresponsible, but I don’t have room to type it all out. \n\nIf he is at home, he is in our bedroom by himself playing on his computer. We don’t have sex anymore. Our sex life has mostly dried up due to my medical issues. For the last 3ish years, I’ve tried to put out every month or two; I get no enjoyment out of it, only pain. Finally I decided I’m not even gonna do that anymore. He doesn’t deserve my pain. He puts no effort into me. Hell, the scant times he has so much as kissed me, it was all I could do not to pull away. \n\nI theoretically could survive financially without him. The only thing he contributes is rent money. So without that, I would be paying $500 more a month. But I wouldn’t be bailing him out financially either, so it’s not quite that cut and dry. \n\nTl;dr: I don’t like my husband anymore. But he doesn’t legally abuse me. Is it worth it to divorce him? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p63mwi/is_divorce_worth_it_if_im_not_technically_being/","permalink":"/r/relationship_advice/comments/1p63mwi/is_divorce_worth_it_if_im_not_technically_being/","score":1,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764046365.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63mt8","name":"t3_1p63mt8","subreddit":"relationship_advice","author":"throwaway148210","title":"I (28M) was gaslit by someone (35F) who spread it to my entire social circle, and I don't know what to do.","selftext":"Someone I (28M) once considered a close friend (35F) stole money from me. When I confronted them, they retaliated by creating a fictional sexual assault narrative, and spreading it around to all of my friends in the community.\n\nSeveral people in the community sided with the accuser, and started sending me horrible messages, and others privately told me they didn’t believe it but those people continue to interact with the accuser as if nothing happened. It feels like everyone's just ignoring what was done to me. \n\nIt’s surreal and infuriating, like I’m trapped in this alternate upside-down reality that doesn’t make any sense. I know I'm innocent, but I feel extremely helpless, gaslit and tbh violated. I just want all these horrible feelings to go away already.\n\nI've already decided to just leave that community behind, but the whole experience has left me very rattled. I could really use some support or advice how to move forward. Has anyone dealt with something like this? How do you make sense of it??","url":"https://www.reddit.com/r/relationship_advice/comments/1p63mt8/i_28m_was_gaslit_by_someone_35f_who_spread_it_to/","permalink":"/r/relationship_advice/comments/1p63mt8/i_28m_was_gaslit_by_someone_35f_who_spread_it_to/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764046356.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p60z88","name":"t3_1p60z88","subreddit":"relationship_advice","author":"maneater1414","title":"Boyfriend (M23) of 2 years hiding smoking poppers out of bong from me(f20)","selftext":"My boyfriend has been hiding smoking weed and cigarettes out of his \"homemade bong\" from me. I also smoke weed so Im not against it at all.  Only if it affects your life in a bad way , which for me it doesn't. Him tho, he has trouble keeping up with school and is a the moment looking for a second job since his job is currently letting go of employees. I've been talking over and over with him about just lowering his intake, smoking at specific times of the day so he can stay productive but I know he's been having a hard time with the addiction. I've asked him before if he had a bong still and he denied. Now I just found one hidden in his gaming room. (We live tgt) we've already been through the hiding about buying cigarettes , weed , bong and he just doesn't stop lying about it. I guess he's ashamed he doesn't have control over his addiction, but it's starting to affect how I feel about the relationship. I dont know how to approach it anymore. How can I deal with it?","url":"https://www.reddit.com/r/relationship_advice/comments/1p60z88/boyfriend_m23_of_2_years_hiding_smoking_poppers/","permalink":"/r/relationship_advice/comments/1p60z88/boyfriend_m23_of_2_years_hiding_smoking_poppers/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764038362.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zv2a","name":"t3_1p5zv2a","subreddit":"relationship_advice","author":"Corogue","title":"My gf [F24] is angrywith me because I [M30] did not drive her to work. How do I fix this?","selftext":"Hey everyone. We both have hour long commutes to separate jobs early in the morning in separate vehicles. I have two cars, but she's borrowing one of mine until either the wheels fall off or she has enough to get one of her own.\n\nToday was my off day, and she was very tired to go to work. She asked me if I could take her to work in my car. Her rationale was that she is too tired to drive and could crash, and that my car is faster and can bring her to work earlier.\n\nI refused, citing the reason that she has a car that is fully operational to drive and that she needs to drink a coffee. I was also on call today for my job (and they did in fact call me in), which means if I took her, she would have no ride back and would have to take public transportation.\n\nShe got very upset with me and drove to work. She called me a bad bf afterwards and said a real man would take her to work to not risk her crashing.\n\nWas she right to be angry with me, or did she over react?","url":"https://www.reddit.com/r/relationship_advice/comments/1p5zv2a/my_gf_f24_is_angrywith_me_because_i_m30_did_not/","permalink":"/r/relationship_advice/comments/1p5zv2a/my_gf_f24_is_angrywith_me_because_i_m30_did_not/","score":2,"num_comments":21,"over_18":false,"stickied":false,"created_utc":1764035182.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ugrl","name":"t3_1p6ugrl","subreddit":"relationship_advice","author":"Hmmmmmmhelp","title":"Mum (48F) keeps insisting my (20M) being transgender is due to childhood trauma. How do I navigate this?","selftext":"So I, 20M, came out to my mum, 40sF, as trans three and a half years ago, originally as \"not a girl but not a boy, either\" but over time began realising I was more comfortable with he/him pronouns, being called a boy, etc etc\n\nI've always known she wasn't exactly thrilled - if anything it feels like she's been in denial the entire time. She claims to be supportive and love me no matter what, and she was more than happy to use my new name, but it's always felt like she would try to delay accepting each new thing.\n\n\nExamples:\n\n- I caught her using my deadname 2 years after I started using a new name, because \"[deadname] doesnt work in french\"\n\n- she has rolled her eyes or been visibly upset when other people gender me as a boy\n\n- she has outright told me she can't call me her son - which I accepted, only telling her that it hurt, but I understood\n\nShe was always a fairly hands-off parent, but 3 or so years back she finally kicked out my emotionally/verbally abusive sibling and we began to get closer.\n\nIn the last few years we've both gotten into therapy and I've gotten on anxiety medication. \n\nA couple years ago I opened up to her about having been groomed online when I was 11-12. When I spoke to her a year later about me possibly starting testosterone in the future, she became extremely upset and suggested me being trans was a result of sexual trauma.\n\nI, of course, did not take this well and when I began testosterone at 19 I didn't tell her until around 4 months in. I did so via a letter, as I'm better at getting my thoughts out on paper and texts give me massive amounts of anxiety.\n\nShe's not been thrilled, exactly, but she's been at least supportive about getting me proper medical treatment (I am currently DIY-ing HRT due to 5+ year waiting lists and £1000s in private fees, I would not recommend it but I do not regret it) - or so i thought\n\nI'll admit I didn't engage as much as I should have in her sending suggestions, but the first person she sent me to had nothing to do with the medical side and was very \"trans-critical\", and i basically went into full avoidance mode with my mum\n\nIt's become obvious to me that what she really wants is someone who will talk me out of being trans. I feel she regrets not being present and getting me the help I needed earlier on, but this is all too little too late.\n\nRecently we had an interaction that ended with her yelling \"because you're not a man, you're not a boy!\" at me, which, fuck. Her texts in the following days apologized \"that her words hurt me\" but reaffirmed wanting family therapy to talk about things - which I was open to prior, but not anymore\n\nAnyway, I didn't speak to her for nearly a month before giving her a letter trying to get across \"you've hurt me, and I want a good relationship but I am trans and you dont get to say it's just a trauma response\"\n\nShe finally gave me her reply, in the shape of 4 full-page letters where she basically doubled down, said she was referring to different childhood trauma making me trans, said I just wanted medical people who reaffirm that im trans and dont challenge me, said she \"would get no social pushback for supporting\" me, and that shes challenging me because she loves me, etc etc\n\nI dont know what the fuck to do anymore, and im so damn tired of it. Ive told her i dont owe her an in-depth explanation of my trauma for her to accept im trans but she insists she only \"wants to see with her own eyes that im healed\" or some shit, which?? im not gonna tell you what trauma ive worked through, you dont even know what stuck with me and what didnt\n\nThis is becoming incoherent, sorry. It's 1am, I havent had therapy in like 2 months because my mum suddenly told me I only had 2 sessions left and ive been, idk, \"saving\" them?, and my lovely girlfriend has been trying to help but its all so much and im awful about talking about the hard stuff with anyone\n\nEven if no-one actually reads this, it was nice to get it out. So thanks. Any advice (especially from other trans ppl) is ofc welcomed <3\n\nEdit: my gf sometimes scrolls reddit so if you see this, uhh, hi love","url":"https://www.reddit.com/r/relationship_advice/comments/1p6ugrl/mum_48f_keeps_insisting_my_20m_being_transgender/","permalink":"/r/relationship_advice/comments/1p6ugrl/mum_48f_keeps_insisting_my_20m_being_transgender/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764119788.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6uc7u","name":"t3_1p6uc7u","subreddit":"relationship_advice","author":"throwRA-justnonsense","title":"I (f29) asked my BF (m34) a question, I didn’t want to know the answer to..","selftext":"Me (f29) and my bf (m34) have been together for 3 years and have always had our differences with sex. \nI asked my bf recently, if he felt sometimes he bit off more than he can chew with me, sexually. \nI kinda already knew he was going to say yes, but him actually saying yes, is now sticking with me. I’m unsure on how I need to handle this or take this? \nI know I have a high sex drive, but when we got together he told me he did also. \nI soon found out that our definition of “high” sex drives, was vastly different. \nSex is always when he wants it, never when I want it, but I always say yes, or I just won’t get it.. \nIt’s continuously an issue, and I just don’t know how to remedy this. Any thoughts? ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6uc7u/i_f29_asked_my_bf_m34_a_question_i_didnt_want_to/","permalink":"/r/relationship_advice/comments/1p6uc7u/i_f29_asked_my_bf_m34_a_question_i_didnt_want_to/","score":1,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1764119433.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u9zz","name":"t3_1p6u9zz","subreddit":"relationship_advice","author":"certifiedbpdqueen","title":"My boyfriend’s family is terrible and I don’t know how to deal with the effect they have on him, advice? (M22 and F21)","selftext":"Hey guys, so for context, my boyfriend and I have been together for about a year and 6 months now, and when we got together, he was a senior in college and I was a junior. Now he’s been graduated for about 5 months, and I’m almost halfway done with my senior year. So since we met in college which is about 300 miles away from his hometown, I haven’t really spent as much time with his family as most girlfriends who have been together with their partner for this long have, although I have spent a decent amount of time with his family during holidays and occasionally when they drive up to our college city. Every time that I have hung out with his family in-person, they have always been super super nice to me and his mom has even called me her daughter-in-law several times to my face. \n\nBut behind the scenes ohhh brother 💀 His mom is incredibly rude to him and to practically everyone around her, but she acts incredibly sweet to people in person, yet at the same time she’s shit talking them behind their back. For example, she’s told him in private conversations several times that he should break up with me because I’m a “distraction” (which makes zero sense because I’m a pre-law student and I help him with school/work constantly, i don’t even have enough time to distract him and I never ever would let him break his obligations for me, I’m very academically focused and so is he) She’s called me ugly, she’s called me a psychopath, she blames me for a lot of things that happen to him even if I have nothing to do with it. Like he got a speeding ticket a while back and I was in the car with him, and she blamed me even though I wasn’t even driving and I was actively trying to tell him to slow down before he even got pulled over 😭 His mom is the main issue, but his grandma and his other family members are also just so judgmental and rude. His grandma for some reason despises me even though I’ve only met her once (he lives with her currently because she lives in our college city) and she won’t even let me come inside their house, she makes me wait out in my car. He is obviously annoyed and pissed off by how his family treats me, but he’s also too nervous to stand up to them for me because they’re just so awful and they’re also helping him financially right now while he’s actively looking for a professional job. How can I deal with this respectfully without telling his mom and his family to go fuck themselves because that’s literally what I want to do 😭 I treat my boyfriend SO well and I have done absolutely nothing to deserve this disrespect from his family ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6u9zz/my_boyfriends_family_is_terrible_and_i_dont_know/","permalink":"/r/relationship_advice/comments/1p6u9zz/my_boyfriends_family_is_terrible_and_i_dont_know/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764119257.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u7x4","name":"t3_1p6u7x4","subreddit":"relationship_advice","author":"Suspicious-Expert154","title":"I 22F was disrespected/cheated on by my partner 24M - Via secret P0rn Addiction and secret Insta account. Is it worth pursuing?","selftext":"Obviously me writing a post and asking for advice; I'd say it's more than right to assume, that my relationship pretty much might be over. \n\nI found out a week ago yesterday, from my partners watch as it was gaining notifications whilst he was using his phone in the bathroom. I found out he had a secret Instagram account where he had blocked my personal insta account from seeing his; This account he had used was a pretend persona/catfish account. \n\nThis is where he interacted with women to gain their OF links, call them hot, how he would like to f\\* them etc. And even asked a few girls to meet up to do the nasty. (I found that out after he deleted the account at per my request and finding out, and logged in to the account whilst he was sleeping to see the damage, honestly regret it but grateful for being nosy). \n\nThe thing is we have been together coming up 1 year. I've moved interstates to be with him; Left my family, friends and don't have a job currently. I have paid to furnish our home which cost me thousands of dollars and this is what I find out 3 months after moving in. \n\nI'm completely devasted and feel so blind sighted, as there was absolutely no signs of lusting, cheating or p0rn addiction. \n\nWhen I found out, I immediately confronted him and was met with straight bold faced lies and denial. After 20 minutes of asking the same thing 'can you tell me the truth' etc. He finally admitted he had an addiction and was unfaithful essentially. \n\nAnyway my question, \n\nHow the heck am I supposed to get through this? \n\nI appreciate the honesty he has given me and the transparency since finding out. We have agreed on steps that need to be taken to help rebuild the relationship e.g. therapy, transparency and boundaries (not taking his phone into the bathroom/toilet). \n\nI know these things go one way or the other: We rebuild and become a stronger unit or I can't get past this and resent him or he does it again and we inevitably break up. Since finding out this whole other side of him, I have accepted the fact that the reality of it is, he may do this again and I have had to acknowledge that before wanting to continue our relationship. \n\nI love him so much clearly. But. How can I be with someone who says he loves me; But doesn't love me enough or respect me enough to not cheat on me? \n\nSince finding out, Most of the time it honestly feels normal; We feel normal. But then I'll get random sudden flashes of what happened and immediately feel closed off and sad. Hurt. I know a road of healing doesn't happen in a span of a week its over months and even years. \n\nHe seemed remorseful, regretful and I truly believe such; However I feel so silly for pursing when I feel insecure about myself and now our relationship.  \n\nAdvice?\n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6u7x4/i_22f_was_disrespectedcheated_on_by_my_partner/","permalink":"/r/relationship_advice/comments/1p6u7x4/i_22f_was_disrespectedcheated_on_by_my_partner/","score":1,"num_comments":4,"over_18":true,"stickied":false,"created_utc":1764119104.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u5gp","name":"t3_1p6u5gp","subreddit":"relationship_advice","author":"Few_Rope_6275","title":"F24, recently got out of a manipulative relationship with M28. What steps can I take to process the experience and recognize the signs I may have missed?","selftext":"\nI am F(24) and my ex is M(28). 3 years ago, during the pandemic, I broke up with my ex and I was not in a hurry to find someone new. Then this guy named B entered the picture. He offered to give me a ride to the city to meet my ex’s mom, and we got along after that. B and I started seeing each other almost every week. He traveled two hours from the city back to our hometown, so we began spending time together regularly.\n\nWeeks passed and everything moved very fast. He confessed that he liked me and I liked him too. He did not give me time to heal, but back then I was too naive to think about it. I was the one who tried to win him over because he challenged me. After a few months we officially became a couple. We got along well and he had many female friends from law school. I did not know that was a red flag. I gave him my trust completely.\n\nMonths passed and I never checked his phone, but I had a feeling that I needed to. My accounts were on his devices, but he never signed in on mine.\n\nDuring Valentine’s Day I found out that he and his girl friends from law school hid a story from me. There were 5 of them in the group and B was the only guy. He bought his friends chocolates. I bought him flowers for Valentine’s and I got nothing in return. He paid for our dinner, but he did not give me even a single flower or chocolate. I was okay with it, but the problem was that they hid it from me. His excuse was that he thought I might get jealous, even though jealousy was never a problem for me. I asked him every couple of months and his reasons kept changing.\n\nOne day I checked his phone and found out about a girl he went out with before and after we were officially together. He told me she was his relative. He had a classmate in law school who was the sibling of the girl he had been seeing. Later, I found out that they had a thing together and that they stopped talking only a week before he met me. My heart sank. When I confronted him he kept denying everything until his mom got involved and told me they did have something before.\n\nTo make things worse, let us call the girl Pinky. B’s ex, Christa, and Pinky worked in the same hospital as interns. B and Pinky met because of Christa and Pinky volunteered to spy on Christa while she was on duty. Eventually B and Pinky developed feelings for each other.\n\nAfter that I broke up with him, but it was already too late because he had love bombed me and I became extremely attached. Another issue with B is that he liked recording us during sex. When we broke up, I asked him to delete the videos. He became angry when I held his phone and asked him to open his hidden files so he could delete our video. He told me I had no right to make him delete it because we were both in the video. This came from a law student, and I wondered if that was really how it worked.\n\nEvery time we broke up I would always run after him until I noticed something that had never happened before. I had green discharge and every month it became painful. Even when he just inserted it, I felt itching and pain. He said it was normal and I believed him. Now I know it was not normal. Many people told me to get checked.\n\nThat was when I realized he was sleeping with many girls. I confronted him and humiliated him on social media. The plot twist was that I ended up apologizing because I did not want my family to get involved anymore. Everyone else stayed safe and I was the one who took the blame. Even now, we have been on and off. I knew I had finally reached my limit. I found out he talks to many girls on Messenger and keeps them as options. He always stops using Instagram when we are together. He avoids using social media except for YouTube, which is suspicious because he was not like that before.\n\nNow I just pray that one day this heaviness I feel will finally go away.\n\nAfter a week of no contact, I finally had the courage to ask for my phone back so I can move on without thinking about it anymore. I could not stand the fact that he was using my phone to meet and message other girls. It is so utterly disgusting of you, B.\n\n\nLast October we got back together, and he asked me to seek counseling so we could talk about where everything went wrong because we couldn’t have a formal conversation without pointing fingers and blaming each other. After that, everything was just forgotten and we went back to our usual cycle until I found out about the girls he was hiding on Messenger, along with a blocked male and female, and the fact that he was not using Instagram whenever I was around.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6u5gp/f24_recently_got_out_of_a_manipulative/","permalink":"/r/relationship_advice/comments/1p6u5gp/f24_recently_got_out_of_a_manipulative/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764118917.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tya9","name":"t3_1p6tya9","subreddit":"relationship_advice","author":"MagnoGreko1998","title":"My Future in-Laws (55M/53F) Despise Me (25M)","selftext":"Hello all. I have been in a relationship with my fiancée (29 F) for 5 years now (engaged for 2). It is a long distance relationship as she lives in Australia and I am American, we are trying to work out all the immigration fun. She’s visited three times for three months at a clip over the course of our relationship (the limit of what an ESTA will allow). \n\nIn those five years, I have reached out repeatedly to my future in-laws trying to get to know them and have them know me as much as can be possible given the distance. I understand their initial hesitation, but in the five years we have been together, they have never asked to speak to me. \n\nI came later to learn that their primary disagreement with our relationship (or rather with my existence, as if sometimes feels like) is due to the fact that they are Jehovah’s Witnesses, and I am Greek Orthodox (as is my fiancée now). \n\nThey leave my messages on read, and never even acknowledged when we got engaged. Her mother has insulted my mother (they have never met), calling her a “cow” the week that she died, and said I came from a “bad family” because I was severely abused by my father as a child, so I must be “fucked up in the head” because of it. \n\nI’m a child molestation survivor from a relative, which her mother has commented on by calling me “soiled goods” and “ruined”. There are other horrible, below the belt things that have been said, some of which I have forgotten largely (I think) because of how much they wounded me. \n\nI lost my parents very abruptly - my father refuses to have anything to do with me after decades of severe abuse (it’s mutual lack of interest in a relationship, to be fair), and I lost my mother very suddenly four years ago. My mother adored my fiancée, and wanted to do whatever she could to help facilitate her moving here. My entire extended family, including both my grandmothers and their siblings, as well as aunts and uncles and cousins has already adopted her, get her holiday gifts, and insist that they are her family now too. My fiancée similarly adores them. \n\nThe contrast between this and the treatment I’ve received from my in-laws is difficult for me to process, because I love family, and I love being there for family. I will never say no to welcoming another member of my family, so I made a special effort to endear myself to my in-laws. \n\nThat being said, as an abuse survivor, I won’t allow myself to have grown up with an abusive parent and survived that just to tolerate two more that aren’t even my flesh and blood. \n\nMy years of truly desiring to have a loving familial relationship with them soured first into disinterest, and now into active hostility toward the idea of even communicating with them. I’m fortunate enough to be close with my future brother-in-law, however. \n\nThis has been hard on my fiancée. She knows and understands what her parents are doing is completely wrong, but they’re still her parents. She has never defended them, and has defended me to them repeatedly. But she still holds out hope that one day we can all communicate and even visit, potentially. \n\nI don’t disabuse her of this notion because I believe it’s her way of trying to cope with the pain of seeing the man she loves be treated like this by her own parents. But even if they did a complete turn-around in how they treat me (they won’t), I feel like I am past the point where I can be civil around them and would rather just be separate from them always. \n\nIs their behavior abusive? Has anyone ever experienced anything like this and then went on to have a good relationship with their in-laws? \n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tya9/my_future_inlaws_55m53f_despise_me_25m/","permalink":"/r/relationship_advice/comments/1p6tya9/my_future_inlaws_55m53f_despise_me_25m/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764118371.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tupt","name":"t3_1p6tupt","subreddit":"relationship_advice","author":"Different-Fox-3234","title":"I 22M broke up with my 21F gf cuz of excessive arguments","selftext":"So i met this girl online ,we are both from the same country, at the very first days of our talking stage ,i made it clear that i want a serious relationship that ends up by us getting married, so at first it was great we were talking a LOT, playing games together ,having calls at night.  \nbasically i was spending time with her a lot, i'd say it was a good company at first  \nOne night as i was streaming for her while she was watching me, she saw a text of mine telling another girl \"Miss\" and for the record that message was about 6 months before i knew her ,and that girl sent me a new msg asking me about smth related to her work ,anyways my \"ex\" saw it ,felt broken then she discnonnected from the call, after like 30 mins she said that she didnt know i call every girl \"miss\" anyways she asked me to filter all the old conv w me and the girls ,and only keep the good ones and the ones ill need   \ni agreed, anyways ,we then decided to meet irl ,we had a fun date id say ,the city was empty ,only the two of us walking in the streets and sharing lots of kisses ,(she lied about going out w me to her parents, told them she'll go study smth , the study was cancelled ,but she still came anyway -about 260km) anyways after a couple of days ,the unecessary arguments started ,why are you following this girl, why are you playing with other girls etc etc ,over -jealousy ,and over-thinker ,even tho i made it clear that im not cheating on her or anything similar  \nanyways mid-arguments i was suggesting some solution that would acutally fix the problem   \nbut she instead gets even more mad and yells at me for not spending time w her and says (im not a dog to make a rule in our relationship), i came up with an idea to use love8 app, so she knows where im at ,etc ... and if perhaps im outside holding my phone but didnt reply to her ,she keeps overthinking a LOT telling me im a cheating i dont prioritize her and taht she wants a breakup, when i say okay lets breakup she litteraly say shes sorry right away.  \nshe hated when i spent my time with my friends ,gets mad even tho i've done nothing wrong  \nshe kept joining and exiting the group lots of times ,and each time i tell my friends that we're fighting and then i forgive her.\n\nduring this time i also lost my close bestfriend, ( cuz i didnt spent time with him lately ) and btw he DIDNT talk to me about 6 months after we got our baccalaureate ,and i was calling him like 5 times in total during a month ,i just thought he moved on with his new life outside of the country ,one day he called me and said he's sorry he was busy with studies and his gf that lives w him so i forgave him and we continued spending time in games and antivities during summer till he ghosted me cuz i was spending my time w my girl and he knew about it\n\nOne day, i was in the last day of the exams , meaning right after ill finish it ,ill get to enjoy my free time more doing the things i love. sadly that morning ,one of my classmate died that morning, he had a liver issue, anyway it was very tragic for me ,i called my \"ex\" and told her ill come home late that night and explained what happened, after i finished the exams , my classmates decided to split and go in 4 cars (he lives 30km away from uni) , i went with a girl that had a car (all cats were full btw) i took a one time view video of me sitting in the back of the car ,and her response was \"Ha is she your other girlfriend?\" it got me mad that i was feeling down and all she was thinking whether im cheating or whatever, anyways after i came home, i was really feeling so down ,remembering his family crying ,my friends while i was barerly holding myself together, she called me she did say she's sorry about the situation bla bla bla, i wasnt feeling much talkative ,and all of a sudden she raised her voice and said \"YOUR FRIEND IS DEAD MAY HE REST IN PEACE ,wb ME I NEED ATTENTION ASWELL\" i was so choked that i started crying in silence, after a while she kept saying \"i always give attention to others ,when will i get some too\" anyways i went to spend time alone .  \non the next argument i told her that she is so toxic and i dont want her anymore ,that i've lost intererst also i brought what she said in that call ,and i removed her eveywhere ,she then proceeded to call me 5 times per minute ,from her phone ,her brothers phone ,her mothers phone ,their home fix. so after lots of called i answered she apoligized and i forgave her.\n\nsince that day we always keep arguing over nothing , naggs about why i changed my profile pic, why did my followers add up, why i play with other friends... i was really fed up with this.\n\nand for the record ,we used to send each other some +18 pics at night when we're horny ,this will be explained later in the story !  \nanyways she asked me to see my convos with girls (idm giving my social media ,but i didnt trust her enough to do it)\n\nanyways we met the second time on her BD ,brought her  a plushie and some candles that smells good, she liked it was had a fun day at her city. \n\nafter some few days ,we kept fighting again ,and btw she throws her phone at the wall ,and keeps hitting anything thats close to her (broke her dekstop glass one time) over a silly argument  \nso she came up with the idea to make a group we invite our friends and play in it ,whenever theres a girl i want to play with she should be there and vise versa ,one day i was afk in the call ,she was there and so did her brother, my female friend entered mistakenly to the call ,she was willing to join server but she joined the call instead ,and said \"hello everyone ,where is (me) then talked to my gf ,and then said \"kiss kiss\" to my gf then left the call\" right after that my phone was blown up with calls ,she said that my random \"bitch\" is being too direspectful towards her and the brother. when i came to the call i asked the brother if something happened ,he said \"no? nothing happened\" at this point i was realllyyyyyy fed up with her bullshit. \n\nanother day ,she was streaming for me the convos between her and the male friends, she insisted i should skip the \"best friend\" part cuz i wouldnt like it , it got me so sus   \nnormally i dont like to treat my partner like this ,show me this show me that, but i had to at that moment ,after 2 days of insisting ,i srsly was socked about the things she said about me when we were fighting like \"ill finish playing with this gay ,and ill join u\" or \" i really hate him\" after few days my friends asked me if i can join them in game , told them if i do ,she'll come to the call and keep screaming at me so i rather skip, and my friend mistakenly leaked the convo mid-stream ,ik it happens but my \"ex\"  was on stream and heard everything,\n\nshe said she wants breakup, anyways after we removed each other everywhere she AGAIN kept spamming me with calls ,so i had an idea that id bring an old selfie of me and a female friend hugging her and put it in profile pic so she would fuck off.\n\nshe then kept spamming even more and crying in my DMs, also she was threatening leak my family picture if i dared to leak her titty pics ,usually after i move on i just delete everything to move on ,but i gotta keep hers as evidance ,including convos ,gifts and everything.\n\nidk what was wrong with me one day, but i chased her ,asked for forgiveness ,she kept lying about her having a new partner bla bla bla (its a lie) but the reason i did go back to her was that im fed up with the \"dating\" so i thought id just settle for less  \nIm so broken and lost right now ,i litteraly have no purpose in my life and idk if i made the right choice about losing her at the fist place or not , is this how ppl deal with love in their lives, am i the problem ????","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tupt/i_22m_broke_up_with_my_21f_gf_cuz_of_excessive/","permalink":"/r/relationship_advice/comments/1p6tupt/i_22m_broke_up_with_my_21f_gf_cuz_of_excessive/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764118105.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tq55","name":"t3_1p6tq55","subreddit":"relationship_advice","author":"APorgNamedChilis","title":"My (25F) boyfriend (26M) of two months still has pictures of his ex on social media and Hinge on his phone.","selftext":"My (25F) boyfriend (26M) have been seeing each other for about three months now. Before our first date, one of my friends came over to hang out while I got ready. She asked for his contact information for safety reasons. I gave it to her and she used it to search him on Instagram and informed me of the posts he still had up with his ex-girlfriend. I never really looked in depth at these posts but was told they read like public love letters. It gave me pause but at the time it was too late to cancel and I felt I didn’t have time to process it fully. \n\nThe date and subsequent dates went great but it was always something I had my eye on. There were a few off-hand comments about his ex but nothing that was too concerning. I decided I needed to know more about his previous relationship before I got involved emotionally. While the posts didn’t bother me in the end (that’s a big part of someone’s life and if it didn’t end tumultuously they shouldn’t have to erase it from existence) I needed to make sure he wasn’t still attached. \n\nOn our third date he offered up that he was in a 6-year relationship that ended a year and half ago. I didn’t ask any questions at the time but later prepared that I wanted to have some context as to why they broke up and what made him feel that he was ready to start dating. His answers were that she moved away and communication was difficult and that he longed for connection. \n\nThe answers were enough for me at the time and further into the night he asked me to be his girlfriend to which I said yes. In this time, he shared a lot of his favorite songs as well as a list of album reviews he had. There were many songs about break-ups. This is when a seed of doubt began to grow; maybe he’s not as emotionally available as I thought. However, other than the posts and the songs he has always been present, communicative, and frivolous about his phone use in front of me. \n\nFast forward a month and we’re talking about his Hinge profile. I asked him about his two truths and a lie but I couldn’t remember one of them so he said he could check. He said, “I still have the app but I don’t use it anymore for obvious reasons.” I had deleted the app when he asked me to be exclusive. What is the point in having the app if you are pursuing an exclusive relationship with someone?? For more context he has invited me to meet his parents for Thanksgiving in another state, for Christmas in a closer state, to a vacation to another country next summer. Now, another month later, he was putting on music in the car and Hinge popped up in his Siri suggestions. I didn’t say anything at the time but I haven’t been able to stop thinking about it. \n\nAlso this past weekend, I was at my boyfriend’s house and my mother and older brother were hanging out back home. It seemed that their entertainment for the night was stalking my boyfriend on all his socials. While we were cooking he asks, “Is ___ your brother??” When I said yes, he said he followed him on Instagram. The next morning my brother sends me a picture of a Christmas card with my boyfriend’s address, which he found on Facebook, that read “Ho, Ho, Ho! We’d love to meet you, don’t be a stranger! Love you! XOXOXO.” Thankfully the card was never sent but it still really unsettled me. \n\nWhen I came home, my grandmother informed me of the posts about his ex-girlfriend which she heard about from my brother’s wife. Initially this whole situation made very upset with my family. They felt as though I’ve been keeping my boyfriend from them (he lives almost two hours away, it’s not a super casual thing for them to meet, it needs to coordinated) and instead of respecting my privacy, they inserted themselves into my relationship. They started saying things like, “The posts are disrespectful to you,” and “If the girlfriend moves back you may have a problem.” They’re concerned I’ve changed and I’m not making the right decisions. \n\nNow, still angry that my boundaries were violated, I’m questioning the decisions I’ve made. I don’t know what to think. While I understand the ‘why’ behind him keeping the posts up for the most part (he gave me a sweet card when I was switching jobs that I don’t think I would ever get rid of because he said exactly what I needed to hear in that moment) I don’t understand the ‘why’ behind him keeping Hinge on his phone. I will definitely be bringing up my uncomfortability with him still having Hinge on his phone. I am debating whether or not to warn him of my family’s concerns/opinions as he is coming to cousins play in two weeks and will meet some of them. He’s also gone to visit family for the holiday and I unsure whether or not to call him with all of this or wait until ai can hopefully see him before the play. Looking for any insight to help me approach the situation with more clarity. \n\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tq55/my_25f_boyfriend_26m_of_two_months_still_has/","permalink":"/r/relationship_advice/comments/1p6tq55/my_25f_boyfriend_26m_of_two_months_still_has/","score":2,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764117759.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tmgy","name":"t3_1p6tmgy","subreddit":"relationship_advice","author":"Material_Rub_463","title":"How do I talk to my (43F) Husband (45M) about our failing sex life?","selftext":"My Husband and I have been together for well over a decade. Sex has tapered off and honestly just gotten boring. It doesn’t last as long, we’re older and not as fit ( working on this one! ), and frankly it’s incredibly repetitive. Think same thing with a few variations here and there.\n\nAt first he was a bit adventurous, but that slowed down after several years. I now don’t organism every time and I’m just bored. It’s become something I almost dread. Which just plain sucks. I’m at an age where my drive is through the roof. I want and need more. I spend a portion of my free time reading erotica and getting myself off to handle the horny.\n\nI would love to try light BDSM, introduce toys, etc. nothing too extreme. And not every time either. We’re busy people! I’ve hinted at it in my and he reacted very negatively. That was a few years ago so I’ve not brought it up again. Now things are even worse. Like sex every couple of months worse. It’s horrible. \n\nI know we have to fix it. I desperately want to but I’m not sure how to approach him. It’s hard to look at the love of your life and tell him you’re not satisfied and want more. I’m terrified he’ll take that as more the him, not as more WITH him. \n\nI know I’m not the ass for wanting what I want. He is not the ass because I’ve been too much of a coward to actually have the conversation. He can’t know what he doesn’t knows. Here is what I’m hoping for? Couples who were in a similar situation and had the talk. What was said? Please tell me what was said well, what was not taken well but more importantly… what was the result?! \n\nI do what to fix it but I’m not willing to loose this amazing man over it. Totally not worth it. Help?!","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tmgy/how_do_i_talk_to_my_43f_husband_45m_about_our/","permalink":"/r/relationship_advice/comments/1p6tmgy/how_do_i_talk_to_my_43f_husband_45m_about_our/","score":2,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764117477.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tjh5","name":"t3_1p6tjh5","subreddit":"relationship_advice","author":"ThrowRAGold_Roof_782","title":"Long term relationship— stay or end it 33f, 36m","selftext":"Been in a relationship since I was 15 years old and we are now in our thirties. I love him as a person and father to our children, but I am not in love with him. I haven’t been for a very long time, even before our second child was born. I know being in love is a feeling and love as a verb requires enormous effort and hard work, which we both have done. Our relationship has had ups and downs and has been very toxic at times. He’s not a great communicator, can be controlling, is a very angry man and has had a few incidents of being violent. There has also been abuse; emotional and psychological abuse including stonewalling, silent treatment, manipulation, isolation etc. I’m starting to catch feelings for someone else (a long time friend of mine) and I literally am at loss for what I should do. Do I stay with him and stick it out for my kids or follow my mind that knows better and my heart that is crying out and craving for someone else? I don’t want to fuck my kids up, and I don’t know what’s worse, staying with him or us finally splitting. Please help. Any advice would be appreciated. ","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tjh5/long_term_relationship_stay_or_end_it_33f_36m/","permalink":"/r/relationship_advice/comments/1p6tjh5/long_term_relationship_stay_or_end_it_33f_36m/","score":1,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764117251.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tgtv","name":"t3_1p6tgtv","subreddit":"relationship_advice","author":"Weekly_Owl_154","title":"I (35 F) am stuck in a marriage to an alcoholic (35 M) - how do I keep sane until I can leave?","selftext":"As the title states, I’m stuck in a marriage to a high functioning alcoholic and I can’t leave (yet). \n\nI have gone from disliking my husband to being so disgusted by him that I can’t even communicate with him. \n\nHe has everyone fooled and his family enables it. I’ve had no life for the past 4 years trying to pick up the slack on his end, but I’m drowning now because of it. There’s no repairing our marriage. I’ve tried it all, and he won’t quit. \n\nWe have two young kids that I’ve been doing my absolute best to give a normal life to despite the circumstances. I can’t leave until the spring when my lease ends. \n\nI’m broke af (he drinks it all away) and self employed with a moderate income, so leaving before then isn’t an option. \n\nHow do I stay sane until then? I’ve been in survival mode for so long that it’s completely tanked my mental health. \n\nMy husband was supposed to be starting a new job tonight and I checked the location of my vehicle and it was at the liquor store. I’m losing my mind and have no one to talk to in my life about this.","url":"https://www.reddit.com/r/relationship_advice/comments/1p6tgtv/i_35_f_am_stuck_in_a_marriage_to_an_alcoholic_35/","permalink":"/r/relationship_advice/comments/1p6tgtv/i_35_f_am_stuck_in_a_marriage_to_an_alcoholic_35/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764117054.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sv45","name":"t3_1p6sv45","subreddit":"relationship_advice","author":"Country_dasiy1998","title":"Do my feelings (26f) about my engagement ring that fiancé (26m) proposed with make me materialistic?","selftext":"TDLR: My fiancé (26M) proposed to me (26F) with a ring that I’m not the biggest fan of. It’s more his vibe than mine instead of mine or even a combination of both of our vibes and I’m afraid that it makes me materialistic. \n\nWe’ve been together for almost 6 years now. He proposed at year 5. At year 4 I started sending him rings that I liked. Emerald cut stone (didn’t have to be a diamond) and the settings was simple with small stones on the side if any. And I didn’t want a huge stone either. I’m a minimal jewelry type girlie. \n\nHe’s the typical country boy of jeans, tee shirt, Carharrt, Carolina boots, belt buckle, hunts, etc. and his vibe matches his interests to a tee.  \n\nHe got me a an antler band, with two turquoise stones, and a round diamond. So I feel like the ring is a depiction of him instead of our union or even me. I don’t mind the ring but sometimes it feels strange with my vibe and I don’t want to wear it because I feel like it’s a beacon on my finger since it doesn’t match me. If that makes sense.\n\nI haven’t told him about this because he clearly got it because he thought I’d like it and I don’t want to hurt him. I feel like an materialistic asshole not ADORING my ring. \n\nMaybe I should just hold out and get a wedding band that I enjoy?","url":"https://www.reddit.com/r/relationship_advice/comments/1p6sv45/do_my_feelings_26f_about_my_engagement_ring_that/","permalink":"/r/relationship_advice/comments/1p6sv45/do_my_feelings_26f_about_my_engagement_ring_that/","score":1,"num_comments":41,"over_18":false,"stickied":false,"created_utc":1764115444.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6suvh","name":"t3_1p6suvh","subreddit":"relationship_advice","author":"thats_a_guttter","title":"What to do about living me (18m) living with my bum brother (30m)","selftext":"Me living* sorry\n\nHey :)\n\nI 18m live with my mother sister and brother (30m)\n\nThis post is about my brother he is a fucking torment a bum and a loser.\n\nThis guy does not clean up after himself, respect our space or anything he leaves his hairs around the sink, his dirty clothes on the floor, his wet towels on the floor.\n\nHe cannot do anything for himself. he just expects us to pick up after him he is out for days at a time and will randomly crash through our house leaving a trail of destruction. Clothes everywhere, stuff not put back where it belongs, leftover takeout left open just sitting out dirty dishes in his \"room\" (the living room)\n\nOne time this fucking guy unclogged the toilet and left the shitty toilet paper on the fucking floor!!!!\n\nWe also have a pet cat and he does not respect the rules of her being here at all. She is a stray and too old to be house trained she has a litterbox and stuff in her part of the house and uses it when shes out there, but she is not allowed to roam the house freely and the door must be left closed so she doesnt get in\n\nObviously he doesnt care she roams freely goes upstairs commonly, shits on the carpet pisses on the floor then ignores any responsibility \"its just a cat\" \n\nThis makes my mother livid and who gets the blame? The cat obviously not her sweet summer \"child\" \n\nThis guy also doesnt respect the other people in the home he grabs cartons from the fridge and drinks straight from them. Steals my water and doesnt even drink it. Since hes started living here i have quit drinking water because it just vanishes when i put it in the fridge and then i find it 3 quarters full in his room.\n\nThere is so much more too i havent even mentioned him rushing my mother to leave the living room when shes trying to relax. rushing me in the bathroom when im trying to shower every 2 minutes. Smoking weed and leaving the door open making the whole house smell like it.\n\nI and my mother have asked him to stop all this shit and he doesnt listen. He even goes as far as hiding it i caught him drinking out the carton and he immedietly acted like he was just putting it into a cup despite me litterally seeing him put it to his mouth.\n\nNow today he did the worst thing yet. He goes and leaves takeout on the table so i ask him to put it in the bin before he leaves and he says \"dont be rude to me\" so im like what? How is that rude? If you find that rude thats sad. And he gets mad we start full on arguing and this guy says to me \"okay do something then\" \"what are you gonna do?\" Asking his brother to fight him in his mothers home. What the actual fuck? This guy is also double my weight and age so like what am i gonna fucking do he literally just wants an excuse to hurt me.\n\nI tell my mother this and of course i get the usual \"okay ill talk to him\" (she never does) she just says whatever will get me to shut up. I tell her i literally do not feel safe around him and she just tells me to \"calm down\" \n\nWhen i try to talk to her about him its always the same \"give me peace\" \"calm down\" \"ill talk to him tommorow\"\n\nI am fucking sick of it i think the only way i will get her to give him a reality check and kick him out is if i threaten to move in with my dad. \n\nI dont want to do that i dont like living there but if it means i escape this shit i will do it my dad needs company anyway.\n\nIts not like im fucking him over by getting him kicked out. He has a girlfriend and isnt home for like 3 days at once sometimes. he has somewhere he sleeps and he has friends he has no job either he just mooches off his girlfriend and mother.\n","url":"https://www.reddit.com/r/relationship_advice/comments/1p6suvh/what_to_do_about_living_me_18m_living_with_my_bum/","permalink":"/r/relationship_advice/comments/1p6suvh/what_to_do_about_living_me_18m_living_with_my_bum/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764115426.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
