{"id":"1p69o8y","name":"t3_1p69o8y","subreddit":"unpopularopinion","author":"Affectionate-Yam-113","title":"Hip Hop concerts are the worst kind to attend to.","selftext":"Even though I am currently a hip hop mostly fan, I've been through phases of plenty music genres and subsequently attended their concerts.\n\nAnd I have to say hip-hop concerts just dont cut it. Most artists rely heavily on autotune, and a lot of mixing/cutting techniques of a song to bring their vision to life, which just doesnt translate on a live setting. Plus their songs have so many lyrics and different flows which is again so hard to remember and perform exactly the same on a high energy stage live I imagine. On top of that there's hardly ever a live band to play the music which adds a lot of character and soul to any live performance.\n\nOther genres(rock/heavy metal/pop etc) have artists who have remarkable voices, amazing bands to play the music and even carry the show at points, and just put up a better performance. \n\nMost hip-hop concerts, at least the ones I went to so far rely heavily only on the artist half assing and screaming parts of their songs off beat if you can even hear them over the super saturated and loud music coming out of the venue speakers.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p69o8y/hip_hop_concerts_are_the_worst_kind_to_attend_to/","permalink":"/r/unpopularopinion/comments/1p69o8y/hip_hop_concerts_are_the_worst_kind_to_attend_to/","score":1353,"num_comments":437,"over_18":false,"stickied":false,"created_utc":1764068676.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6624b","name":"t3_1p6624b","subreddit":"unpopularopinion","author":"Practical_Loss4251","title":"There is such thing as bad dogs with good owners.","selftext":"I feel like this is very unpopular, but (imo) just like how some humans are just born “off” so can dogs. \n\nThis isn’t breed specific, and someone getting a working or high maintenance dog (any dog really) and not properly training/exercising them is obviously a bad owner. \n\nDogs per se can’t be “bad” with intent like a human, but with an uptick of backyard breeder and just bad genetics being passed around, terrible personalities can appear. Sometimes a dog just wants to eat children, it happens. \n","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6624b/there_is_such_thing_as_bad_dogs_with_good_owners/","permalink":"/r/unpopularopinion/comments/1p6624b/there_is_such_thing_as_bad_dogs_with_good_owners/","score":861,"num_comments":254,"over_18":false,"stickied":false,"created_utc":1764054801.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ptpu","name":"t3_1p6ptpu","subreddit":"unpopularopinion","author":"Huge-Particular8953","title":"The food industry should not be allowed to advertise using props instead of real products","selftext":"You know what I mean. Cereal commercials where they use glue instead of milk so that the cereal floats nicely on the surface. Perfect hamburgers with fake grill marks, stacked by food stylists, etc.\n\nIt should be like in Japan, where advertisements and packaging must show the truth, otherwise it is illegal","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6ptpu/the_food_industry_should_not_be_allowed_to/","permalink":"/r/unpopularopinion/comments/1p6ptpu/the_food_industry_should_not_be_allowed_to/","score":418,"num_comments":79,"over_18":false,"stickied":false,"created_utc":1764107842.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dltv","name":"t3_1p6dltv","subreddit":"unpopularopinion","author":"Current-Umpire3673","title":"Walking across the stage at graduation is a complete waste of money and time","selftext":"Personally, I don't want to pay who knows how much for gear to sit there for who knows how long watching a bunch of people I never cared about and won't remember in a year walk across the stage. I wouldn't expect others to do that for me either. Barring you turning into some massive success story, nobody in that room is going to care that you graduated outside your immediate circle at best. I think walking the stage is just plain unnecessary. With that time you could go spend time with your friends and family celebrating in a more fun and personal way with people who actually care at all.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6dltv/walking_across_the_stage_at_graduation_is_a/","permalink":"/r/unpopularopinion/comments/1p6dltv/walking_across_the_stage_at_graduation_is_a/","score":335,"num_comments":389,"over_18":false,"stickied":false,"created_utc":1764080360.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62d7t","name":"t3_1p62d7t","subreddit":"unpopularopinion","author":"CerealAndBagel1991","title":"Plain pound cake paired with nothing is the best cake","selftext":"It just is what cake should be without going over the top. It can be spruced up with many things, but it’s not necessary. It stands on its own proving that a dessert can be ‘plain’ and still land at the top of its game ","url":"https://www.reddit.com/r/unpopularopinion/comments/1p62d7t/plain_pound_cake_paired_with_nothing_is_the_best/","permalink":"/r/unpopularopinion/comments/1p62d7t/plain_pound_cake_paired_with_nothing_is_the_best/","score":149,"num_comments":65,"over_18":false,"stickied":false,"created_utc":1764042387.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p54v","name":"t3_1p6p54v","subreddit":"unpopularopinion","author":"BrightLights1998","title":"I think every school zone should have speeding cameras and part of all tickets should go to the schools","selftext":"This would be a win-win, prevent speeding in school zones and give more money to the schools. I like near a school zone with speeding camera and people constantly still get flashed but it’s been there as long as I can remember","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6p54v/i_think_every_school_zone_should_have_speeding/","permalink":"/r/unpopularopinion/comments/1p6p54v/i_think_every_school_zone_should_have_speeding/","score":85,"num_comments":82,"over_18":false,"stickied":false,"created_utc":1764106228.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dyrm","name":"t3_1p6dyrm","subreddit":"unpopularopinion","author":"uselessprofession","title":"Remote controls for smart TVs should have keyboards on them","selftext":"I think it's quite unreasonable that when I want to search for a show on Netflix or something, I have to use the arrow keys on my remote control to navigate to each letter to type them in the search box. This is really a big waste of time.\n\nManufacturers should just put a small keyboard on the remote control so we can type it in. If it can fit on a Blackberry I'm sure it can fit on a remote control too. ","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6dyrm/remote_controls_for_smart_tvs_should_have/","permalink":"/r/unpopularopinion/comments/1p6dyrm/remote_controls_for_smart_tvs_should_have/","score":84,"num_comments":91,"over_18":false,"stickied":false,"created_utc":1764081224.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p696s5","name":"t3_1p696s5","subreddit":"unpopularopinion","author":"Lovettadulcet","title":"Spending $500 on a monitor but sitting in a $50 chair is backwards","selftext":"People spend thousands chasing 1% performance gains from parts but completely ignore ergonomics.\nNot everyone can afford the high-end stuff like Herman Miller chairs, but you can get close without spending a fortune. My $400 Blacklyte chair has done more for my workflow and game time than any SSD I’ve ever bought, and it’s not even the best affordable ergonomic chair out there.\nIf you can find a used office chair within your budget, great. If not, try out different brands until you find one that won’t destroy your back.\nIt’s better to save up and invest once in a good chair than to spend ten times that later on hospital bills for your spine.\n","url":"https://www.reddit.com/r/unpopularopinion/comments/1p696s5/spending_500_on_a_monitor_but_sitting_in_a_50/","permalink":"/r/unpopularopinion/comments/1p696s5/spending_500_on_a_monitor_but_sitting_in_a_50/","score":42,"num_comments":77,"over_18":false,"stickied":false,"created_utc":1764066934.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qusy","name":"t3_1p6qusy","subreddit":"unpopularopinion","author":"lfthoia","title":"We should move Thanksgiving to Sept or Oct","selftext":"Late November is way too close to Christmas/New Years. Who cares when the historical dinner was. Let’s move it to September or October so we appreciate each more.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6qusy/we_should_move_thanksgiving_to_sept_or_oct/","permalink":"/r/unpopularopinion/comments/1p6qusy/we_should_move_thanksgiving_to_sept_or_oct/","score":33,"num_comments":115,"over_18":false,"stickied":false,"created_utc":1764110282.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p603qh","name":"t3_1p603qh","subreddit":"unpopularopinion","author":"Inexplicablystv","title":"Ice cream is better after it's been melted and refrozen.","selftext":"Ice cream is great in its intended form, but man it's next level when it's been left out and refrozen.  It gets crispy, gains that little, low-resistance crunch that ice cream is usually missing.  Lots of people like it soupy, but I much prefer it crunchy.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p603qh/ice_cream_is_better_after_its_been_melted_and/","permalink":"/r/unpopularopinion/comments/1p603qh/ice_cream_is_better_after_its_been_melted_and/","score":8,"num_comments":32,"over_18":false,"stickied":false,"created_utc":1764035869.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ok7o","name":"t3_1p6ok7o","subreddit":"unpopularopinion","author":"Same_Bag711","title":"Avatar is one of the most influential and well known franchises of the 2010s onward","selftext":"I always see people talking down about the Avatar films and how they aren’t influential, how nobody cares about them, etc. Regardless of personal opinions about the films themselves, I’ve never understood the people who say they have no cultural influence. Cameron developed incredible, groundbreaking digital and production technologies for these films that I’m sure will be utilized going forward for so many films, especially as more and more films utilize CGI and fully animated sets. The same goes for the motion capture implemented; although done before, these films really pushed what could be done with it. The films also revolutionized 3D technology and helped push forward the 3D craze in the early 2010s that every piece of technology was trying to implement into their product. There have been ongoing memes and jokes about the films for the last 17 years, and basically everyone knows what the Navi look like visually. Going further, the first film made nearly 3 billion and the second made 2.6 billion, two of the highest grossing films ever both domestically and globally. The series also spawned books, comics, games, and a theme park. How people say this series has no cultural relevancy or influence is beyond me. Watch the new one make over 2 billion again","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6ok7o/avatar_is_one_of_the_most_influential_and_well/","permalink":"/r/unpopularopinion/comments/1p6ok7o/avatar_is_one_of_the_most_influential_and_well/","score":0,"num_comments":80,"over_18":false,"stickied":false,"created_utc":1764104881.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ip93","name":"t3_1p6ip93","subreddit":"unpopularopinion","author":"Cultural-Pea-1516","title":"Thanksgiving should be moved to Friday","selftext":"In the US, Thanksgiving is always held on the 4th Thursday of November. Many employers give the Thursday and Friday off. \n\nI contend that the Thanksgiving meal be moved to Friday. \n\nFor anyone who has had to host a dinner, they know there's a ton of work prepping everything. Shopping, cooking ahead, cleaning. It's a full day. \n\nSo move the Thanksgiving meal to Friday and have the full Thursday for prep work. And we'd still have a full Saturday and Sunday to relax.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6ip93/thanksgiving_should_be_moved_to_friday/","permalink":"/r/unpopularopinion/comments/1p6ip93/thanksgiving_should_be_moved_to_friday/","score":0,"num_comments":78,"over_18":false,"stickied":false,"created_utc":1764091935.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64vka","name":"t3_1p64vka","subreddit":"unpopularopinion","author":"Calexriri","title":"Lucas and Peyton >> Lucas and Brooke >> Peyton and Jake (one tree hill tv show)","selftext":"i think the tide has turned for leyton these days but everytime i encounter a jeyton fan i lose my faith in humanity. it‘s worse than brucas imo bc atleast brucas had abit of a story going on and a slowburn in s2. jake only pushed his baby onto peyton and dipped. he was in like 15 episodes in the 3 seasons he was in. not memorable and only annoying everytime him and that baldhead baby showed up. With Nikki in tow too and he blamed Peyton because she was a teenager with no parents and traumatized like bro take care of your kid and leave her alone.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p64vka/lucas_and_peyton_lucas_and_brooke_peyton_and_jake/","permalink":"/r/unpopularopinion/comments/1p64vka/lucas_and_peyton_lucas_and_brooke_peyton_and_jake/","score":0,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764050506.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o9ph","name":"t3_1p6o9ph","subreddit":"unpopularopinion","author":"Cookandliftandread","title":"No drink should be bigger than 16oz","selftext":"I'm at an airport, and the coffee shops only offer 16oz as their SMALLEST size!\n\nWhat is with American sizing starting at half a liter?\n\nI asked if their cappuccino comes in a smaller cup and they said no. I'm confused. A cappuccino is 6 total ounces of liquid. \n\nMind you the \"large\" was 20 OUNCES!\n\nThere is no time when a non agua beverage should be more than 12 oz/355 mL. \n\nLuckily the place I went to had smaller cups (12 oz) so I could actually taste the espresso slightly, however, I was still charged for a 16 oz.\n\nIt is truly baffling why America doesn't understand why it's fat when everyone is going around drinking a sugar filled warm baby bottle every morning. You all have baby fat from the milk.\n\n","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6o9ph/no_drink_should_be_bigger_than_16oz/","permalink":"/r/unpopularopinion/comments/1p6o9ph/no_drink_should_be_bigger_than_16oz/","score":0,"num_comments":58,"over_18":false,"stickied":false,"created_utc":1764104237.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6r1m2","name":"t3_1p6r1m2","subreddit":"unpopularopinion","author":"DDF6677","title":"Steven seagal is an great martial artist","selftext":"He is a legit aikido master, he was the first American to ever open an aikido dojo in Japan, he lived in Japan for a significant period of time, he trained under accredited teachers etc, is a 7th-degree black belt in Aikido, a Japanese martial art that focuses on using an opponent's energy and momentum against them. He has also trained in other martial arts such as karate, judo, and kendo. Seagal has developed his own style of Aikido, which he calls \"Shinto Muso-ryu Aikido\" and has incorporated elements of other martial arts into his practice. He has also been known to incorporate spiritual and philosophical elements, such as meditation and Zen, into his training.","url":"https://www.reddit.com/r/unpopularopinion/comments/1p6r1m2/steven_seagal_is_an_great_martial_artist/","permalink":"/r/unpopularopinion/comments/1p6r1m2/steven_seagal_is_an_great_martial_artist/","score":0,"num_comments":41,"over_18":false,"stickied":false,"created_utc":1764110758.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
