{"id":"1p6deea","name":"t3_1p6deea","subreddit":"legaladvice","author":"Human-Situation6709","title":"Stripper turned nurse has a weird situation.","selftext":"Location: Texas \nI have been a licensed vocational nurse in Texas for 25 years. Recently I’ve gone back to school for my RN and graduate in March. In 1998 I was a topless entertainer as I was making my way through school and sole provider for my son. I was arrested for public lewdness and violating a sexually oriented business ordinance when I was 19. I was dancing within 6 feet of an officer. I settled two of the charges nolo and did probation and two were dismissed. This is something I always have to talk to employers about and it’s humbling but never insurmountable. Somewhere along the way a clerk somewhere mistyped something. Now my violation of an ordinance charge has been miscoded to say I Operated a sexually oriented business illegally. I can’t rent from Airbnb but who cares about that, but I am worried I won’t be able to get a job. I own a couple homes but I tried to rent briefly in another city and they told me no one will rent to me. I have paid lawyers thousands and no one has been able to do anything for me. I am considering just going to the court and plopping down until a clerk sees me. Hiring a lawyer has not panned out. I’m resourceful and relentless. Anyone got any ideas? I also considered applying for a pardon but is that just a silly dream? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6deea/stripper_turned_nurse_has_a_weird_situation/","permalink":"/r/legaladvice/comments/1p6deea/stripper_turned_nurse_has_a_weird_situation/","score":2175,"num_comments":114,"over_18":false,"stickied":false,"created_utc":1764079837.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":true,"thumbnail":""}
{"id":"1p6gdqx","name":"t3_1p6gdqx","subreddit":"legaladvice","author":"CorianderVale","title":"My landlord wants to charge me for \"unauthorized wildlife damage\" after a raccoon got into the attic","selftext":"Location: Oregon\n\nSo I'm renting a small duplex. Last week around midnight I heard scratching above my bedroom and thought it was just pipes. Next morning my neighbor texts me a video of a raccoon literally climbing out through a loose attic vent on my side of the roof. I told my landlord right away and he sent a maintenance guy. They confirmed the vent cover had rusted out and the raccoon probably pushed it the rest of the way.\n\n\n\nToday I get an email with a bill estimate for repairs: 480 dollars for \"removal, sanitation, and structural patching\". The note says I’m responsible because \"tenant failed to secure area against wildlife intrusion\". I have zero idea how I'm supposed to secure a roof vent I can't even reach, and the lease only mentions keeping trash sealed and not feeding animals. I never left food outside, and nothing inside the house was touched. This was all in the attic that I dont even have access to.\n\n\n\nI wrote back asking how this could be my responsibility and landlord replied that \"state law allows charging tenants for preventable damage\". I feel like a rusted vent on the roof is not something I control, but I could be wrong. Am I actually legally on the hook for this or should I push back.\n\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6gdqx/my_landlord_wants_to_charge_me_for_unauthorized/","permalink":"/r/legaladvice/comments/1p6gdqx/my_landlord_wants_to_charge_me_for_unauthorized/","score":273,"num_comments":50,"over_18":false,"stickied":false,"created_utc":1764086813.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65r3p","name":"t3_1p65r3p","subreddit":"legaladvice","author":"Riveredd","title":"My father has been using me to scam social security, how do I inform them without anyone thinking I was an accomplice?","selftext":"Location: Nevada\n\nWhen I was younger and living in California, I was diagnosed with a mental disorder and as part of this my father (single father) scheduled me appointments to qualify me for social security benefits. Before every meeting he would take me aside and very sternly tell me that I had to \"act dumb\" and that they would ask me questions on if I could bathe myself, if I needed help at school, and that I would need to lie and say no to a lot of them. He practically coached me on pretending to be more severely disabled. And it worked, we've received checks ever since I was a child and now that I'm 21 social security is trying to go through me. They called my own number and tried to set up a meeting. Rather panicked I told them I'd have to call another time and my father is once again telling me that I need to be \"severely dumbed down\" in order to make it through alright.\n\nHere's the issue though: I want nothing to do with my father. I hate him down to his very core and have plans to move out next week, as the following week I'll be receiving a substantial promotion in my work that will allow me to live financially independant. My moving out and promotion seem like the kind of things social security would pick up on, and perhaps clue them in on the fraud my father has been comitting, so I feel an urge to tell them now that I'll be away from the abusive reaction of my father.\n\nTo clarify: I have wanted nothing to do with this fraud from its conception. Once I was old enough to understand what was happening with it, I knew that I didn't like it, but couldn't say anything. Now I fear that it may bite me, it may look like I am involved. How would I go about informing social security that my father has done this, whilst making sure I am not under threat of criminal charges myself?","url":"https://www.reddit.com/r/legaladvice/comments/1p65r3p/my_father_has_been_using_me_to_scam_social/","permalink":"/r/legaladvice/comments/1p65r3p/my_father_has_been_using_me_to_scam_social/","score":153,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764053660.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p695du","name":"t3_1p695du","subreddit":"legaladvice","author":"SlowTrip837","title":"Landlord threw out my belongings with no notice or eviction while I was in hospital.","selftext":"Location: Oregon\n\nI was hospitalized for 5 months. During that time I was unable to pay rent. When I was discharged and returned to the apartment, the locks were changed and all of my personal property was gone. The landlord never served any eviction notice, never filed for eviction in court, and never had the sheriff remove my things. They cleaned out the unit themselves and threw everything away or gave it away. I never received any written abandoned-property notice by mail or in person.\nThe total value of what I lost is about $3,000. I have hospital records proving I was admitted the entire time.\nMy only question: Do I have a strong case to sue the landlord in small claims court for illegal self-help eviction and wrongful disposal of my property even though I owed back rent?\n\nThanks!","url":"https://www.reddit.com/r/legaladvice/comments/1p695du/landlord_threw_out_my_belongings_with_no_notice/","permalink":"/r/legaladvice/comments/1p695du/landlord_threw_out_my_belongings_with_no_notice/","score":131,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764066788.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ow4t","name":"t3_1p6ow4t","subreddit":"legaladvice","author":"aguyinaboat","title":"$400k RV likely totalled by shop.","selftext":"Location: Oregon\n    Hello wizards of reddit, my grandparents owned a 400k mobile home that needed body work done. Drop it off at an RV shop and pay a few thousand in repairs. A year and a half later it was fixed but the owner reported new problems with the RV that were not there when we initially dropped it off. 28,000 dollars for several repairs and 5 years later the shop owner and his agents go silent. We reached out repeatedly and heard nothing back. Don't even know the location of the RV.\n    The RV has full coverage by progressive and has been paid since we got the rv. We reached out to the insurance company to find the RV. Upon doing some digging the insurance company located the RV and sent agents to the scene. They found the RV, took photos of interior and exterior. Nothing had been done and the condition inside was worsening. \n    A year later still havent heard anything from the shop owner, recently found the RV in a random field/junkyard with a tarp over it. Went inside to take photos and the condition had severely worsened. After talking to a RV specialist he said it was very likely totalled in the present condition.\n    Filed a new claim with new photos with progressive. They tell us the shop owner claims he was not paid. We have receipts and banks statements proving our payment at every step. Progressive agents are still processing our claim, but an agent told us it was unlikely our claim is approved under full coverage (LOL). Told us to take legal action against the shop. \n    Doing research we found that the shop owner is living in a mobile home. Very unlikely he has anything worth more than a few thousand. \n    Progressive told us we've done everything possible correctly... but it seems like we're about to be screwed.\n    Any advice helps, thanks for the read.","url":"https://www.reddit.com/r/legaladvice/comments/1p6ow4t/400k_rv_likely_totalled_by_shop/","permalink":"/r/legaladvice/comments/1p6ow4t/400k_rv_likely_totalled_by_shop/","score":124,"num_comments":30,"over_18":false,"stickied":false,"created_utc":1764105639.0,"edited":0.0,"link_flair_text":"Business Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p66l48","name":"t3_1p66l48","subreddit":"legaladvice","author":"Truth18490","title":"Legal options after a fintech approved a complex 30-year “Home Equity Investment” for my 80-year-old dying father and disabled mother","selftext":"In November 2024, my 80-year-old father signed a “Home Equity Investment (HEI)” contract with **Point Digital Finance**, a California fintech that mails offers for cash with “no monthly payments.” He was terminally ill, on strong pain medication, and cognitively declining. My 80-year-old mother, wheelchair-bound, co-signed but doesn’t remember the call Point cites as proof of her understanding and she was not included in the counseling. My father passed away 59 days after signing the contract with Point.\n\nWhen asked about protections, Point’s official response to us and regulators has been:\n\n“The Home Equity Investment is structured as an option contract and is therefore exempt from the Truth in Lending Act (TILA) and other lending regulations.”\n\nThat classification lets them avoid lending laws even though the agreement is recorded as a **mortgage lien**. In my parents case, the appraised value of their home was cut by roughly 25% (what they call “risk adjustment”). The payoff is calculated in two ways, either the balance compounds monthly at an **18% annualized rate**, or Point takes **over 65% of the home’s appreciation starting from the risk adjusted amount**—whichever is smaller. My mother had to sell her house 10 months after signing the contract in order to pay for her required care. In her case the monthly compounded rate was used for payoff.\n\nThe **Massachusetts Attorney General’s Office**, **CFPB**, and **BBB** all contacted Point, but every response was identical: *“We acted in accordance with all applicable laws.”* None addressed how such a contract was deemed suitable for an elderly, terminally ill and disabled couple in their 80's.\n\nPoint has since paused new HEI activity in Massachusetts after another HEI provider was sued by the AG for predatory practices. They’ve raised over **$400 million** from major investors (Andreessen Horowitz, Ribbit Capital, Prudential, Redwood Trust) and reportedly use offshore “closers” in the Philippines to finalize these 30-year contracts with U.S. homeowners.\n\nI’ve already spoken with several lawyers, but every answer is the same: companies like Point Digital Finance operate in a legal grey area with deep resources. Pursuing any legal action could take years and more money than my family has. Given that my father’s capacity was severely impaired and my mother didn’t understand what she signed, is there any legal basis for challenging this under **unconscionability**, **capacity**, or **predatory lending** doctrines—even if they call it an “investment”? Is there anything else that I can do to to help my mother? Would any state or federal agency have jurisdiction to step in besides those that I've already contacted?\n\nLocation: Massachusetts, USA ","url":"https://www.reddit.com/r/legaladvice/comments/1p66l48/legal_options_after_a_fintech_approved_a_complex/","permalink":"/r/legaladvice/comments/1p66l48/legal_options_after_a_fintech_approved_a_complex/","score":118,"num_comments":22,"over_18":false,"stickied":false,"created_utc":1764056823.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dwjj","name":"t3_1p6dwjj","subreddit":"legaladvice","author":"RavenlockSevian7","title":"Can my boss really make me pay for shoplifting losses out of my paycheck","selftext":"Location: Illinois, USA  \nI work part time at a small indie bookstore. Last week my boss called a \"quick meeting\" and handed all of us a new one page policy to sign. It basically says that any \"preventable loss\" like shoplifting, customer damage, register shortages etc will be taken out of the on duty employees pay, split between whoever was scheduled. She said the store cant survive otherwise and that \"big chains do this all the time\". We are paid just a bit over minimum wage and most days there are only 2 of us on shift.\n\nI asked what counts as preventable. She said if the cameras show the person on our side of the store and we \"werent paying enough attention\" then its preventable. There is also a line saying by signing we \"consent to payroll deductions not limited to but including\" those losses. She made it sound like if we dont sign, we dont stay on the schedule, but nothing was super direct, just a lot of \"I need team players\". I have not signed yet, its still sitting in my bag and Im kinda freaking out. Is this even legal under Illinois law or is this something I should refuse and maybe talk to someone about formally\n\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6dwjj/can_my_boss_really_make_me_pay_for_shoplifting/","permalink":"/r/legaladvice/comments/1p6dwjj/can_my_boss_really_make_me_pay_for_shoplifting/","score":85,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1764081076.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qady","name":"t3_1p6qady","subreddit":"legaladvice","author":"_breezy93_","title":"Daycare worker pushed 1yr old on head, tipped him onto the floor.","selftext":"Good afternoon,\nI was watching my 15 month old son's daycare camera just to check-in this morning, and they were sitting reading a book in group circle. They finished the book, the teacher grabbed another kid's shoes off the floor, then proceeded to push my child on the forehead. He tipped back, hit the back of his head on the floor and started crying. It looked very intentional. He was just sitting there being a good baby, and she just pushed him out of nowhere. She left him there crying for a minute before I called the center, and by the time I got off the phone, they were heading out the door to another room and he was ok at that point. \n\nThey said they don't have the footage available at the center; it needs to be reviewed by the District Manager. If they find anything suspicious, they will start an internal investigation and report it to the state since it's a licensed center. I am not allowed to review the footage with them per their handbook policy. I've honestly been gaslighting myself thinking that maybe I didn't see what happened correctly. I am worried this won't be taken seriously, the teacher might not be punished, etc...\n\n I guess I'm wondering if I should file a police report myself, even though I haven't reviewed the footage? \n\nAny advice about this situation will be extremely helpful. I've been trying to do some research myself, but some people are saying to let the center do it's investigation, some are saying to file a report right away. \nLocation: Minnesota","url":"https://www.reddit.com/r/legaladvice/comments/1p6qady/daycare_worker_pushed_1yr_old_on_head_tipped_him/","permalink":"/r/legaladvice/comments/1p6qady/daycare_worker_pushed_1yr_old_on_head_tipped_him/","score":51,"num_comments":24,"over_18":false,"stickied":false,"created_utc":1764108919.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rlqx","name":"t3_1p6rlqx","subreddit":"legaladvice","author":"Alternative-Eye-747","title":"want to change babies name, father not on birth certificate - do i need to notify him","selftext":"I had my baby and named him something very meaningful and intentional to me while we were in the hospital. We took his newborn announcement photos with his original name, I had custom outfits made, and I was 100% sure that’s what I wanted. But right before being discharged, I was pressured by my mom, my child’s father, and his mom to name him after his dad. For context, the father is not involved at all — he put me out in the middle of the night while I was pregnant, gave me an STD, told me “f*** that baby,” said he would sign his rights away, stopped talking to me months before I gave birth, and completely missed the birth. He still lives 12 hours away and has never supported or been involved with our child. Despite that, I let myself get pressured and changed my son’s name to his father’s name on the hospital paperwork. I’ve regretted it every day since. I’ve never called my son that name — I use a nickname I came up with. Now I want to legally change his name back to the original one I chose, but I’m confused about the process. The father is not on the birth certificate, has never been involved, and we have no court orders or anything legally binding between us. I read online that you have to notify the other parent when changing a minor’s name, but since he’s not legally recognized as the father, I’m not sure if that applies. My concern is this: he and his family have made threats toward me and my baby before, and I truly do not feel safe contacting him. Does anyone know if I would be required to notify him for a name change when he’s not on the birth certificate? And is there any way to avoid notifying him since he is not legally established as the father? Any advice from people who’ve been through something similar or know how this works or any advice in general would be appreciated.\n\nlocation: kentucky ","url":"https://www.reddit.com/r/legaladvice/comments/1p6rlqx/want_to_change_babies_name_father_not_on_birth/","permalink":"/r/legaladvice/comments/1p6rlqx/want_to_change_babies_name_father_not_on_birth/","score":42,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764112164.0,"edited":0.0,"link_flair_text":"Custody Divorce and Family","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t24g","name":"t3_1p6t24g","subreddit":"legaladvice","author":"LastReality7643","title":"How do I revoke Mama Bear Legal Documentation?","selftext":"Location: Maryland ; Location: North Carolina. \n\nHi all. I come from Maryland and go to school in North Carolina. When I turned 18, I was basically told I couldn’t go to school unless I signed the Mama Bear documents. I know there are a few of them. I’m not sure what I have signed since my parents did not let me read the documents, which I know was a red flag, but they would not let me read it on my own time or have a lawyer explain the information to me. \n\nI know one of them is HIPAA related since somehow my Dad finds out about what happens at every doctors visit even though I signed a different document saying I didn’t want this to happen, that was signed before the Mama Bear documentation. So I assume the Mama Bear document overrides that. \n\nI called up to Mama Bears support line to try and get a copy of the documentation and they said they don’t keep it and it’s only a physical copy which I know is false since I know my mom has a digital copy. I asked what about their app, to which the customer support lady said she didn’t know. I don’t have an account with Mama Bear. \n\nI’m 21 now and about to graduate, I was wondering how I would revoke this the second I walk across the stage as I want to start having complete privacy over medical issues. I’m just stuck on what to do since it doesn’t seem like I can receive a copy. I know a course of action would to just be to ask my mom for the copy but I fear that would start an argument. Additionally, for how long does the documentation last? Is this something that I would need to get a lawyer for? Thank you in advance. I know some similar posts have been showing up so I’m sorry if it is repetitive. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6t24g/how_do_i_revoke_mama_bear_legal_documentation/","permalink":"/r/legaladvice/comments/1p6t24g/how_do_i_revoke_mama_bear_legal_documentation/","score":31,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764115957.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6g2au","name":"t3_1p6g2au","subreddit":"legaladvice","author":"Foreign_Artichoke510","title":"Youth Minister Fired for Sexual Misconduct Harassing Victim","selftext":"Location: Vancouver, WA\n\nHello, I have a complex situation involving my former youth minister, who sexually abused me and other teenagers, was fired for sexual misconduct in 2006, and is now a prominent figure in the community today. \nThroughout high-school I attended youth group at a Catholic Parish where the youth minster groomed and sexually harassed myself and other minors, eventually leading to sexual assault when I was 19. The Seattle Archdiocese conducted an investigation and terminated him for sexual misconduct, permanently barring him from any ministry or volunteer roles within Catholic Churches and Organizations in Washington State. This happened in 2006.\nMyself and other victims received backlash from the parish, including anonymous hate mail and threats. The abuser threatened to sue us for defamation if we talked about what happened, and I moved away and did not return to Clark County until about 4 years ago.\n After learning that the perpetrator is still involved with the Parish and youth there today, I’ve contacted the Seattle Archdiocese on multiple occasions and they’ve refused to allow me any access to original documentation and issued a statement saying that he was fired based on his “own admission” of a “consensual” sexual relationship with one 19 year old victim- so they have not formally included any of the allegations of underage grooming and sexual harassment, or the reports of coercive and non-consensual sexual advances that they received from youth during the investigation.\nThe perpetrator is now executive assistant of a very prominent local philanthropic estate, and controls funding towards many nonprofits and election campaigns in the community. The estate also makes thousands of dollars of donations to the parish that he was fired from, where the staff overlook his history and allow him access to youth.\nAfter learning about this I consulted with several pro-bono law firms who advised me that the statute of limitations would likely bar me from taking any action against the Archdiocese today.\nEventually I posted publicly to Social Media about my experience in an effort to provide transparency to families he has access to today that are not informed about his history. \nIn response, the abuser again threatened to sue me for defamation (but has taken no action) and posted his own narrative discrediting myself and others victims. It has been endorsed by many public elected officials who are praising him for his honesty and describing him as a wonderful, godly man and great example for youth in the community today.\nSome of these elected officials have posted harassing public comments about me, questioning my mental health, describing me as a hateful and jealous nemesis who is lying about him, and even encouraging their friends to “take me” whatever that means.\nOne elected official contacted me and told me that the abuser has been reaching out to her asking her to publicly comment on my posts and tell me that i’m mentally ill and need to get help, and he’s insinuated that he will use funds from the estate to contribute to her re-election campaign if she supports him. I assume he’s doing this with others as well.\nI am wondering if there is any possible legal avenue to sue for defamation, either the abuser or any of the elected officials who are making these comments. I do not have any savings to use so it would have to be pro bono. Additionally wondering if there are any non-profit or advocacy groups that I might be able to contact that could assist me. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6g2au/youth_minister_fired_for_sexual_misconduct/","permalink":"/r/legaladvice/comments/1p6g2au/youth_minister_fired_for_sexual_misconduct/","score":32,"num_comments":5,"over_18":true,"stickied":false,"created_utc":1764086121.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kjzq","name":"t3_1p6kjzq","subreddit":"legaladvice","author":"wanderlust_lexi92","title":"Annulment or Divorce","selftext":"Location: Missouri \nSo I have been married for a little under 2 years and have decided to leave my husband due to him admitting to me during an argument that he only married me because I had plans of going to med school so that I can take care of him medically and financially (he has type 1 diabetes). He admitted to pretending to be good so that I would agree to marry him and that he tricked me into marrying him. He also admitted to getting a house together because that was his “investment” so that way he could be taken care of afterwards. I was getting ready to file for a divorce and a couple at my church suggested filing for an annulment. Would him lying about how the marriage started be grounds to get an annulment? Thanks in advance! ","url":"https://www.reddit.com/r/legaladvice/comments/1p6kjzq/annulment_or_divorce/","permalink":"/r/legaladvice/comments/1p6kjzq/annulment_or_divorce/","score":17,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764095975.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p3ii","name":"t3_1p6p3ii","subreddit":"legaladvice","author":"Burritobabyy","title":"UPS lost dogs ashes","selftext":"Location: California \n\nMy 16 year old dog died in October. I took him to his vet clinic to have him cremated. They contract with a company a few hours away who pick up the remains, cremate them, and then they send them back to the vet via UPS. \n\nI called my vet clinic today to see what was taking so long, and apparently when the contracted company sent the package out to be delivered, UPS did not scan it and now he is lost. The cremation company basically said he could turn up but to not get my hopes up. They were very apologetic and wanted me to pick out memorabilia on their website to “make it right”.\n\nThat doesn’t make it right. This dog has been by my side from ages 20-36. He was my everything. \nI know cases are all about damages, but do I have any recourse? This was my family member for 16 years and I am completely sickened and heartbroken thinking my dog is just lost in a box forever. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6p3ii/ups_lost_dogs_ashes/","permalink":"/r/legaladvice/comments/1p6p3ii/ups_lost_dogs_ashes/","score":13,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764106124.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62svi","name":"t3_1p62svi","subreddit":"legaladvice","author":"Throwawayaccusedof","title":"Mom is changing schedule and demanding more money","selftext":"My (29M) and Ex (30F) have been separated for well over a year now. We have two boys 8 & 6. For the majority of our separation, our schedule has been smooth and we co parent  pretty well. We were never married and live in CA. I voluntary give her $850 a month. The supposed schedule is she has them Sunday evening - Thursday morning, and me, Thursday’s after school - Sunday evening. \n\nHowever, I have had the boys for a good chunk of the week. My work schedule allows me to alternate Mondays, and Wednesdays so I always offer to pick the kids up the night before, take them to school, spend the day with them etc. she would always accept seeing the boys happy to be with me.  I do school drop offs, school pick ups, doctor visits, soccer games. I pay for their medical, dental and vision. I am very involved with them. I don’t mind if they stay with me every day. I’m always ready to be with them at a moment’s notice. She recently became pregnant with someone else’s child and decided to cut back her hours at work. She would often text me that she doesn’t feel well and would ask me to watch the kids on days that “aren’t supposed to be with me” Monday, Tuesdays, Wednesdays. She would say that she would make up the time by picking them up on one of my days “Thursdays, Fridays, Saturdays”. She almost never does. She has been very inconsistent these past few months if not year. I always send her the $850 regardless of how much time I have them. She recently decided to take them out of my mom’s day care and start up her own daycare saying that she would no longer need my help with watching them but in turn demands more money.  She is now no longer letting me see them on the days that aren’t mine and has threatened to take me to court and get a child support order if I don’t comply with her increased amount. I have been keeping track of the hours I have had them this past year, and every month I have had them more hours than her by over 50-100 hundred hours. Does she have a case if we go to court? I have tons of proof, messages between her and I, and that for the past year they have been with me the majority of the time. My fear is that because of this sudden change, the courts will rule in her favor, and because I do make a decent amount, the amount I would pay would be a lot higher. I have talked to her and offered to give her the $1200 for a certain amount of time while she gets her daycare in order but flat out refuses and wants it permanently. \nLocation: CA","url":"https://www.reddit.com/r/legaladvice/comments/1p62svi/mom_is_changing_schedule_and_demanding_more_money/","permalink":"/r/legaladvice/comments/1p62svi/mom_is_changing_schedule_and_demanding_more_money/","score":9,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764043699.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u378","name":"t3_1p6u378","subreddit":"legaladvice","author":"TangerineUnique248","title":"Neighbor flooded my yard trying to save money on sprinkler repair, now my fence is damaged and plants are dead, what are my options?","selftext":"Location: Phoenix, AZ  \n  \nThis whole mess started about 3 weeks ago when my neighbor decided to tackle his own sprinkler system instead of calling a professional. He mentioned he was trying to avoid the $300 quote he got and figured he could save money doing it himself since he \"used to do this kind of work\" (spoiler alert: he definitely did not).\n\nLong story short, he somehow managed to rupture the main line that runs under our shared fence. I was at work when this happened but my ring camera caught the whole disaster. Water was gushing for what looks like hours before he even noticed. By the time I got home, my entire backyard looked like a swamp.\n\nThe flooding killed about $800 worth of desert landscaping that I just had installed last month, plus the constant water undermined the concrete footings for our fence. Now theres a 15 foot section thats literally leaning into my yard and looks like it might fall over completely.\n\nI tried talking to him about paying for the damages but he keeps saying it was an \"accident\" and his homeowners insurance wont cover it because it was from his own DIY work. He offered to help fix the fence himself (yeah right) but honestly I dont trust him with a screwdriver at this point.\n\nLuckily I have some money set aside for home repairs but I really dont want to dip into that for something that wasnt my fault. My questions are: Can I make him pay for all the damage even though it was technically an accident? Should I file a claim with MY insurance and let them go after him? And what about the fence - we both use it so are we both responsible for fixing it even though he caused the problem?","url":"https://www.reddit.com/r/legaladvice/comments/1p6u378/neighbor_flooded_my_yard_trying_to_save_money_on/","permalink":"/r/legaladvice/comments/1p6u378/neighbor_flooded_my_yard_trying_to_save_money_on/","score":21,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764118749.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6opvt","name":"t3_1p6opvt","subreddit":"legaladvice","author":"meatballgene","title":"Court advice needed","selftext":"Location: New Jersey\nI was pulled over for speeding on the turnpike by a state trooper in September. He also gave me a ticket for not wearing a seatbelt, which I was wearing but I took it off once I pulled over, so I’m going to court to fight that ticket. In my defense, I had just got the car a month prior and the glovebox is behind the passenger seat (its a coupe), in the moment I was thinking I needed to take it off in order to reach it. This is my first traffic offense, I’ve been pulled over a few times but never got a ticket for anything. I’m 22 and I’ve never been to court before so I’m a bit anxious about it. Do you guys have any advice for what I should do? Should I have notes for myself and pics of my car? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6opvt/court_advice_needed/","permalink":"/r/legaladvice/comments/1p6opvt/court_advice_needed/","score":6,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764105250.0,"edited":0.0,"link_flair_text":"Traffic and Parking","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p639w7","name":"t3_1p639w7","subreddit":"legaladvice","author":"More_Rise","title":"Our former landlord is filing for eviction, but we’ve already signed a new lease somewhere else Location: Colorado","selftext":"Our old landlord told us we had to be out after today. They want to replace the carpet because of “damages” and told us we could pay for the replacement or leave. The carpet was already torn a little before we got there, but we had a pet rabbit and they’re claiming there’s a strong smell (that no one else smells) and staining (stains only show up under black light). Due to some seriously unfortunate, unforseeable, and completely uncontrollable circumstances, getting all our stuff out took longer than expected. They’re saying they’re filing for eviction and I’m just wondering if this will affect our new lease? We’ve already signed, paid, and mostly moved in. Location: Colorado","url":"https://www.reddit.com/r/legaladvice/comments/1p639w7/our_former_landlord_is_filing_for_eviction_but/","permalink":"/r/legaladvice/comments/1p639w7/our_former_landlord_is_filing_for_eviction_but/","score":6,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764045206.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rwuk","name":"t3_1p6rwuk","subreddit":"legaladvice","author":"strawberryfroglove","title":"Turning 18, police escort","selftext":"So I’m gonna turn 18 soon and I want to leave the day I turn 18. It’s a school day, so I plan to get on the bus to school and then leave with my friend and stay with them. \n\nLocation: Ohio, United States.\n\nI am worried my mother will try to stop me, or try to get me back. Can she legally do that, since I’ll be 18? Or am I 100% off limits?\n\nAnd my big question, can I call a non-emergency line and tell them my concerns, and ask for an escort when I get my stuff? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6rwuk/turning_18_police_escort/","permalink":"/r/legaladvice/comments/1p6rwuk/turning_18_police_escort/","score":7,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764112953.0,"edited":0.0,"link_flair_text":"Custody Divorce and Family","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6oyu3","name":"t3_1p6oyu3","subreddit":"legaladvice","author":"Basicman68","title":"Former employer taking cost of provided uniform out of my final paycheck and refusing to pay me back after I returned it","selftext":"Location: Missouri\n\nHello everyone I was recently fired from a \nrestaurant at this fancy steakhouse in Missouri ,on my first day I was provided with a uniform that was a white dress shirt,a vest,bow tie and apron. The owners of this restaurant who are known for being assholes bought it when I started and for the entire time I worked there did not say anything about me having to cover the cost or anything like that.So after I was fired I was told to bring back the uniform. The owners sent me my final check and told me $50 was taken out for the cost of the uniform and I would get that $50 when I return it.They fired me on Saturday and sent me my final paycheck via Cash App Sunday morning. They are closed on Sunday and Monday and when I texted them asking when can I return the uniform,they didn’t reply. Since it’s thanksgiving week and I know I’ll be busy I decided to leave it hidden outside in a bag so no one would steal it and it wouldn’t get damaged by rain. I sent a video of where it was to the owner and said i returned it and to please send me my money. She replied by saying i needed to go back and bring it on Tuesday because it could get stolen or “damaged by rain” except it was hidden and covered so I told her it was safe and I didn’t have time to bring it back next week because I would be busy,plus these owners were assholes and there is no point in my driving back when it’s already at the restaurant. The owner started demanding to bring it back and said I wouldn’t be getting paid for it now. I told her it’s illegal to take the cost of the uniform out of my check since I returned it and I didn’t sign anything about having to pay and was never told I would have to pay for it. \n\nI will try and stay active to answer any questions but I need help on what should I do to get my money back?","url":"https://www.reddit.com/r/legaladvice/comments/1p6oyu3/former_employer_taking_cost_of_provided_uniform/","permalink":"/r/legaladvice/comments/1p6oyu3/former_employer_taking_cost_of_provided_uniform/","score":5,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764105816.0,"edited":0.0,"link_flair_text":"Business Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lwbo","name":"t3_1p6lwbo","subreddit":"legaladvice","author":"Majestic_Care7780","title":"Power outage for 12+ days","selftext":"It’s been difficult to find legal advice as a tenant, so here I am asking anyone here. For the sake of time I’ll present the facts as quickly as I can. also fyi this is my first post ever\n\nLocation: Irving Tx\n\nI live in Irving, Texas. A storm occurred on Oct 30 causing a tree branch to fall onto a power line in between mine and our neighbors yard. this prompted us to try and contact our landlord (third party management company). they did not initially answer so our neighbor called the electrical distribution company to see if they could turn off the power line so he could cut the branch. Technicians came out to investigate the power line and happened to discover that the electrical equipment (meter base and weather head) on our house is “hazardously deteriorating“ and they immediately cut power to the house. our landlord took 6 days to approve the electrical work, with it being completed on the 9th day. the electrician told me and I have evidence he could have started on the 2nd day and finish by the 4th. we just had an inspection done today (12th) day and power might turn back on we’ll see. The tree branch is still on the power line so I’m not sure if oncor will approve it yet. The branch hasn’t been cleared because the landlord hasnt approved work with the contractor, they also didn’t even contact someone to take care of the branch until the 5th day\n\nwe have endured many extra expenses as a result for example airbnb is the primary expense. we’ve done our legal research and believe we have a claim under the following, with the goal to get our money back from temporary housing.\n\n1. violation of texas property code 92.056 because 12+ days is not a reasonable amount of time to complete an eme situation that leaves the home uninhabitable\n2. violation implied warranty of habitability because we’ve been living in a house that has hazardous electrical equipment for the entire lease, supported by Kamarrath v Bennett.\n\nEvidence:\n\n1. texts from electrician stating he was prepared to start as early as the 2nd day but due to approvals he started work on the 9th day\n\n2. Electrical distributor stating the equipment is “hazardously deteriorating“\n\n3. we have given them multiple notices\n4. beginning of our lease we created a work order for our dryer after it and the breaker box sparked (7months ago)\n5. City code violations\n6. confirmation that this is the equipment the house was built with in 1960\n\nThere are a few smaller details I’ve left out, but my question to yall is\n\n1. do you think I have a case?\n2. how would you suggest we proceed, just take it to small claims court?\n3. Any other advice?","url":"https://www.reddit.com/r/legaladvice/comments/1p6lwbo/power_outage_for_12_days/","permalink":"/r/legaladvice/comments/1p6lwbo/power_outage_for_12_days/","score":5,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764098905.0,"edited":1764099938.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u0qq","name":"t3_1p6u0qq","subreddit":"legaladvice","author":"Slow-Plenty-6974","title":"My uncle’s fiancée took their baby, lied to get a restraining order, and now he has a court date. What should he do next?","selftext":"Location: Oklahoma\n\nMy uncle is in a really messy situation right now and since he and the rest of my family aren't really internet-savvy, I wanted to ask for an outsider's perspective on what steps he should be taking next. \n\nI actually lived with his fiancée for about a year when they were in Georgia, so I’ve seen her behavior up close. She has a long history of mental health issues, instability, and impulsive behavior. Even when she was on her “best behavior” living with us, there were still a lot of red flags. Their relationship was rocky before she got pregnant, and most of us honestly felt like having a baby together wasn’t the best idea, but we hoped things might improve. Unfortunately, they didn’t.\n\nThey moved to Oklahoma last year and things have gotten progressively worse. They’ve been fighting constantly. According to my uncle, she had been planning to leave with the baby behind his back and even talked about intentionally provoking him (for what reason, none of us know). He also suspected she was drinking and driving with the baby in the car? there’s no hard proof, but my grandma lived with them at the time and witnessed concerning behavior.\n\nA few days ago they had a huge argument and the police were called. Surprisingly, the officers actually gave my uncle permission to take the baby to a hotel for the night. I don’t know exactly what they saw or heard, but the fact that law enforcement trusted him with the baby and told him to leave with the child seemed very important.\n\nThe next day when he returned home, she was gone. She took the baby without telling anyone where she was going. Later we found out she went to a women’s shelter and claimed he was abusing her. She then filed for an emergency protective order (restraining order), which was granted temporarily. He now has a court hearing for it coming up next week.\n\nMeanwhile, my uncle was literally in the process of trying to file a paternity case since they aren’t married, so he could get legal custody/visitation established. But she beat him to the courthouse with the emergency filing.\n\nHe does have screenshots of her talking about leaving with the baby and trying to provoke him. He also has my grandma as a witness to some of the instability. He does have a criminal history, but nothing violent, nothing involving children, and nothing that would make him unsafe as a parent.\n\nThe problem is: my uncle is not wealthy, and he cannot just hire a lawyer right away. He will probably have to represent himself for the upcoming hearing. As a family, we’re trying to help him gather evidence and understand what typically happens in cases like this, but we honestly don’t know what will matter most in court or how these situations usually go.\n\nIf anyone here has been through something similar or has general advice on what someone in his position should focus on, we’d really appreciate any insight. We just want to make sure he doesn’t lose access to his child over something that seems to be based on lies and panic.\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6u0qq/my_uncles_fiancée_took_their_baby_lied_to_get_a/","permalink":"/r/legaladvice/comments/1p6u0qq/my_uncles_fiancée_took_their_baby_lied_to_get_a/","score":4,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764118558.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tmxx","name":"t3_1p6tmxx","subreddit":"legaladvice","author":"DracMonster","title":"Is my wedding venue doing something sketchy?","selftext":"Location: New Jersey.\n\nI hope this is appropriate for this sub. Apologies if I should take it elsewhere.\n\nI'm getting married in the spring next year. A local restaurant is our venue for both the ceremony and reception. They handle weddings regularly.\n\nWhen we were ironing out details with the coordinator, one thing he specified is there is a discount (8%) for paying cash. Not a check, it must be physical currency. This is a small wedding, but it's still thousands of dollars.\n\nI could understand if they wanted a check to avoid credit card fees, but literally cash only?\n\nI've been thinking about this and remembering the money laundering scenes from Breaking Bad. Is there any likelihood they're doing something like evading taxes? And is there any way we could be liable?\n\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6tmxx/is_my_wedding_venue_doing_something_sketchy/","permalink":"/r/legaladvice/comments/1p6tmxx/is_my_wedding_venue_doing_something_sketchy/","score":4,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764117515.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ol0r","name":"t3_1p6ol0r","subreddit":"legaladvice","author":"No_Economicz","title":"Wedding venue changing terms after grandmother (co-signer) passed away, refusing to honor written postponement agreement. What are our options?","selftext":"Location: Dallas, TX\n\nMy fiancée and I were supposed to get married in February 2026. The wedding contract was signed by both my fiancée and her grandmother. Her grandmother was also the one funding the wedding.\n\nIn September, my fiancée’s grandmother passed away unexpectedly. Since then, the probate process has been slow and complicated, and the funds for the wedding are currently tied up in probate. We still owe about $6,000 on the wedding, and the total cost is around $12k–14k. We informed the venue as soon as we were able to.\n\nBecause we suddenly lost the person paying for the wedding, we initially asked the venue about canceling. They did not respond to any emails for almost 25 days other than \"I will get back to you in a few days\". When they finally replied, they said that because the date was within 6 months, cancellation would require us to pay **90% of the full balance**, with no refund of anything already paid. They also told us we would have to pay that amount upfront even if we had wedding insurance, and “hope the insurance pays out.”\n\nWe cannot afford to pay $6,000 out of pocket and gamble on an insurance reimbursement.\n\nBecause of this, we decided we wanted to *proceed* with the wedding but postpone the date to allow the probate funds to come through. The venue agreed **in writing** to:\n\n* waive the $500 postponement fee\n* allow us to postpone until probate finalized\n* push out the payment schedule\n\nAfter that written agreement, communication stopped again. Today someone new (a district manager) emailed us and said they would **not** waive the $500 fee and that the amount “is still due per accounting/legal.”\n\nThis contradicts the written agreement we already received. We also don’t know if our original planner still works there. We keep getting bounced around with no consistency, and every time we reach out we get a different answer. Meanwhile, we are dealing with the loss of a close family member and trying to get through probate.\n\nWe want to fulfill the contract; we just need time for the estate funds to be released. At this point we feel like we’re being ignored and pressured into fees we were previously told were waived.\n\n**My questions:**\n\n1. Are written email agreements to waive fees/postpone dates legally enforceable if they came from the venue planner?\n2. Can the venue go back on a written modification after we relied on it?\n3. Does the death of a co-signer affect enforceability of the original contract or postponement terms?\n4. What steps can we take to compel the venue to honor the written postponement?\n5. Would this be suitable for a demand letter, small claims, or a state AG consumer complaint?\n\nAny guidance is appreciated. This is taking a huge mental toll on us.","url":"https://www.reddit.com/r/legaladvice/comments/1p6ol0r/wedding_venue_changing_terms_after_grandmother/","permalink":"/r/legaladvice/comments/1p6ol0r/wedding_venue_changing_terms_after_grandmother/","score":4,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764104933.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6373m","name":"t3_1p6373m","subreddit":"legaladvice","author":"Excellent-Driver4378","title":"Designer took videos of my house and wants to share without my permission.","selftext":"We hired an interior designer in Dallas, TX and had a horrible experience. We ended up ignoring her suggestions and going with our own design choices because hers were so bad. We’re finished with construction now and the designer has in her contract that she could take photographs to post on social. She came last week and turns out she decided to take lots of videos where she took credit for a bunch of things she didn’t do. We told her that we consented to photographs but not videos. The contract reads: “Designer will be allowed to photograph progress and completed project and reserves the right to photograph project for either publication, social media or any other company use.”\n\nDo we have any recourse here? She’s insisting that because it’s Instagram she can post what she wants, but photographs and videos seem totally different to me. \n\nLocation: Dallas, Texas","url":"https://www.reddit.com/r/legaladvice/comments/1p6373m/designer_took_videos_of_my_house_and_wants_to/","permalink":"/r/legaladvice/comments/1p6373m/designer_took_videos_of_my_house_and_wants_to/","score":5,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764044959.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6srm7","name":"t3_1p6srm7","subreddit":"legaladvice","author":"sciecom","title":"Someone storing stuff in my storage unit - want it gone","selftext":"Location: Minnesota\n\nI'm renting a storage unit. A friend of mine has some stuff in the unit. He was supposed to help out with the storage bill, but he hasn't been for awhile now. We just had an oral agreement, no written contract.\n\nMy stuff in the unit is gone, and I want to close it. I told him that, but he's just ignoring the situation. Are there any laws about what I have to do before disposing of his stuff?\n\nThanks in advance.","url":"https://www.reddit.com/r/legaladvice/comments/1p6srm7/someone_storing_stuff_in_my_storage_unit_want_it/","permalink":"/r/legaladvice/comments/1p6srm7/someone_storing_stuff_in_my_storage_unit_want_it/","score":3,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764115198.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rl4i","name":"t3_1p6rl4i","subreddit":"legaladvice","author":"Nimzles","title":"Getting divorced to get money out of retirement","selftext":"Location: Northern Illinois\n\nMy wife and I are facing some financial troubles relating to high interest debt. I have a lot of money in an annuity except I can't get to it. If my wife and I get divorced she loses health insurance. Could we get divorced so she gets some of my retirement money and then remarry shortly after so we aren't paying cobra for any significant amount of time? How long would this process take? About how much money should it cost? Is there anything related to a fraud charge that could be an issue?\n\nEdit to add: Just to be clear, this is an annuity where all the money is in my own personal account. This is not to get pension benefits early.","url":"https://www.reddit.com/r/legaladvice/comments/1p6rl4i/getting_divorced_to_get_money_out_of_retirement/","permalink":"/r/legaladvice/comments/1p6rl4i/getting_divorced_to_get_money_out_of_retirement/","score":3,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764112119.0,"edited":1764119545.0,"link_flair_text":"Credit Debt Bankruptcy","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p6u0","name":"t3_1p6p6u0","subreddit":"legaladvice","author":"kristinj81","title":"Filing for divorce from out of state.","selftext":"Location: North Carolina and Illinois \n\nEx and I married and separated 5 years ago in NC. I moved to Illinois shortly after the separation. We kept everything separate and have no shared assets. No kids. Am I able to start the divorce process from Illinois/with the Illinois court systems? TIA!","url":"https://www.reddit.com/r/legaladvice/comments/1p6p6u0/filing_for_divorce_from_out_of_state/","permalink":"/r/legaladvice/comments/1p6p6u0/filing_for_divorce_from_out_of_state/","score":3,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764106340.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64v75","name":"t3_1p64v75","subreddit":"legaladvice","author":"Alarming-Habit4283","title":"I want to report my rape but I'm not sure where to start or how. I'm a bit scared to.","selftext":"I was advised on another sub reddit ( r/rapecounseling) to seek legal advice on my situation so that's what im doing. I'm 16 and I was raped when I was around 10-11 by my bio dad. I'm not sure how long it lasted, I suspect for maybe a month but I'm not sure if more or less. I was manipulated by him to never tell anyone but recently something happened that made me speak up to my mom about what happened and she made me cut contact with him and some other familiars on his side of the family. I've been really getting into the idea of reporting him but me and my mom aren't sure how to. We live at the border (we're hispanic) and she and dad both work in the U.S. She doesnt trust the laws in Mexico which is why she wants me to do it in the U.S but I'm not sure where to even start or what to say. I don't have any evidence which is my main reason for being scared of reporting, it would be my word against his. My therapist recommended me to write all my memories from my rape in a diary but I don't think it's enough but I'm also scared that they'll take me away from my mom or worse deport us with the current political situation. Location: San diego","url":"https://www.reddit.com/r/legaladvice/comments/1p64v75/i_want_to_report_my_rape_but_im_not_sure_where_to/","permalink":"/r/legaladvice/comments/1p64v75/i_want_to_report_my_rape_but_im_not_sure_where_to/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764050472.0,"edited":1764050955.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t7u7","name":"t3_1p6t7u7","subreddit":"legaladvice","author":"ProfessionalPost3104","title":"Cali, can you drop domestic violence charges?","selftext":"Location: California I read online that someone in California always has to be arrested following domestic violence... I said too much at the doctors like an idiot and they are looking into charging someone I know now. Is there anything I can do? What if I was at fault but didn't swing first persay...? What if i asked to be hit? does mutual combat come into play or do we then both get charged with assault and battery","url":"https://www.reddit.com/r/legaladvice/comments/1p6t7u7/cali_can_you_drop_domestic_violence_charges/","permalink":"/r/legaladvice/comments/1p6t7u7/cali_can_you_drop_domestic_violence_charges/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764116381.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qihj","name":"t3_1p6qihj","subreddit":"legaladvice","author":"Friendly_Gur_6150","title":"Landlord Threatening Collective Punishment","selftext":"Location: Wisconsin, USA\n\nWhile I understand any actual action taken by myself should be in conjunction with a lawyer, I'd like some help responding to a 'threat' made by my landlord in a professional manner, prior to engaging legal services if a response alone doesn't nip it in the bud.\n\nReceived this notice, by email, from my landlord earlier today:\n\n>We are sending out this notice regarding furniture and large items that have been left in the loading dock area and inside the garbage chutes.\n\n>Effective immediately, any furniture or large items left in the garbage chute will result in a charge to the entire floor if no one comes forward.\n\n>The same policy will apply to the loading dock area, except the charge will be applied to every resident’s ledger if items are abandoned without notice.\n\n>Please remember that management is not responsible for disposing of your furniture or oversized items.\n\nThe notice goes on to state later that:\n\n>\\* Large items must never be placed inside the chute or left beside the bins. This causes blockages, damages equipment, and creates safety hazards.\n\nBased off of what I can find through a bit of googling, collective punishment seems to be generally not allowed, and in Wisconsin specifically this seems to run afoul of Wis. Stat. § 704.44(7)(b) if they claim this is covered by the lease.\n\nAs a follow up to this email, I stopped in to the leasing office to ask if these fees were covered under my lease, and was told it was, and I asked for that in writing. If they confirm to their knowledge that these fees are allowed under the lease, then that would void the lease for \"impos\\[ing\\] liability on a tenant for \\[..\\] property damage caused \\[...\\] by persons other than the tenant or tenant's guest\".\n\nIf they confirm that they hold that the lease covers these new communal fees, I want to know how best to respond to that confirmation to get them to rescind the communal fees and/or properly threaten legal action if they do charge the communal fees.","url":"https://www.reddit.com/r/legaladvice/comments/1p6qihj/landlord_threatening_collective_punishment/","permalink":"/r/legaladvice/comments/1p6qihj/landlord_threatening_collective_punishment/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764109453.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6osq9","name":"t3_1p6osq9","subreddit":"legaladvice","author":"soggies_revenge","title":"Father deceased, questions about will, probate, debt, life estate....","selftext":"Location: Iowa. My father passed away recently, and I'm just trying to navigate some early things before getting an attorney. He lived on a farm, with some land that was leased out for agriculture. The will is set up as a life estate, where his wife (my stepmother) lives at the house until her passing, then the farm goes to my sister and I (remainderment?). My questions: \n\n1. There is some credit card debt, a small mortgage amount, and probably medical debt. My stepmother says we may need to sell a small parcel to cover it. Is this something my sister and I would have to authorize? And is this necessary.... or who would be responsible for this debt in this case? \n\n2. I really would rather sell all in one shot or not at all. Ideally after the passing of the remainderment to us (something about a percentage that must go to surviving spouse). Do we have any options to terminate the living estate AND go around the possible percentage that goes to the surviving spouse? \n\n3. My stepmother is executor of the will, I am the secondary. Is she able to authorize any sale of land to cover debts? \n\nThanks in advance. Any additional advice would be appreciated as well!","url":"https://www.reddit.com/r/legaladvice/comments/1p6osq9/father_deceased_questions_about_will_probate_debt/","permalink":"/r/legaladvice/comments/1p6osq9/father_deceased_questions_about_will_probate_debt/","score":2,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764105425.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o9g3","name":"t3_1p6o9g3","subreddit":"legaladvice","author":"Sleepy-Blonde","title":"Can employer refuse use of sick leave and PTO for on-call staff?","selftext":"Location: WA state. State dept employer is declining all requests for sick leave and PTO accrued for on-call staff. Not on-call like on stand by, but on-call as in filling in shifts. Not one permanent post or schedule, but a set minimum amount of hours required. They aren’t denying due to coverage, but saying leave can’t be used at all.\n\nEdit: Previously they allowed sick leave for going home mid shift or would allow PTO by scheduling a shift then marking workers out.","url":"https://www.reddit.com/r/legaladvice/comments/1p6o9g3/can_employer_refuse_use_of_sick_leave_and_pto_for/","permalink":"/r/legaladvice/comments/1p6o9g3/can_employer_refuse_use_of_sick_leave_and_pto_for/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764104219.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m22l","name":"t3_1p6m22l","subreddit":"legaladvice","author":"cliq90","title":"Someone else built my SaaS","selftext":"Hi all. \n\nEarlier this year I had an idea for a SaaS business. I shared some things regarding this online on entrepreneur pages hoping for some advice.\n\nI also filed a provisional patent for the idea which the UK IPO seemed happy with. I don't want to say too much but it was a sports tech/user feedback style venture.\n\nAs a complete business beginner I went to upwork to hire a developer and agreed a price for the MVP however the prospect of further costs and iterations before it was market ready and a busy personal and work schedule gave me extreme anxiety and I decided not to go ahead with anything at that point. This was May this year.  \n\nFew months later I have found an app online which has a feature really similar to my provisional patent. With the tech and style of app I can only assume there has been a large amount of money spent on it.\n\nAdditionally, the execution of aspects of the app have a suspiciously strong resemblance to what I had agreed with the developer. \n\nThe company behind the app have been about for several years(different country) but this app has only surfaced in October. \n\nThe timing and uncanny nature of it all feels very off. \n\nI can't help but feel someone with more resources than me has saw an opportunity with my idea and pressed forward. The final proposal between me and the developer literally describes what this new app looks like. \n\nAs a would be solo founder in this situation, I'm looking for advice on what to do next as I have limited resources and the suspicious company seem to have more finance behind them.\n\nLocation: UK ","url":"https://www.reddit.com/r/legaladvice/comments/1p6m22l/someone_else_built_my_saas/","permalink":"/r/legaladvice/comments/1p6m22l/someone_else_built_my_saas/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764099257.0,"edited":0.0,"link_flair_text":"Business Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kf3k","name":"t3_1p6kf3k","subreddit":"legaladvice","author":"fuckthetop","title":"Cancelling lease early due to utility dispute? [Portland, OR]","selftext":"Location: Portland, OR\n\nHi everyone! I have a bit of a complex situation that I’ll do my best to explain clearly.\n\nMy husband and I moved into a house owned by a private landlord in 2021. When we signed the lease, the owner of the house included a clause stating “Owner is responsible for payment of all utilities.” When we pointed this out to him, he realized that he had made a mistake and offered to reduce the rent by $100 to make up for it. We agreed to this and signed. Also (at the time, we know now), we were charged a non-refundable cleaning fee which are not allowed in OR, to my understanding. We also paid a last month’s rent that the lease says will be applied to “June 2025, the last month of the lease”. We’re now in 2025 and still living in the house. He has only raised rent twice and stopped after 2023. In each lease renewal, he has included the clause that “Owner is responsible for all utilities”, but we have been paying this whole time. This hasn’t presented an issue until now. \n\nLast March, our garage opener stopped working. Owner had a tech come out to the house and the tech says the door is about ready to fall off (it’s been on since house was built 30+ years ago) and he could install a new opener, but the door needs to be replaced and that will run about $4k. Owner doesn’t want to pay for that so we’ve been without a working garage door since then. Our gutters are extremely full and slowly detaching from the house, walking to our front door involves going under a waterfall. The toilets have something wrong with them but we’ve been making it work. We had an electrical issue recently but Owner sent someone out to fix it and it has been resolved. However, our biggest issue is water. \n\nWe’re billed bi-monthly so we’re used to higher water bills ($150-300) depending on the time of year. In September, we received a water bill for almost $800. We pulled up our water usage and went from an average of 4-5 units every two months to 43 in two months. Owner had his landscaper take a look at the sprinkler system and he found a loose sprinkler head, which he assumed fixed the problem. However, we found out that it didn’t when we received a bill after for $1,100 from the water company. A plumber came out recently and was stunned by the lack of maintenance that has been done on the house. He quoted about $4,300 in preventative measures and admitted that at this point it’s likely that the leak is connected to the water main but we won’t know until we get our next bill in January. When my husband told him that we don’t want to pay this huge water bill, Owner was kinda like “okay well we will see what happens when the next bill comes” but I have a feeling if he’s having to shell out money for repairs, he’s going to put up a fight about paying the bill too. \n\nAt this point, we’re wanting to cut ties and move on. However, I don’t think we have a covered reason in Oregon to break our lease. And even if we agree to amicably end the lease early, I don’t know how to approach having him foot the bill without getting a lawyer involved to enforce the lease so we may be stuck with that and lose our last month’s rent depending on the language (which states it covers the last month of the lease). Is there any recourse to not be out over $3k and leave, or should we just stick it out until the end of the lease and hope he’s willing to cover the bill? I am worried about taking legal action to enforce the lease if we end up staying several more months. \n","url":"https://www.reddit.com/r/legaladvice/comments/1p6kf3k/cancelling_lease_early_due_to_utility_dispute/","permalink":"/r/legaladvice/comments/1p6kf3k/cancelling_lease_early_due_to_utility_dispute/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764095674.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jdpz","name":"t3_1p6jdpz","subreddit":"legaladvice","author":"tdave22","title":"My fiancé might have to file bankruptcy. What should I know?","selftext":"Long story short, I got engaged last month. My SO’s business has long been suffering and she finally decided she’s done, which means walking out on 18 months of a 2-year lease and turning the building back to the owners. Theoretically, they’ll sue her for the unpaid rent. She doesn’t have any money though so she’d likely file bankruptcy. I, on the other hand, have a healthy savings account and down payment saved for a home.\n\nMy question is, what happens if we get married and they decide to sue her? Would my assets now be considered in her bankruptcy? My plan was always to merge everything, I’m just not sure how to best protect me/us as we navigate this. Can we still get married? Location: Utah\n\nTIA","url":"https://www.reddit.com/r/legaladvice/comments/1p6jdpz/my_fiancé_might_have_to_file_bankruptcy_what/","permalink":"/r/legaladvice/comments/1p6jdpz/my_fiancé_might_have_to_file_bankruptcy_what/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764093435.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p68x9x","name":"t3_1p68x9x","subreddit":"legaladvice","author":"Competitive_Lake2636","title":"Guidance on easement","selftext":"My family and I are in a mess with a new-construction home contract in Virginia, and I’m hoping someone with real estate or legal experience can weigh in.\n\nWe went under contract with a builder on a new construction home. The builder never gave us a plat, never mentioned any easements, and nothing was disclosed in the paperwork. After signing, we discovered there is a recorded, active easement running right through the property that provides road/utility access to other homes. It significantly affects privacy, use of the yard, traffic, and the property’s value.\n\nThe builder knew about this easement (it’s in county records from when they bought the land), but we weren’t told anything before signing. Now that we found out, the builder refuses to release us. Instead, he’s blaming us for “not doing due diligence before signing,” even though we didn’t have any documents to review.\n\nHe’s pressuring us to confirm in writing that we’ll move forward, and he keeps trying to downplay the easement by offering a “lot walk” and “landscaping options.” Meanwhile, we’re a military family with four kids, and the $15k earnest money we already gave him is our entire savings. We don’t have the resources to fight a big legal battle or move forward with a house that wasn’t accurately represented. He said we are liable for 80k in damages if we don’t move forward. \n\nWe’ve talked to a couple lawyers who gave mixed answers, and we have another consult soon. Right now we’re trying to figure out:\n\t•\tDo we have any leverage based on nondisclosure of the easement?\n\t•\tCan a builder really force us to close when a material fact wasn’t disclosed?\n\t•\tWhat are the real risks of them suing us if we refuse?\n\t•\tHas anyone successfully gotten out of a new-construction contract over a nondisclosure issue?\n\nAny insights or experiences would help a lot. This whole situation has been extremely stressful and confusing, and we’re just trying to understand our actual options.\n\nLocation: Virginia","url":"https://www.reddit.com/r/legaladvice/comments/1p68x9x/guidance_on_easement/","permalink":"/r/legaladvice/comments/1p68x9x/guidance_on_easement/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764065930.0,"edited":1764066308.0,"link_flair_text":"Real Estate law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67x1i","name":"t3_1p67x1i","subreddit":"legaladvice","author":"alohashalom","title":"What does 'not intent-enforcing\" mean for constructive trusts?","selftext":"Location: NY State\n\nI keep coming across the same sentence over and over again when researching constructive trust caselaw:\n\n\"Constructive trust doctrine serves as a \"fraud-rectifying\" remedy rather than an \"intent-enforcing\" one. ([Bankers Sec. Life Ins. Soc'y v. Shakerdge, 49 NY 2d 939 - NY: Court of Appeals 1980](https://scholar.google.com/scholar_case?case=1159445583843702473))\n\nI don't find a clear example of what the \"intent\" is.\n\nFrom the case above and also ([In re First Central Financial Corp., 377 F. 3d 209 - Court of Appeals, 2nd Circuit 2004](https://scholar.google.com/scholar_case?case=18049604863451309954)), I get the impression that it's an intent for a future benefit that didn't come to pass.  A person can't claim a constructive trust on something they didn't have a prior interest in.  In other words, if Party B had promised to give something to Party A, which Party A never originally owned, but then never does, Party A doesn't have standing to claim a constructive trust.  Like if I promise to give a friend my car, but later change my mind.\n\nIs that correct however?  What if Party A had transferred money to Party B for some purpose, but then Party B never fulfills it.  Party A has a claim for a constructive trust, but is that not \"intent-enforcing\"?","url":"https://www.reddit.com/r/legaladvice/comments/1p67x1i/what_does_not_intentenforcing_mean_for/","permalink":"/r/legaladvice/comments/1p67x1i/what_does_not_intentenforcing_mean_for/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764062023.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p663sn","name":"t3_1p663sn","subreddit":"legaladvice","author":"Real_Fix_1596","title":"I'm worried that my Narcolepsy will end up getting me fired.","selftext":"Location: England\n\nI have worked in an insurance sales job for the past 6 years, and been supported to a degree. Whenever I become overwhelmingly tired and unable to do my job I feel like a burden to the rest of my team. Conversations with the head of insurance  have also made me feel uncomfortable where they have said things like \"are you sure this is the right job for you?\" and \"I suppose it's technically a disability\". I'm also constantly asked if I'm doing everything outside of work to be the best I can be inside of work, like I'm meant to go into stasis until my next shift starts.\n\nI feel like it's really starting to have a negative impact on my quality of life in all other aspects, because I can't get work out of my head.\n\nI was hoping for some legal advice and reassurance that my disability won't be something that makes me lose my job, and some actionable steps to help me feel more secure in my role. Posting here, as I want to know that what I'm doing is within my rights as an employee.","url":"https://www.reddit.com/r/legaladvice/comments/1p663sn/im_worried_that_my_narcolepsy_will_end_up_getting/","permalink":"/r/legaladvice/comments/1p663sn/im_worried_that_my_narcolepsy_will_end_up_getting/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764054980.0,"edited":0.0,"link_flair_text":"Business Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p646p8","name":"t3_1p646p8","subreddit":"legaladvice","author":"Limp_Internet6099","title":"Surprise! No more bonus pay!","selftext":"Location: Phoenix, AZ\n\nBurner and some details have been slightly modified:\n\nI signed my offer letter for a new position earlier this year. It’s a 80k salary plus up to 20% bonus quarterly after the opening of the business. We opened early August, and everyone has been silent about what the metrics/expected results are for the bonus pay. So I emailed HR asking a few questions and they responded with, “This is not something that we are offering at this point in time as this is based on profitability and performance.”\n\nI asked for more info on where we’re at with profitability and performance so we can identify area of opportunity, but I basically got the same response. I understand that nobody is hitting a 100% off the rip, but I’ve never had a 0% bonus with no explanations.\n\nNow the signed offer letter does state: “COMPANY has the right to change the terms and conditions of your employment with or without notice including but not limited to termination, demotion, promotion, transfer, compensation, benefits, duties and location of work.” \n\nAm I cooked? Or should I clap back?","url":"https://www.reddit.com/r/legaladvice/comments/1p646p8/surprise_no_more_bonus_pay/","permalink":"/r/legaladvice/comments/1p646p8/surprise_no_more_bonus_pay/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764048133.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63skg","name":"t3_1p63skg","subreddit":"legaladvice","author":"Playful_Plastic4680","title":"Spouse left","selftext":"We are in Texas. My fiance, or (Common Law Marriage Husband) Left Friday morning togo to Louisiana after an argument took place. We have a 2 year old together, he quit his job here in Texas (No call, No show due to his impulsivness). Im a stay at home mom. Left me with no income, took the vehicle and is refusing to bring the car seat or stroller back because \"he paid for it\", didnt even ask about our daughters medical appt today and is threatening me saying he's getting full custody. Meanwhile, he hasnt filed anything that I know of and all of our residency is in Texas and bills we share. What's the best avenue for me to take? Considering he has told me he will \"make it ugly for me\"\nLocation: Conroe Texas","url":"https://www.reddit.com/r/legaladvice/comments/1p63skg/spouse_left/","permalink":"/r/legaladvice/comments/1p63skg/spouse_left/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764046868.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63gdz","name":"t3_1p63gdz","subreddit":"legaladvice","author":"Longjumping-Play-420","title":"Filed divorce accepted on 10/16/25","selftext":"Location: Fresno, CA\nHello, I filed for divorce in October this year and documents were accepted. He was served 10/29 and I was planning on requesting a default this week because he has not responded in the 30 day window. However, when I originally filled out the forms, I filled out custody paper with the assumption that he would stay in the area. He has now moved to Texas and I want to revise the custody orders to reflect his move. Our kids are 2 & 1 and I want to protect them from having to spend time with someone who feels like a stranger to them. \nWhat is the best way to go about this? Do I file an amendment and serve him again? Do I even need to do that if he hasn’t responded? Because he hasn’t responded can I revise the custody agreement and request default? ","url":"https://www.reddit.com/r/legaladvice/comments/1p63gdz/filed_divorce_accepted_on_101625/","permalink":"/r/legaladvice/comments/1p63gdz/filed_divorce_accepted_on_101625/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764045788.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62oqx","name":"t3_1p62oqx","subreddit":"legaladvice","author":"ct-hulu","title":"Car warranty company ran my credit without my permission. Do I have any recourse?","selftext":"Location: Texas.\n\n I called  the dealership to inquire about a car warranty. They gave me this warranty companies information. I called them.  The salesperson told me how much it was going to be per month. I asked if there was a discount for paying cash ( there wasnt). I then asked them to send me the plan so I could review it. \n\nI received an email from their personal email to my personal email a few hours later. In this email, in plain text was my social security number ( i didn not provide it and have no clue how they obtained it)  and a note saying based on my credit my interest rate to finance the warranty plan would be 19% ( absolutly laughable, but not the point) \n\nI never provided them my social so I can only assume the dealership provided it to this third party and I never authorized a credit check. \n\nCurrently I have no damages but im worried about my personal data being at risk since they are willing to not even obscure it on an unsecured email. \n\nWhat do I do? ","url":"https://www.reddit.com/r/legaladvice/comments/1p62oqx/car_warranty_company_ran_my_credit_without_my/","permalink":"/r/legaladvice/comments/1p62oqx/car_warranty_company_ran_my_credit_without_my/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764043349.0,"edited":0.0,"link_flair_text":"Credit Debt Bankruptcy","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61obr","name":"t3_1p61obr","subreddit":"legaladvice","author":"CikeSicarius","title":"Company let me go but has yet to send equipment back","selftext":"Location: Pennsylvania.\n I was let go from my company and I asked them how and when should I return the laptop. They said they would send a shipping box with a label to me. I went through this process before to replace my previous laptop. So I waited and usually it's fast, around a week. But it never came and they have my address. I sent an email to my boss and no word for a week or two. It's been 2-3 weeks now so would I be in trouble if I kept the laptop for myself in the new year? I tried twice and have the receipts to prove it.\n","url":"https://www.reddit.com/r/legaladvice/comments/1p61obr/company_let_me_go_but_has_yet_to_send_equipment/","permalink":"/r/legaladvice/comments/1p61obr/company_let_me_go_but_has_yet_to_send_equipment/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764040345.0,"edited":0.0,"link_flair_text":"Employment Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61kxv","name":"t3_1p61kxv","subreddit":"legaladvice","author":"No-Motor5963","title":"Got a Notice of vehicle impoundment about the car I sold half year ago","selftext":"Location: Chicago, IL. So I sold this Honda almost half year ago, and seems like guy who bought the car from me never registered the car\n\nAnd today, I got notice of vehicle impoundment, telling me that the car I sold half year ago has been impounded by city of chicago and I currently own 400$ and it will continue increase, \n\nwhen i sold the car, I filed and mailed release of liability at the day of sale, took my license plates off, handed over signed title, but I forgot the bill of sale.\n\nI seen multiple opinions about what should I do, some says call dmv or city bureau of traffic services, and tell them car has been sold, some says its better to not make a call and just ignore it since it’s not my car anymore.\n\nmy insurance is been out of this car, and I do not have any way to contact this buyer, I’m worried about if this might get me any troubles, I would like hear any advices about what I’m supposed to do. ","url":"https://www.reddit.com/r/legaladvice/comments/1p61kxv/got_a_notice_of_vehicle_impoundment_about_the_car/","permalink":"/r/legaladvice/comments/1p61kxv/got_a_notice_of_vehicle_impoundment_about_the_car/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764040061.0,"edited":1764041669.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61f7q","name":"t3_1p61f7q","subreddit":"legaladvice","author":"endersfury1804","title":"Workmans comp","selftext":"I (21m)  Location: Florida, had a pretty bad fall at work a couple weeks ago, for context i do silicone roofing. It wasn't until my fall that my employer told me that we no longer had workman's comp, and it turns out i had a pretty bad concussion, and a herniated disc in my neck that i may need surgery for. He also tried convincing me not to get checked out by a doctor. Legally i dont really know what to do, or where to go from here. I'm dealing with a ton so i apologize for the format. ","url":"https://www.reddit.com/r/legaladvice/comments/1p61f7q/workmans_comp/","permalink":"/r/legaladvice/comments/1p61f7q/workmans_comp/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764039614.0,"edited":0.0,"link_flair_text":"Labor Law (Unions)","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u2t1","name":"t3_1p6u2t1","subreddit":"legaladvice","author":"ivyinabox","title":"Is this grounds for wrongful termination in an at-will state?","selftext":"Location: Kansas, US\n\nI'm not sure how wrongful termination is affected by at-will employment, but we live in an at-will state, and this is gonna screw us badly. \n\nMy son has a VERY important appointment with a specialist out of state tomorrow. We waited two months for this appointment, and my fiancé gave notice that he needed the day off at the beginning of those two months. He was promised the day off. But today, he texted me and said his boss told him he'll be fired if he doesn't come in tomorrow. \n\nI've already passed along a message to higher ups/HR, but they're not gonna get to the complaint in time to prevent my fiancé from losing his job. I'm a stay at home mom and full time caretaker of my son, we're screwed if he gets fired right now. Even if we have a slim chance of winning (or even starting) a case over this, I'll go for it. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6u2t1/is_this_grounds_for_wrongful_termination_in_an/","permalink":"/r/legaladvice/comments/1p6u2t1/is_this_grounds_for_wrongful_termination_in_an/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764118721.0,"edited":0.0,"link_flair_text":"Employment Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u2jo","name":"t3_1p6u2jo","subreddit":"legaladvice","author":"voodooovixxen","title":"DeCarlos Demolition totaled my car - Des Moines, IA","selftext":"Location: Des Moines, Iowa\n\nI live directly across from the Wallace building in downtown Des Moines (East Village) that is being demolished currently (demo started today). I work a 8-5 M-F, and today with the holidays coming up I decided to work from home since I do not have to work the rest of the week, I went out to my car over my lunch break to get myself and my finance some groceries so I could make lunch and this is what I come out to.\n\nNaturally I am frustrated and upset, I know my car is not nice or new but it was my grandmas and she passed away when i was about 13 so this was her gift to me which is heartbreaking. I am looking around confused to see if there is a culprit…. before I even have time to process the situation one of the construction workers comes out of the fence and tells me “it was already like that”. How would he know and why would you approach me if you had nothing to do with it? I asked if I could speak to a supervisor or have a number to call and he goes to get his boss. His boss comes out and is already extremely defensive and rude saying it wasn’t them and he was the only one driving the trailer with the machinery on it. The lines on my car matched up perfectly with his trailer, and if it was a regular car that would have hit it me it would have taken off my side mirror 100%. I knew that I was not going to get anywhere so I asked to speak to a supervisor or for another number I could call. He said that he WAS DeCarlos and he owns the company and his name is Zach DeCarlos, so if I wanted to call I would be speaking to him. I told him that I was going to file a police report and immediately after I said that he got into his trailer and drove away and did not show up again for the rest of the day. I did make a police report, but we all know how that goes without a witness or evidence. Even though there was 10+ workers right in front of my house no one saw anything… the Des Moines water work came out and parked right in front of my car earlier in the day about 9 o’clock to shut off the water to the building and I highly doubt that it was them because they were in your every day pick up trucks.\n\nI made multiple phone calls today which I did not get very far since it’s almost Thanksgiving, but I am not hopeful. My fiancé went back over to the job site at about 4 o’clock to talk to the workers again and they admitted that it was more than likely him and that he was driving equipment around our block. They also shared that it was his dad who actually owned the company and that he is a spoiled daddy’s boy who is just not a good person. I am just so disgusted with this behavior and I don’t have very high hopes for what will come out of it. I’m sure his dad will defend him. I’ve made calls to the building to try to get security footage, but I doubt that there is any because the power I’m sure has been turned off due to the demolition. I have also called the Better Business Bureau to hopefully make a complaint. I am not sure what else I can do. If anyone has any ideas or anyone else I could contact to hopefully get to the bottom of this I would really appreciate it. The damage on my car is more expensive than what my car is worth and I really would hate to have to pay for somebody else’s negligence. Very upsetting day.","url":"https://www.reddit.com/r/legaladvice/comments/1p6u2jo/decarlos_demolition_totaled_my_car_des_moines_ia/","permalink":"/r/legaladvice/comments/1p6u2jo/decarlos_demolition_totaled_my_car_des_moines_ia/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764118701.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6u12n","name":"t3_1p6u12n","subreddit":"legaladvice","author":"Diligent_Shark_420","title":"How do I get help advocating for myself when my attorney barely listens, repeats vague directions, and my abusive mother is taking me to court? (NY)","selftext":"**Location: New York**\n\nI’m dealing with a family court situation, and because I’m a DV survivor and have mental disabilities and physical limitations (I was hit by a car and had my pelvis reconstructed), getting around and advocating for myself is extremely difficult. The person who abused me is my mother (I’ll call her “Jane”), and she is taking me to court for visitation of my child. I went no-contact with Jane for safety reasons after years of emotional, physical, and financial abuse.\n\nThe problem is: my attorney is barely communicating, and when she does, it feels dismissive or confusing. I made her aware of my disabilities as well. We are already at the point where it’s my turn to speak in the next couple months. Sadly, my attorney messed up the cross-exam after I gave her all of the proof I had on hand. She didn’t bring up any of the illegal things Jane has done.\n\n**What happened with my attorney:**  \nWhen I first spoke with her, I tried to explain the years of abuse and why I went no-contact (my child was turning 10). Instead of listening, she interrupted me and argued with me over the definition of “stealing,” telling me that situations I described “might not be considered stealing legally.”\n\nI wasn’t asking for a legal label, I was trying to show a pattern of financial control and abuse.\n\nJane would take my child’s clothing and refused to return them after having him over the weekend. She even admitted in court that she would throw out his clothing. This was always an issue because I would have to spend more money (I’m already a struggling single mom) on replacements.\n\nEvery time I try to explain something important, she either:\n\n* debates the wording\n* dismisses my concern\n* gives me short, unclear instructions\n\nShe even got loud with me, saying she’s the “legal expert” and I don’t know what I’m talking about. (I will admit I got upset and told her to figure it out herself. Then, after I sent her all the proof I had, she asked me to help her open documents I sent her in zip folders. When I asked her how she normally does it, she told me her nephew helps her.)\n\n**She keeps giving me repeated directions I already followed, like:**\n\n* “Organize everything by date in chronological order.”\n* “Write short summaries explaining what happened\"( i used my mothers first testimony to go off of, and provided each piece of evidence for each part of her \"story\" that contradicts what she said in court and gives my side clearly. all of the evidence is informal in nature)\n* “Make it easy for me to understand.”\n\n**I did that exactly how she requested:**\n\n* I organized all screenshots, messages, photos, and documents into dated folders (zipped and unzipped), labeled clearly.\n* I wrote summaries\n* I even told her I have witnesses willing to talk\n\nIt took me hours to break everything down in a clear, digestible way.\n\nBut then she said things like:\n\n* “This isn’t enough.”\n* “This doesn’t tell me anything.”\n* “You didn’t organize this the way I asked.”\n* \"how does this evidence relate to the case?\". \n\nWhen I ask what’s missing, she never gives a clear answer.  \nI’ve asked things like:\n\n* “What specifically do you need?”\n* “What kind of evidence is required in this type of case?”\n* “How can I get what you’re asking for if what I gave isn’t enough?”\n\nShe doesn’t explain. She just repeats the same vague instructions.  \nI feel like I’m going in circles because I don’t understand what else she wants, and she won’t explain.\n\n**Jane has a long documented history of:**\n\n* emotional abuse\n* physical abuse (from when I was a child, and she sent me to the hospital when I was 22,when my child was 2; he’s now 12 — and I was put in a DV shelter with a restraining order against her)\n* financial abuse\n* manipulating tax filings for her benefit (she claimed me and my child even though we weren’t living with her for 4-5 years)\n* lying about me to family (I’m isolated; I even provided screenshots of conversations with my sister where she admits my mother tried to take my kid because I’m an “unfit mother” i even provided screenshots of my mothers comments about me to other family members as well, stating I'm killing him, I'm unfit, and a lot more)\n* mistreating my child (yelling, throwing out his things, mocking his interests)\n* undermining my parenting and claiming I “don’t deserve him”\n\nBut my attorney has not reviewed the evidence, even though it’s organized and labeled. She has even told me she didn’t want to go through it all 3 different times.\n\nShe takes weeks or even months to respond, and I’m terrified my side of the story will not be presented properly because she doesn’t seem to understand the urgency.\n\nI genuinely don’t know what’s normal or acceptable. I’m struggling to speak up for myself, and it feels like my attorney isn’t giving me the guidance I desperately need.\n\nAny advice is appreciated. My next date is in the first week of February. I’ll be the speaker this time; Jane already spoke, the cross-exam already happened, and my attorney messed it all up.\n\n*I have emails proving all of this as well.*\n\n# TL;DR:\n\nI’m a disabled DV survivor fighting my abusive mother (Jane) in NY family court. My attorney barely communicates, dismisses me, messed up the cross-exam, refuses to review evidence, repeats vague instructions I already followed, and has even gotten loud with me. I’ve fully organized everything, but she keeps saying it’s “not enough” without telling me what she actually needs. I’m terrified because my hearing is in February and I don’t know how to advocate for myself with an attorney who won’t guide me. \n\nAll of this has completely destabilized my mental health. Every step of this case forces me to relive things I’ve spent years trying to heal from, and without real support or guidance, I feel like I’m slipping backward into the trauma instead of moving past it. My disabilities have been overwhelmed to the point where I feel lost, alone, and like I’m being hurt all over again just for trying to defend myself.\n\nthe system that’s supposed to protect me is making me experience the abuse all over again because my abuser is using the court to get what she wants.","url":"https://www.reddit.com/r/legaladvice/comments/1p6u12n/how_do_i_get_help_advocating_for_myself_when_my/","permalink":"/r/legaladvice/comments/1p6u12n/how_do_i_get_help_advocating_for_myself_when_my/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764118584.0,"edited":0.0,"link_flair_text":"Custody Divorce and Family","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6td7i","name":"t3_1p6td7i","subreddit":"legaladvice","author":"Frustrated-752","title":"Legal action threatened over payment I have record of paying every year","selftext":"Location: NJ, USA\n\nHey. So I'm in a really weird position with this and I'm trying to figure out how to get out of it with the least amount of damage possible.\n\nIn 2021, I did an online zine with a friend. We published it on a site that came recommended by people in the space. I paid for the yearly subscription (\\~$200) out of my own pocket. We changed platforms the following year, but I didn't cancel the account so the zine would still be viewable. \n\nI was emptying out my email as I'm running out of storage and i came across two emails, one from Nov '22, one from Dec '22. The first (Nov) said I was overdue on a payment from my credit card, and my account was permanently blocked. The second (Dec) said I was temporarily blocked, as I was overdue on the payment off my credit card. I don't know if it matters that they were out of order. I missed these because it was a difficult personal time with 4 family deaths back to back. I have not received any further contact from them.\n\nThe issue is, I HAVE been paying, not off my credit card, but directly from my bank account. I have the payment history, once a year, every year on the same day, including this year. The original charge they say bounced was just $47 but I'm paying like $200 a year for a blocked account. I just don't understand. I'm in an alright enough financial place that this isn't a massive blow, but I had no idea that the zine from that year hasn't even been available to view this whole time. I would like to just shut this down. However, is emailing them about this opening a whole can of worms? Could they come after me legally? \n\n  \nFrom their 2022 email: *we would like to spare you the inconvenience of a legal procedure, but unfortunately we see ourselves forced to do so if you refuse to pay the outstanding invoice.*\n\nI tried to log into the account and it just told me to pay my invoice, but I don't have an invoice, and I have been paying. Could they charge me this payment with interest? \n\nThe only way to tackle this would be through contacting them directly. I've never done something like this and I just want to know what would be the best course of action. I'm not looking to get any money back, just stop future payments. Any help is appreciated, thank you!","url":"https://www.reddit.com/r/legaladvice/comments/1p6td7i/legal_action_threatened_over_payment_i_have/","permalink":"/r/legaladvice/comments/1p6td7i/legal_action_threatened_over_payment_i_have/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764116781.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t1ih","name":"t3_1p6t1ih","subreddit":"legaladvice","author":"mannym92","title":"At fault driver’s insurer denied my diminished value claim because my BMW is leased. Is that correct? (California)","selftext":"The other driver struck the front bumper of my 2024 BMW M3 Competition while it was legally parked and unoccupied. They accepted full responsibility and their insurer is Mercury. The front bumper had to be completely replaced and the accident now appears on the CARFAX report.\n\nThe car was custom ordered with a specification package that is known to hold value and I fully intended to buy it out at the end of the lease. BMW North America issued a written statement confirming a fifteen thousand dollar loss in market value because of the accident history. I also pulled three CARFAX listings showing identical 2024 M3 Competition models with similar mileage priced between eighty five and ninety thousand with clean histories.\n\nI submitted a diminished value claim to Mercury. They denied it because the car is leased and BMW Financial Services is the legal owner. Their position is that only the lessor can recover diminished value.\n\nI get that California limits lessees from pursuing traditional diminished value claims, but in my situation I created the value of the car through the custom order, I intended to buy it out, and I am the only person who suffers the financial loss. BMW FS will not pursue a claim because they are not harmed.\n\nAre there any alternative legal theories that apply in California for situations like this. Specifically theories like economic loss, interference with contractual expectancy, loss of value to the leasehold interest, or equitable subrogation when the titled owner is not the one who actually suffers the loss.\n\nBefore I file a civil action I want to know whether any of these theories are recognized or viable in California and whether a lessee can recover when they are the real economic victim even if the lessor holds legal title.\n\nAny advice on how to proceed would be appreciated.\n\nLocation: California","url":"https://www.reddit.com/r/legaladvice/comments/1p6t1ih/at_fault_drivers_insurer_denied_my_diminished/","permalink":"/r/legaladvice/comments/1p6t1ih/at_fault_drivers_insurer_denied_my_diminished/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764115913.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6swir","name":"t3_1p6swir","subreddit":"legaladvice","author":"Fluffy-Housing-4821","title":"NY: follow up?","selftext":"Location: New York — follow up\n\nNAL. but soon to be admitted. \n\nFamily member was sent a letter over unpaid debt from being a co-signer. It was clearly outside the SOL, so I helped them draft a reply, citing case and statutory law. \n\nI’ve never done anything like this before, obviously. \n\nMain question: \n\nShould he/ I follow up with the collection agency law firm to like… ensure they won’t sue? While the family member trusts me, he wants peace of mind that they won’t sue.\n\n\n\nOr.. do we just literally sit here and do nothing? Do these law firms still try and pester for a deal to make money in these situations? Or do they normally give up?\n\nThanks. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6swir/ny_follow_up/","permalink":"/r/legaladvice/comments/1p6swir/ny_follow_up/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764115548.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6stqk","name":"t3_1p6stqk","subreddit":"legaladvice","author":"brocksamson_osi","title":"Creditors want the debt consolidation company to contact them about missing payments, but they said they \"don't do that\"","selftext":"Location: NYC\n\nHello everyone, thank you for taking the time to read.\n\nI am a client of a debt consolidation company and am currently paying a creditor who sued me. I have been on a hiatus from the program because of unemployment (finished graduate school and the time it’s taken me to finally find a job) so I haven't made payments recently. My next payment is due in January. I received a letter from the creditors informing me of the delinquent payments and asking for the money. I called to let them know that I am on a hiatus with the program, but they refused to discuss the case with me because “the debt consolidation company is representing you”.\n\nDuring the period of court appearances, I sent documents back and forth between the creditors and the debt consolidation people, but they did not give me a lawyer. I represented myself in court. Now, the creditors are saying they can only discuss with the debt consolidation company. I called them and asked them to contact the creditors to inform them of the hiatus, but I was told that this is not something that they do.\n\nI'm at a loss here. The creditors want the debt consolidation to contact them. They said they don't do that. What should I do?\n\n*In case it matters - I want to clarify that we met multiple times in court because the appearance got rescheduled ~ 3 times. The court recommended I have a volunteer lawyer help me (there are days they sit at the court and help people who come in) but they weren't there until the 4th time I made an appearance. During that 4th time we finally sat in front of a judge to go over the situation and get a ruling.","url":"https://www.reddit.com/r/legaladvice/comments/1p6stqk/creditors_want_the_debt_consolidation_company_to/","permalink":"/r/legaladvice/comments/1p6stqk/creditors_want_the_debt_consolidation_company_to/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764115342.0,"edited":0.0,"link_flair_text":"Credit Debt Bankruptcy","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6s4q2","name":"t3_1p6s4q2","subreddit":"legaladvice","author":"Key-Employment73","title":"Texas Real Estate Legal Question","selftext":"Location: Dallas, Texas \nWe bought a home in Texas recently and found out all of the plumbing needs replacing. The seller (an executor) lied on the disclosure form (we have found evidence that he knew there was cast iron throughout). I know executors aren’t required to fill that out here in TX, but I’m wondering if there’s legal recourse considering he did fill it out inaccurately?","url":"https://www.reddit.com/r/legaladvice/comments/1p6s4q2/texas_real_estate_legal_question/","permalink":"/r/legaladvice/comments/1p6s4q2/texas_real_estate_legal_question/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764113518.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6s2j7","name":"t3_1p6s2j7","subreddit":"legaladvice","author":"HelloAxi","title":"HELP - Broken Rent agreement, Missing Money Order, 150% charge, Debt Collector after me","selftext":"Location: Washington state  \nShort summary: I left a lease agreement earlier, owed 3000 to the landlord, agreed to pay half, they claim they have no record of it or an agreement, and the middleman for the exchange has been very unhelpful (downright antagonistic).\n\n\\-  \n  \nIn 2023 I signed a lease for 12 months then I was unceremoniously let go from my job. I tried everything to sustain some income, but couldn't keep up with rent that was only a good decision with my last pay. I struggled through 10 months but I ended up completely broke and decided to vacate early to move back in with my folks and attempt to restabilize.\n\nThe last 2 months of rent went unpaid for a while, and back in April I came to an agreement with the landlord that I would pay back half of what was owed within the next 2 weeks we could call it square. They requested this in money order or cashiers check and I sell my valuables to cover it. I purchased a Western Union money order for \\~1400. I sent it off to the landlord and checked in later, but I don't remember the exact conversation. I DO know that I felt like it was behind me, and during another move, I lost the WU receipt.\n\nFast forward to late October, I get an email concerning the full amount (2800) from a debt collector. I quickly call my old landlord to see what the hell is going on and I am told that they never received the money, they have no record of it or an agreement, and the person who made this deal no longer works for the company.  \nI explain that I sent the money and I have the bank statements that show it was withdrawn, but they won't accept that as proof. They advise me to find a receipt or contact WU in hopes of retrieving a paper trail. Sounds like if I can establish a trail, they will forgive this as a clerical error.\n\nI contact WU who tells me they have no way of retrieving a record without the receipt. After some investigation I find out they DO offer an alternative method by filling out a form. I tell the rep this, who begrudgingly admits this (clearly trying to obfuscate). They inform me that I have to send this before the end of November, as they will be discontinuing the service after that. I send it off, but I am told it will take 6-8 weeks to hear back. We are probably around w7 or 8 now and I still haven't heard back. I tried to check in a few weeks ago but the call rep said this department is \"completely offline\" and that she cannot forward me, pass a message, request an update, or contact whatsoever. I'm afraid they are stalling until the service discontinues and will offer no real help.\n\nI call the landlords and inform them of the situation, they are being patient with it and still willing to withdraw the collection, but I am still being contacted by the collector. I haven't spoken with them yet, should I answer their calls? Idk what the procedure is, and I have heard such mixed advice from other's I've asked.\n\nI still cannot afford this sudden expense, especially after already sending the earlier agreed amount, and frankly, even if I could I really wouldn't want to.\n\nPlease, is there anything I can do about this?\n\nIf you need any clarifications, please ask.\n\nedit:  \nThe only record I have from the landlords on the agreement is a small exchange of text messages:\n\nThem: Hi, you can mail the money order to <address>  \n\\-person, at company\n\nme: Even if today is the last allowed day?\n\nThem: Yes, as long as it's postmarked by today\n\nme: to be clear, the amount is 1374.50, correct? From the remaining balance of 2749.00?\n\nno response from them.","url":"https://www.reddit.com/r/legaladvice/comments/1p6s2j7/help_broken_rent_agreement_missing_money_order/","permalink":"/r/legaladvice/comments/1p6s2j7/help_broken_rent_agreement_missing_money_order/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764113360.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6roat","name":"t3_1p6roat","subreddit":"legaladvice","author":"bb5055","title":"charged 1800$ in move out fees, roommate wants to take them to court but i don’t want this to go to collections.","selftext":"Location: Utah\n\nso my partner and our other three roommates moved out of our apartment over a month ago, and were hit with cleaning and repair fees totaling 1888$. a lot of it is absolutely ridiculous, and they refuse to provide us with receipts. my other roommate wants to take them to small claims, but my partner and i are in a tough situation.\n\nin a few months we’re going to need to be taking out a decent loan, and we need our credit to be as good as possible, same with our DTI. i’m concerned that if we go the small claims route, it will end up costing my partner and i more money in the long term because of the credit hit we will get when they send it to collections. should we pay off the fee before that happens and just hope for a refund in the case we win in small claims? i’ve never had to go through this process myself so im not sure what would be the correct course of action","url":"https://www.reddit.com/r/legaladvice/comments/1p6roat/charged_1800_in_move_out_fees_roommate_wants_to/","permalink":"/r/legaladvice/comments/1p6roat/charged_1800_in_move_out_fees_roommate_wants_to/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764112347.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rkdi","name":"t3_1p6rkdi","subreddit":"legaladvice","author":"abster303","title":"trying (and failing) to dispute move out charges","selftext":"location: idaho falls, idaho, us\nI moved out of an apartment last may, I was sent a list of move out charges which were, from what I could see, entirely unjust and unethical. \nI will list the charges and why I feel I should not be responsible paying them\npainting 175.72$ - in idaho it is a landlords responsibility\nreplaced blinds 70$ - I literally already did that and have my receipt\nrescreened patio door 25$ - unnecessary? no pictures provided\nremoved trash 10$ - yeah wtv\ncleaned CAR 25$ - dont know what CAR is, asked repeatedly and never received an answer.\ninterior heavy cleaning 500$ - entirely unnecessary, and under idaho law normal wear and tear is landlords responsibility, and never saw a receipt excusing this price\npet treatment carpet 135$- I paid a pet deposit that is nowhere shown..\nI tried to send them an email that a literally lawyer helped me write after receiving this bill and it was completely ignored. I actually contacted the office FOUR seperate times trying to dispute this bill, and was again ignored. it has now been sent to collections and I dont know what to do.\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6rkdi/trying_and_failing_to_dispute_move_out_charges/","permalink":"/r/legaladvice/comments/1p6rkdi/trying_and_failing_to_dispute_move_out_charges/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764112064.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rjzn","name":"t3_1p6rjzn","subreddit":"legaladvice","author":"Upstairs_Beautiful31","title":"Stolen Car - Juenille","selftext":"Location: Houston \n\nMy car was stolen and later ended up in a crash (totalled as air bags got deployed )  by a Juenille living in my neighborhood. I did not press charges as the parents and cops who arrested him recommend to resolve it between us.My insurance paid the car value but when I reached out to the parents for the GAP and Rental car expenses they are refusing to pay .I consulted legal services from my work and they recommend going to a small claims court. Honestly is that the only way or should I reach out to a lawyer and sue them.\n\nIs it worth suing  the parents after paying legal expenses or would a  lawyer be willing to work on having a share from the proceedings \n\nThanks\nJay\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6rjzn/stolen_car_juenille/","permalink":"/r/legaladvice/comments/1p6rjzn/stolen_car_juenille/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764112037.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rjyz","name":"t3_1p6rjyz","subreddit":"legaladvice","author":"Cold_Lifeguard_3112","title":"Apartment ignoring my dispute and threatening me","selftext":"Hi guys I’ve been dealing with a horrible apartment for a pretty long time now, I moved out in June and received my move out bill in July which totaled 2 thousand dollars.\n\n I disputed basically all of it because it mostly seemed excessive, such as a couch replacement and carpet replacement with no pictures or anything. Literally everything was just the listed item and the price with no pictures or receipts or anything. \n\nI emailed them the dispute which they ignored, they threatened me multiple times and I have reached out through their phone and email many times since then but they have completely ignored me other than sending threatening emails. I lived in an apartment for college students so I know this tactic must work well for them normally but I cannot just hand over that much money. I’m not sure what to do since they won’t answer me and I’m scared it’ll affect my guarantor and his credit as well.\n\nHere’s a sample of what they email me. “This letter is formal notice to you requiring immediate payment of the unpaid balance due under the terms of that certain Housing Contract (“Contract”) with start date of 07/26/2024. If payment is not properly received, legal action to enforce your obligation under the Contract may be taken. Please contact us if you have any questions or need additional information.”\n\nI don’t have anyone to talk to about this and honestly just have no idea what to do now.\n\nLocation: Tennessee ","url":"https://www.reddit.com/r/legaladvice/comments/1p6rjyz/apartment_ignoring_my_dispute_and_threatening_me/","permalink":"/r/legaladvice/comments/1p6rjyz/apartment_ignoring_my_dispute_and_threatening_me/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764112036.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6re9k","name":"t3_1p6re9k","subreddit":"legaladvice","author":"BriefAd7859","title":"North Carolina – My partner’s ex-husband manipulated their daughter into false allegations. CPS gave him temporary custody. She is breaking down mentally. How can she prepare for the Jan 20 hearing?","selftext":"My partner (female) lives in Charlotte, NC. She has one minor daughter (11–12). After the divorce, she had custody.\n\n\n\nOver the past year, her ex-husband has been manipulating the child heavily. The daughter’s behavior changed dramatically:\n\n\n\n* Running away from home\n* Accusing her mother of things that never happened\n* Claiming she is in “life-threatening danger”\n* Converting religion because her father told her to\n* Repeating phrases that clearly come from her father\n* Recently accusing my partner of physical assault — which is entirely false\n\n\n\n\n\nHer ex refused to provide WhatsApp messages that the judge previously requested. There were no consequences.\n\n\n\nCPS visited my partner’s home recently but did not inspect all rooms. We later learned the worker had already made the temporary custody decision before the visit. The child was placed with the father until the **January 20, 2026** hearing.\n\n\n\nHer lawyer already received a large retainer but is not giving her clear guidance. She cannot afford to replace him.\n\n\n\nNow the biggest issue:\n\n\n\n\n\n# My partner is mentally breaking down.\n\n\n\n\n\nShe cries every day — at home, at work, at night.\n\nShe can’t sleep, eats very little, and is terrified she is losing her daughter forever based on lies.\n\nShe constantly asks me, “Am I losing my mind? Am I really hearing and seeing this correctly?”\n\nI’m genuinely worried about her mental and emotional state.\n\n\n\nWe’re trying to help her prepare properly even though her attorney is not guiding her.\n\n\n\nWe need advice on:\n\n\n\n1. What exact evidence she should bring to the Jan 20 hearing\n2. Whether she can request a CPS **supervisor review**\n3. How to build a proper timeline for the judge\n4. What is legally relevant regarding manipulation/coaching by the father\n5. How she can communicate with her attorney in writing to force clearer guidance\n6. Whether false allegations + CPS involvement follow a standard process in NC\n7. Any steps she can take to stabilize her situation before court\n\n\n\n\n\nWe are not asking for full legal strategy, just what steps are legally appropriate in NC and how she can prepare responsibly.\n\n\n\nAny guidance would help. Thank you.\n\nLocation: Charlotte,NC","url":"https://www.reddit.com/r/legaladvice/comments/1p6re9k/north_carolina_my_partners_exhusband_manipulated/","permalink":"/r/legaladvice/comments/1p6re9k/north_carolina_my_partners_exhusband_manipulated/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764111642.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rb5o","name":"t3_1p6rb5o","subreddit":"legaladvice","author":"alfaqugud","title":"Personal injury","selftext":"Location: California   \n  \nSituation: Almost one year ago I went to get what was supposed to be an upscale haircut for my graduation. The barber gave me a nasty cut with the blade and proceeded to violate regulation by using his finger to put globs of powder and Vaseline to stop the bleeding without even saying anything to me. When I called him out on it, he began to act like he had no idea how that cut could have happened and insinuated maybe I had acne or an old scar that opened up (which I did not). The guy finishes the haircut and charges me full price. Needles to say I was not happy and posted the pictures and story on their yelp. Owner replied with this and gave me a refund, but no receipt:\n\n\"Brother I want you to hear me for a little bit you are hundred percent right the guy who gave you the haircut was a new guy and was under testing and he got fired I'm offering to give you back what you paid for the haircut and I'm giving you another haircut and free facial from our team and I'm 100% sure you will love it. Give us a chance please and again, please accept our apologies from all the team because we really have a great barbers. Please contact us.\"\n\nThis sub doesn't allow pictures. But the scar is about 1 inch under the cheekbone. Would like to get it treated by a dermatologist.\n\nLegal questions: Would it be petty or frivolous of me to pursue? Should I consult with a personal injury lawyer only? Is there a statue of limitations in California? Is this type of injury considered an assumed risk when getting a haircut with a blade? I'm not familiar with barber regulations, but should a barber in training be shadowed by an expirienced barber? (this was not the case in this situation)\n\nThank you","url":"https://www.reddit.com/r/legaladvice/comments/1p6rb5o/personal_injury/","permalink":"/r/legaladvice/comments/1p6rb5o/personal_injury/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764111426.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6r6rb","name":"t3_1p6r6rb","subreddit":"legaladvice","author":"jimmyb27772","title":"Charged with domestic assault 5 years after probation for the same charge. Massachusetts","selftext":"Location: Massachusetts\nHi I was wondering what someone could possibly be looking at for punishment for a 2nd domestic violence charge. My significant other got probation 5 years ago for basically the same charge and now has court in January for the same thing, anyone have rough ideas of what she could be looking at? Is there a possibility of it getting dismissed still? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6r6rb/charged_with_domestic_assault_5_years_after/","permalink":"/r/legaladvice/comments/1p6r6rb/charged_with_domestic_assault_5_years_after/","score":1,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764111118.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qr0k","name":"t3_1p6qr0k","subreddit":"legaladvice","author":"Necessary_Ad3348","title":"Company doesnt want to give back pay, what are my options","selftext":"Location: New York\n\nI am a supervisor in NY. I was brought in for my yearly raise and told I was being bumped to the new (2026) exempt minimum wage. This was mid October.\n\nIt made me curious and with a little research I discovered I wasnt even making the 2025 minimum wage. I was never bumped up.\n\nI was assured I would be immediately bumped up and they would work out the amount I was owed from the ~9 months of being underpaid. \n\nI follow up as its been about a month and still no sign of back pay. I am then told they dont want to give me back pay.\n\nObviously frustrated, I press them and the explanation is the powers above them say with bonuses I already hit the minimum wage. \n\nFor context these bonuses come from a customer of ours. We do weekends or overtime and get an \"incentive bonus.\" Its a very lucky way to make some extra money, especially being salaried. \n\nThese bonuses are billed back to said customer. My company doesnt lose a dollar to these. \n\nThey come through as \"Sales\" on my pay stub. I would think that by law my base salary needs to be at the minimum wage and am owed any pay that was missed because of their blunder (regardless of bonus pay)\n\nLuckily my management at my branch are going to find a way to make good on their promise without going through the more corporate avenue but Im obviously still frustrated\n\nIm totally open to being mistaken about this but would love any advice or tips from someone knowledgeable or who has been in a similar situation. Thanks!","url":"https://www.reddit.com/r/legaladvice/comments/1p6qr0k/company_doesnt_want_to_give_back_pay_what_are_my/","permalink":"/r/legaladvice/comments/1p6qr0k/company_doesnt_want_to_give_back_pay_what_are_my/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764110030.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qfw6","name":"t3_1p6qfw6","subreddit":"legaladvice","author":"f-your-insides","title":"Private party vehicle bill of sale question","selftext":"Location: Georgia, USA\n\nSo I recently purchased a car from a lady, she’s the neighbor of a friend, and she agreed to let me finance the car. We both signed the bill of sale gave me the title and said to put it in my name. But on the bill of sale it states that “ I the seller (her name) have received the full amount of $5,000 for the sale of this vehicle” and mentions nothing of the vehicle being financed or any payments other than the sum of $5,000\n\nMy question is, I am two months behind on payments due to unemployment but I recently started working and I have been keeping her updated on the issue. Now she is demanding money by Friday or I return the car. Can she legally take the car away? I’m not trying to screw her over I’m going to pay for it but I can’t afford to lose this car right now.","url":"https://www.reddit.com/r/legaladvice/comments/1p6qfw6/private_party_vehicle_bill_of_sale_question/","permalink":"/r/legaladvice/comments/1p6qfw6/private_party_vehicle_bill_of_sale_question/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764109282.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pzu6","name":"t3_1p6pzu6","subreddit":"legaladvice","author":"spanishvampire","title":"Does addendum from previous lease carry over to lease renewal if not mentioned, new ownership?","selftext":"Location: Florida  \n  \nI am moving out of my current apartment, where I’ve lived since 2021. I was young and dumb and signed a “Washer/Dryer Addendum” without fully understanding what it meant. I rent through a rental management company, and the property was owned by an LLC at the time of signing the initial lease. \n\nThe addendum said: “The washer and dryer at the property \"--\" will remain at the property for the tenants during the duration of the lease agreement. The owner is not liable or responsible for any cost associated with the washer and dryer to include maintenance, replacements and repairs. Should there be any fees regarding the washer and dryer, the tenants will be responsible. The owner will not replace the washer and dryer if either machine breaks.”\n\nOf course, the washer and dryer were old and broke a little over a year after moving in. I bought another washer/dryer set off a family friend and replaced the old set, which worked for a couple years. (Yes, this means I got rid of the old set. I understand that may have been a bad move.) Recently the replacement washer/dryer have both broken as well, with the washer door falling off its hinge and the dryer not heating up.\n\nMy initial lease agreement does not list the washer and dryer as an appliance, they are only mentioned in the addendum. In fact, the only time any appliances are mentioned is in this statement: “Tenant shall be fully responsible for, and agrees to maintain and repair at Tenant’s expense, the following: A/C Filters, Garbage Disposal, Locks/Keys, Smoke Alarm Batteries, Screens, Extermination Interior, Extermination Exterior and Ice Maker Dispenser”\n\n(I do not and have never had an ice maker dispenser in the apartment, so this seems to be more of a general statement rather than a list of current appliances?)\n\nI was informed right before my first lease renewal that the property had new ownership, a couple. Looking at my lease renewal following the change in ownership, I see \"All terms, conditions, and provisions of said Lease Agreement are hereby incorporated by reference or by attachment\".   \n  \nThe washer/dryer addendum is not mentioned in any of my three renewals, but other addendums were added on (one regarding the septic tank, one about renter's insurance, and another about property visits). Following the first renewal, the three new addendums just mentioned were attached to the lease agreement. The washer/dryer addendum is only on that initial lease.\n\nObviously, I know very little when it comes to the legal side of things or I wouldn't be here. However, would they not have had to reference that addendum by name for it to be added onto the lease renewal? Do the terms of the initial washer/dryer addendum still apply? \n\nWhat I really want to know is do I still hold responsibility over the washer and dryer/should I expect to have the cost to fix/replace them to come out of my security deposit? TIYA","url":"https://www.reddit.com/r/legaladvice/comments/1p6pzu6/does_addendum_from_previous_lease_carry_over_to/","permalink":"/r/legaladvice/comments/1p6pzu6/does_addendum_from_previous_lease_carry_over_to/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764108221.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ppyn","name":"t3_1p6ppyn","subreddit":"legaladvice","author":"catd1928","title":"Any chance with small claims court?","selftext":"Location: Washington DC  \nMy (27F) ex (43M) was using my car while I was out of the country and received a traffic camera ticket. While we were still together, he tried to adjudicate it and was unsuccessful. After our breakup, over the multiple emails he said he would \"figure it \\[the ticket\\] out\". A couple weeks ago, I ended up paying for the ticket because we are currently no contact. I requested the money from him on Venmo and he did not pay me, and told one of our mutual friends that he has no plans to pay me back for it. \n\nWith the emails as a quasi-promissory note, do I have any chance of getting money from him in small claims court? The request for relief would be the value of the ticket and the cost of filing the suit. \n\nI plan to Venmo request him again, citing the emails and saying that if he doesn't pay me, I will take him to small claims court but I don't want to do that if there's no chance or if I'd just get laughed out of the room. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6ppyn/any_chance_with_small_claims_court/","permalink":"/r/legaladvice/comments/1p6ppyn/any_chance_with_small_claims_court/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764107600.0,"edited":0.0,"link_flair_text":"Small Claims Procedure","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pnsc","name":"t3_1p6pnsc","subreddit":"legaladvice","author":"Minisquirrelturds","title":"(Atlanta, GA) Looking for direction on filing an injunction over a property dispute regarding immediate threat of property destruction.","selftext":"Location: Atlanta. New property owner next door is threatening to forcibly remove my fence which is on their property by 3 inches. We both have surveys, and the property line is disputed. We are unwilling to remove our fence unless there is a court judgement declaring the property line, and have sent them certified mail addressing the matter. We received a letter yesterday stating that they will forcibly remove it Friday. I tried filing a TPO today, but was unable to as they have not physically harmed me or threatened bodily injury. I believe the next steps are filing a court injunction, but am seeking direction on which type to file. I’ve reached out to attorney and retain his services, but haven’t received a response, and with the holiday, complicates this short timeline. Any advice and direction would be greatly appreciated. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6pnsc/atlanta_ga_looking_for_direction_on_filing_an/","permalink":"/r/legaladvice/comments/1p6pnsc/atlanta_ga_looking_for_direction_on_filing_an/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764107457.0,"edited":0.0,"link_flair_text":"Real Estate law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pcif","name":"t3_1p6pcif","subreddit":"legaladvice","author":"LevelReality1405","title":"Does anyone know anything about this","selftext":"I got home and i saw this cracker thing inside my mailbox that i never use because we have a communal mailbox. I live in a condo and the mailbox is right next to my front door on the wall not on a stick in my front yard. I saw movies when i was younger of criminals putting cookies under door mats to see if the person was home before robbing the place. Is that what this is because i dont have a doormat? If anyone knows anything about this being a criminal scheme or what you think it is please let me know.\n\nLocation: canada ","url":"https://www.reddit.com/r/legaladvice/comments/1p6pcif/does_anyone_know_anything_about_this/","permalink":"/r/legaladvice/comments/1p6pcif/does_anyone_know_anything_about_this/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764106708.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pa1w","name":"t3_1p6pa1w","subreddit":"legaladvice","author":"megamaster87","title":"Student loan servicer sent my statements to wrong person/address (NC, USA)","selftext":"Location: NC, USA\n\nMy Father and I are estranged, because..reasons. communication between us is as minimal as possible. \nWe have the same name, but I have never resided at his address, and have not even resided in his state since I was in elementary school. \n\nMy two student loans were transfered from College Foundation of North Carolina to Nelnet near the end of last year. I had filed an IBR and heard nothing from them after it was accepted. Sometime in the interim it moved again to Sloan Servicing. I do not know where in the process the address got changed, or why.\n\nI recently received contact from my father's partner that he had been receiving and filing them without opening, believing them to be his own loan statements, until he opened one recently and saw that it was mine.\n\nThey are sending me the ones that were sent to them, but I have not yet received them to see what info was given in the statement, and have never actually received a statement from this servicer.\n\nI have updated the address and informed Sloan of the breach, to hopefully prevent it from continuing.\n\nWhat other agencies should I be reporting this to?\n\nAre there any penalties or restitution I can seek for any of this?\n\nIf so, is this something an attorney may take on contingency or pro-bono? I am disabled and have very limited, fixed income.","url":"https://www.reddit.com/r/legaladvice/comments/1p6pa1w/student_loan_servicer_sent_my_statements_to_wrong/","permalink":"/r/legaladvice/comments/1p6pa1w/student_loan_servicer_sent_my_statements_to_wrong/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764106553.0,"edited":0.0,"link_flair_text":"Consumer Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p8c4","name":"t3_1p6p8c4","subreddit":"legaladvice","author":"HalfCrazed","title":"Business Loan Brokers selling/sharing my non-consented data resulting in loan companies harassing me and my wife trying to sell us business loans; What are my options?","selftext":"Location: New Hampshire\n\nEarlier this year (around February), I applied for a business loan with a couple of reputable lenders. I didn’t take any of the offers, and moved on. I eventually sold and exited that business in July.\n\nAbout a month after that original application, the floodgates opened. I started getting nonstop calls and texts from “direct lenders,” “business loan specialists,” and random financing companies claiming I requested info. I absolutely did *not* consent to any of this. Every time I ask where they got my info, they insist “you submitted an application with us,” which is simply untrue.\n\nIt’s escalated to the point where I’ve received **hundreds** of calls and texts — so many that it disrupts my ability to use my phone normally. Some of them have even started calling my wife, which makes me think someone is scraping public info or doing deep Google searches. I’m registered on the Do Not Call list, and I’ve submitted complaints, but nothing has changed.\n\nI’ve reached out to a few local law firms, but they’ve told me they’re too busy to take new cases.\n\nI’ve had this phone number for 18+ years and really don’t want to change it.\n\n**What are my options here?**  \nHow do I find an attorney who will actually dig into which data broker or lender is selling my info and pursue a lawsuit if necessary? From what I can tell, this could fall under TCPA violations, intrusion upon seclusion, and negligence — but I can’t get anyone to take the case.\n\nLooking for any guidance on next steps","url":"https://www.reddit.com/r/legaladvice/comments/1p6p8c4/business_loan_brokers_sellingsharing_my/","permalink":"/r/legaladvice/comments/1p6p8c4/business_loan_brokers_sellingsharing_my/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764106439.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p4yi","name":"t3_1p6p4yi","subreddit":"legaladvice","author":"kernelsanders0","title":"Paid attorney won’t communicate and my court date is in a week — need advice","selftext":"I’m facing two felony charges in Ohio across the country from where I live now. I hired a private attorney earlier this month, and ever since paying her, communication has basically stopped she has not called me a single time.\n\nThe only real thing she has done is get my warrant temporarily lifted so I’m able to travel if I need to. But I’ve been asking her for weeks whether I can appear remotely for my upcoming hearing. Every time, she just says she “needs to ask the prosecutor,” and that’s been the same response for weeks with no follow-up. My court date is now one week away.\n\nI’ve contacted her through the client portal, called her office, and texted her personal phone (which she told me I could use), and I still haven’t gotten any clear answer or update.\n\nOn top of that, it’s Thanksgiving weekend, flights are extremely expensive, and if I do have to travel, I need to notify my job as soon as possible. I’m stuck in limbo because my own attorney won’t communicate. I’d feel better if she just told me I have to appear in person but she won’t even tell me that she just scheduled an “event” in her online portal with no location. I also contacted the court and they told me I have to ask her.\n\nIs this normal? What can I do this close to a hearing when my attorney won’t tell me whether I need to appear in person or not? Any advice on dealing with an unresponsive paid attorney would be greatly appreciated.\n\nlocation: Ohio\n","url":"https://www.reddit.com/r/legaladvice/comments/1p6p4yi/paid_attorney_wont_communicate_and_my_court_date/","permalink":"/r/legaladvice/comments/1p6p4yi/paid_attorney_wont_communicate_and_my_court_date/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764106218.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6oopv","name":"t3_1p6oopv","subreddit":"legaladvice","author":"anniepants11209","title":"Pennsylvania Real Estate- Seller refusing to sign termination of sale and return deposit","selftext":"Location: Pennsylvania \n\nA situation is brewing on a single family home purchase my husband and I decided to terminate.\nMajor things were found on inspection (mold, broken HVAC, C of O township violations, etc). We also have proof seller had prior knowledge on some issues not on disclosure. \nOur offer contract states we can walk on an any unsatisfactory findings during inspection within 10 days. We sent written notice to the realtor (who is doing dual agency) that we're backing out based on inspection findings on day 3 of the inspection contingency.\nShe FLIPPED out ( never doing dual agency again...she was not on our side). She says seller was willing to do SOME repairs with limits on who contractors were, etc....no credit or price reduction on the table. It was going to turn into a shit show so we declined... again the contingency says we can walk.\n\nWe've signed the sale termination and STILL waiting on sellers to sign. The property is back on the MLS and now realtor is ghosting us.\nWhat are the next steps we should pursue? Our deposit is $10k.\nThe contracts are PA RE contracts with no special clauses, etc. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6oopv/pennsylvania_real_estate_seller_refusing_to_sign/","permalink":"/r/legaladvice/comments/1p6oopv/pennsylvania_real_estate_seller_refusing_to_sign/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764105171.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o02q","name":"t3_1p6o02q","subreddit":"legaladvice","author":"Mediocre-Grocery-796","title":"How to choose between 2 lawyers?","selftext":"Location: Texas \nMy wife was recently charged with leaving the scene of an accident with vehicle damage >$200. She drove 1 mile before stopping. It's a long story but she was just trying to find a safe place to stop and over compensated. \n\nThe first is a larger firm and we spoke to an assistant,  I think. Very patient and listened to every detail. Explained options in depth. But seems like they can be rough when they need to be. \n\nThe second lawyer we spoke to the lawyer directly. Very direct and kind of aggressive. Played devil's advocate. Stopped me mid-sentence and said \"that's a bad defense. I don't want to hear that. How about something simple?\" \n\nBoth have excellent reviews. Not sure at all how to choose. Both highly doubt jail time due to wife's lack of record and medical conditions. L1 costs about 3.5k and L2 costs about 5k. Any insights?\n\nUpdate: I was wrong when I said that the first person we spoke to was an assistant. They were a lawyer. I guess I just assumed anyone who listened that long and patiently to us would be an assistant and not a lawyer. ","url":"https://www.reddit.com/r/legaladvice/comments/1p6o02q/how_to_choose_between_2_lawyers/","permalink":"/r/legaladvice/comments/1p6o02q/how_to_choose_between_2_lawyers/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764103625.0,"edited":1764107662.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nvcl","name":"t3_1p6nvcl","subreddit":"legaladvice","author":"ClashWildFang12","title":"How do I get a new deed?","selftext":"My dad died in 2021. My aunt is a lawyer and told me I didn’t have to worry about changing over the property to my name. \nWell, now it’s 2025 and I’m freaking out over what I actually need to do (my aunt is having medical issues and can’t help). \nMy dad had a will naming me as sole beneficiary. Problem is I can’t find the will. I live in his house and have since before he passed. Bills are in my name. Do I need to get the deed changed? If so, how do I go about it?\nThanks in advance!\nLocation: Alabama","url":"https://www.reddit.com/r/legaladvice/comments/1p6nvcl/how_do_i_get_a_new_deed/","permalink":"/r/legaladvice/comments/1p6nvcl/how_do_i_get_a_new_deed/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764103336.0,"edited":0.0,"link_flair_text":"Wills Trusts and Estates","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nm9z","name":"t3_1p6nm9z","subreddit":"legaladvice","author":"Traditional-Ask69","title":"Need advice: debt collector gave me weird info about a supposed bank garnishment?","selftext":"I called one of my debt collectors today hoping to renegotiate my monthly payments. My original agreement was $136/month, although I’ve usually paid around $140. The company recently changed names/ownership, I’m not sure if it’s relevant. But it feels like there’s some confusion and disorganization within the company…. Or I was just offered major grace?\n\nThe guy on the phone told me I was “supposed to be” paying $180/month. I pulled up my bank statements and showed that wasn’t true — the only time I ever paid $180 was one single payment. Everything else has been $140 including my initial payment which was made over the phone the day I “signed up.”\n\nThen he said they issued a garnishment to my bank back in July. I asked what that meant, what I needed to do, and how to fix it since I am willing to pay and I’ve never disputed that the debt is mine. He couldn’t give me an answer.\n\nI asked why it had been months with no response from my bank. He asked if I ever banked with a specific bank (a bank I’ve never used in my life). I told him no. He replied, “Then that’s why we’ve never heard back from them,” and told me “Ma’am, just send in the $75 payments every month.” Before promptly telling me to have a good day and hanging up.\n\nThe whole tone felt like he already knew the garnishment was sent to a bank I’ve ever had… which makes this even weirder. Maybe it wasn’t sent at all?\n\nHas anyone dealt with something like this? Is this normal or a red flag? What should I do next?\n\nThanks in advance,\n\n27F trying to get her life back on track after major economical hit 2 yrs ago.\n\nLocation: Louisiana","url":"https://www.reddit.com/r/legaladvice/comments/1p6nm9z/need_advice_debt_collector_gave_me_weird_info/","permalink":"/r/legaladvice/comments/1p6nm9z/need_advice_debt_collector_gave_me_weird_info/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764102762.0,"edited":0.0,"link_flair_text":"Credit Debt Bankruptcy","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nkrm","name":"t3_1p6nkrm","subreddit":"legaladvice","author":"broseph-110","title":"Closing a Joint Account","selftext":"Location: California\n My soon to be foreign ex-wife is holding onto the joint account and won't let me close it. \n\nI just submitted the final judgement documentation for divorce (she has been very uncooperative only submitting an fl120) once the divorce is finalized I would like to close out that checking account and send her all the funds that are inside. \n\nShe has moved back to her home country and insisted that she will withdraw the money after the divorce is finalized in her home country. Based on all of her current cooperation I would like to close out the account and have the bank mail her a cashier's check. Is there anything she can do against me legally?\n\n(She also wants me to file her taxes for her but that's just another thing she's trying to make me do for her. She has asked me to take care of everything regarding to finances for her. There is nothing in the divorce paperwork about this, just an email of her asking and me saying I'll take care of it. Though the more she harasses me to do things for her the less I want to comply. She trying to hold \"my word\" over my head and says I'll face legal responsibilities if I don't comply)","url":"https://www.reddit.com/r/legaladvice/comments/1p6nkrm/closing_a_joint_account/","permalink":"/r/legaladvice/comments/1p6nkrm/closing_a_joint_account/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764102664.0,"edited":1764103343.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nk9r","name":"t3_1p6nk9r","subreddit":"legaladvice","author":"no-known-unknowns","title":"How to sue for family heirlooms","selftext":"Location: Texas (SMALL town) \nMy dad has been a victim of abuse in Texas. He is attempting to leave his wife but she has claimed he hit her and got a protective order. She is now being vindictive and hateful. He has been evicted from the home. He went to retrieve his items and she left him only a few things outside of little value. \n\nHow can I retrieve my personal effects from their home? She is holding or possibly may have tried to sell several heirlooms from my great grandparents that are mine that my dad was storing at the house. I want my items because my mom is deceased and in the house are some of the only things I have left of her. She has my baby blankets and photos of me as a little kid. What kind of lawyer do I need to reach out to for this kind of case? Do I even have any options? Can I sue her for theft of these items and if so, what kind of proof would I need?\n\nI haven’t attempted to reach out to her directly as I’m worried it will make my dad’s case worse but is this an option? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6nk9r/how_to_sue_for_family_heirlooms/","permalink":"/r/legaladvice/comments/1p6nk9r/how_to_sue_for_family_heirlooms/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764102634.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ni5g","name":"t3_1p6ni5g","subreddit":"legaladvice","author":"Longjumping-Dirt-396","title":"Car accident liability and coverage","selftext":"I got into a car accident on Friday, November 14. I was driving on the express lane. The other driver crossed a double white line and came into my express lane. I was not able to stop in time so we crashed into each other or I crashed into him I was not deemed that fault. I was not given any citations. The other driver was given two citations crossing a double white line and improper lane change. I just found out that he is not a listed driver on the involved car. Insurance..\n\nI live in Georgia I have GEICO. The other driver has Giorgio. Farm Bureau will his policy still cover both Driver and policyholder share the same address according to the police report they have the same last name. he is simply just not listed as a driver on the policy. Do I have a civil case? My truck is worth $86,000 they only have a $50,000 policy limit.\n\nWhat can I do to make sure he or his insurance pays for the damages and cover my truck? \n\n\nLocation: Dekalb county Georgia. \n","url":"https://www.reddit.com/r/legaladvice/comments/1p6ni5g/car_accident_liability_and_coverage/","permalink":"/r/legaladvice/comments/1p6ni5g/car_accident_liability_and_coverage/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764102497.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ncmb","name":"t3_1p6ncmb","subreddit":"legaladvice","author":"Babyhands3","title":"Stalker potentially being released from guardianship next year, how do I proceed with my safety in mind?","selftext":"I’m a 30/F & “Chad” is 25/M\n\nI’m not sure if I should provide a trigger warning so I just labeled it NSFW. \n\nLocation: Wisconsin & Indiana \n\nGood afternoon!  I live in Wisconsin, and the individual Chad  who stalked and harassed me lives in Indiana. Chad is legally considered an incapacitated adult and has been under a guardianship for several years. Two weeks ago, Chads parents filed to have him released from that guardianship, and the hearing is scheduled for February 2026. I’m trying to understand my options moving forward, especially regarding my safety and whether the legal barriers that protected him up to this point will still apply if the guardianship is lifted.\n\nStarting in late 2023, I politely rejected Chad on a streaming app. After that, he began fixating on me and escalated very quickly. Using information from my linked Instagram account, he manipulated one of my followers into giving him my phone number by pretending to be a family member. Chad then began spoof-calling me using my family members’ phone numbers, along with a continuous stream of harassment across multiple social media platforms.\nOver the following nine months, he did all of the following (plus way more) on a near-daily basis:\nHarassed multiple friends, acquaintances, and relatives, Made sexual, explicit, and highly inappropriate statements about my minor family members, Mocked and taunted me about my brother’s death only three days after he passed away, Created Instagram accounts impersonating my dog, Created social media accounts using photos of me from when I was a minor, Posted my home address (thousands of times) across several platforms, including sites known for harassment, Made false claims that I was inappropriate with my dog, Spread rumors accusing me of inappropriate behavior involving minor family members, Threatened to shoot me, Threatened to burn down my house with me and my family inside, Swatted my home multiple times, prompting police involvement\n\n\nThe situation reached the point where Indiana police seized all of his devices. During their forensic examination, they found that he had searched my name and variations of it over 900+ times. However, despite the volume of evidence, the threats, and the swatting, I have repeatedly been told by law enforcement that they cannot pursue charges because he is under guardianship. The Indiana detective assigned to my case has said the DA there refuses to charge him because doing so would require them to cover hotel, travel, and food for me as the victim/witness. My local Wisconsin DA has declined to pursue the false reports and misuse of emergency services, even though police resources were used here. The FBI has been involved and has even met with him in person to warn him, but they’ve stated they do not have an attorney willing to take the case.\n\n\nHis parents have essentially disengaged. They move him between their home and his brother’s home, allow him internet access, and have expressed that they “don’t have time” to deal with his behavior. Despite their lack of supervision and despite law enforcement involvement, the harassment continued until he eventually lost access to devices. Now that his parents are filing to remove the guardianship, I’m deeply worried about what happens next, especially if he is granted legal independence and regains unrestricted access to technology.\n\nMy questions:\nIs it appropriate, allowed, or advisable for me to send a letter to the judge overseeing the guardianship hearing to express concerns about my safety and provide documentation or a summary of what happened?\n2. If the guardianship is removed and he becomes legally responsible for his own actions, can charges still be filed for the things he did while he was under guardianship, or does his incapacitated status permanently shield him from prosecution for those past acts?\n\n\nAny guidance on how to navigate this, what my options are, and how I can protect myself going forward would be appreciated.\nThank you.\n\nEdit: fixed a spelling error \n","url":"https://www.reddit.com/r/legaladvice/comments/1p6ncmb/stalker_potentially_being_released_from/","permalink":"/r/legaladvice/comments/1p6ncmb/stalker_potentially_being_released_from/","score":1,"num_comments":0,"over_18":true,"stickied":false,"created_utc":1764102152.0,"edited":0.0,"link_flair_text":"Criminal Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6n8ah","name":"t3_1p6n8ah","subreddit":"legaladvice","author":"murky_umbrella","title":"(CHI, IL) Power has been out for 30+ hours","selftext":"Location: Chicago, Illinois. \n\nAs I write this, our apartment has been without power since 10am yesterday. It's 2:15PM right now. \n\nLandlord claims it's the power company. Power company (ComEd) assures us its a building issue and will not help us. Landlord has not followed up or helped us in any sort of way. All of our food is now in varying stages of \"gone bad\". \n\nLegally, what can I do to force his hand and get him to do his job? I've sent an email to his leasing company, but who knows if I'll get an answer. I intend to visit an alderman after 4 today, but I'm honestly not sure what to even say. Thanks in advance, I'm new to having an apartment and unbelievably stressed with the holiday coming up.","url":"https://www.reddit.com/r/legaladvice/comments/1p6n8ah/chi_il_power_has_been_out_for_30_hours/","permalink":"/r/legaladvice/comments/1p6n8ah/chi_il_power_has_been_out_for_30_hours/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764101880.0,"edited":0.0,"link_flair_text":"Landlord Tenant Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6n4we","name":"t3_1p6n4we","subreddit":"legaladvice","author":"ShNiE","title":"Car Accident Questions","selftext":"Hello,\n\nLocation: MA\n\nRecently got into an accident in MA, other party was from NH. Insurance deems other party is at fault, so does the police report (more or less). Issue is, other party doesn't have insurance. I have all of the other parties info, except for their phone number. \n\nHere's where it gets a little more tricky: the car I was driving is not mine. the car's insurance was registered under a car rental service, which I am not listed under. I submitted the claim to my insurance and they cannot find any insurance information for the car driver or the owner. My insurance is trying to get into contact with them (I dont have their number, neither does my insurance) to have them pay for the damages. \n\nQuestions:\n\nCan my insurance get their contact info from the dmv/rmv? If not, is there any way I/my insurance can?\n\nNH drivers are not required to have car insurance. the accident occurred in MA, what does this mean? What do I do?\n\nAny way I can just have my insurance pay for the damages and leave it up to them to find the other party?\n\nWhat if my insurance refuses to pay bc the car is not under my insurance and is under the car rentals insurance, what should I do?\n\nPlease lmk if any additional info is required.\n\nThank you all.","url":"https://www.reddit.com/r/legaladvice/comments/1p6n4we/car_accident_questions/","permalink":"/r/legaladvice/comments/1p6n4we/car_accident_questions/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764101658.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mzw3","name":"t3_1p6mzw3","subreddit":"legaladvice","author":"Greedy_Box2805","title":"Car sale","selftext":"\nA couple of weeks ago, I sold a used car in a private sale. There was no formal contract, just cash and the plan to break it up into payments, and I was upfront about the condition. On the way to look at the car, the buyer broke down on the side of the road so we went to go help jump them, well, their car was fucked so they planned to take our car to drive home. The buyer and her dad looked at the car, accepted it, and drove off with it. She even texted me afterward saying the first drive was good.\n\nI didn’t hear anything from her for two weeks (also was trying to get ahold of her for payments with no response). \n\nToday she texted me saying the car is unsafe, has stains, scratched windows, a broken tailpipe (which on the photos I took before selling the car the tailpipe was still there), needs shocks, and that the mileage display is weird( again was in the photos I sent her before she was even on her way to pick up the car). She’s claiming there are “a lot more things wrong” that supposedly weren’t mentioned. Some of the issues she listed are normal wear and tear, and some are things that weren’t present when the car left my hands. She also said she hasn’t driven it since because it “almost blew up” the one time she tried, but again, I was never told any of this until now.\n\nShe’s now asking for her money back. I told her no because:\n• It was a private “as-is” sale\n• She inspected the car and accepted it\n• She drove away in it with no complaints\n• Two weeks passed before she said anything\n• I didn’t misrepresent or hide anything\n• I don’t know what happened to the car after she left with it\n\nNow her dad wants to talk to me about “getting the money back.” I told them they’re welcome to take the title and resell it themselves, but I can’t refund it.\n\nMy question is: Do they have any legal standing in small claims court to force a refund, given this was a private as-is sale and they waited two weeks to complain?\n\nI still have the title, and I’m not sure if that changes anything.\n\nLocation: Indiana","url":"https://www.reddit.com/r/legaladvice/comments/1p6mzw3/car_sale/","permalink":"/r/legaladvice/comments/1p6mzw3/car_sale/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764101338.0,"edited":0.0,"link_flair_text":"Small Claims Procedure","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mupr","name":"t3_1p6mupr","subreddit":"legaladvice","author":"DrunkenAlocasia","title":"Premises liability?","selftext":"Location: Upstate New York\n\nAbout a month ago I was leaving a local pizza shop carrying an X-Large pie and wings on top. I pushed the door open and stepped through and must have taken a second to steady myself as the door closed behind me. Without me realizing that the door had only partially closed behind me I took my next step and my heel got caught between the door and the pavement and when I took that next step, (my heel raised up in a natural stepping motion) and something on the bottom of the door sliced straight down into my heel. Since then it’s been total hell. I had 10 stitches that night at the hospital which ended up staying in for 19 days. I have had 6 follow up appointments in the last 3 weeks because the wound won’t heal and I’m having numbness and lots of pain. When they finally took the stitches out at 19 days they did so knowing it wasn’t healed but also knowing stitches can only stay in so long. X-rays, mri, walking boot and crutches. I’ve missed several days of work and every single day is a struggle to just get around. \n\nAll that to say, it just hasn’t been easy. And of course everyone watching me struggle is telling me to sue. Three attorney calls later and three denials later Im just at a loss for what to do. \n\nThe manager of the pizza shop told me that the door has been a problem since the city redid the sidewalk in front of it. Essentially there is too much space between the door and the sidewalk and feet can get caught under it. There must also be something sharp on the bottom of the door that caused such a severe laceration. In my mind they know it’s a problem but it hasn’t been remedied so now I’ve spent/lost out on hundreds of dollars and am in constant pain with no end in sight. And I don’t think I could have done anything different to have avoided it. \n\nSo how is there no recourse for me to collect something? I don’t want a million dollars. I just want my expenses and lost wages covered and maybe a little bit for how much this has affected my day to day (ever tried getting groceries or hosting a baby shower or going literally anywhere on crutches with a walking boot? It sucks). I just need advice on my options if I have any  😞","url":"https://www.reddit.com/r/legaladvice/comments/1p6mupr/premises_liability/","permalink":"/r/legaladvice/comments/1p6mupr/premises_liability/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764101010.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6msj5","name":"t3_1p6msj5","subreddit":"legaladvice","author":"Glittering-Bath4677","title":"Problem with property managment due to water under flooring","selftext":"Location: California\n\nHello, thank you for whoever takes the time to read this.  About a month ago we had water starting to pool under the floors in one of the bedrooms of our rental that is adjacent to the laundry room. \n\nWe reported said issue and it was diagnosed that the sink that was in the laundry room was slightly on and very slowly dripping in to cracks in the grout on the sinks tile backing. As such we were told we were responsible for the damages, however this is a sink we don't use for anything other than putting clothes in that need to be washed.\n\nWe got a couple more opinions on the situation and were told that property managment would be liable, because the sink wasn't properly maintained and that is what allowed the water to get through in the first place.\n\nThis was mentioned to property managment and they claimed that they were not liable because we didn't make a complaint about the sink not properly being maintained, even though we don't use the sink for anything other than clothes, and the cracks were small enough that they never would have been noticed. Who is at fault in this situation\n\nAny help, or advice would be great. Thank you","url":"https://www.reddit.com/r/legaladvice/comments/1p6msj5/problem_with_property_managment_due_to_water/","permalink":"/r/legaladvice/comments/1p6msj5/problem_with_property_managment_due_to_water/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764100883.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mkgg","name":"t3_1p6mkgg","subreddit":"legaladvice","author":"No-Engineer980","title":"Do I have to repay my security deposit?","selftext":"Location: North Carolina \nHi!  When I moved into my apartment I ended up paying both the firsts month rent as well as an extra two months for the security deposit.  I have a receipt for this.  I had an option to either pay this deposit or pay an extra 30-50 a month, and I picked the deposit which is in my lease.  For some reason, they instead signed me up for the monthly payments and refunded the deposit back to my account, so it was taking off my rent.  I was not informed of this, so I believed that this was due to my toilet being broken for the first two months that I lived there. I noticed the extra monthly charge and talked to them about it, so they removed that charge but want me to repay the deposit by the end of the year.  I simply don’t have that money, so I was wondering if there was anything I could do?  I wasn’t sure since I paid and wasn’t told that they didn’t put my money towards that.  I also will be trying to speak to a professional in my area but thought I could also ask here.  ","url":"https://www.reddit.com/r/legaladvice/comments/1p6mkgg/do_i_have_to_repay_my_security_deposit/","permalink":"/r/legaladvice/comments/1p6mkgg/do_i_have_to_repay_my_security_deposit/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764100381.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mfl1","name":"t3_1p6mfl1","subreddit":"legaladvice","author":"Dismal-Philosophy436","title":"A young person's guide to writing a will in the US please?","selftext":"Just as the title state, I would like some advice on how to write a will as a young adult please. I'm not sure where to start.\n\nLocation: California, United States ","url":"https://www.reddit.com/r/legaladvice/comments/1p6mfl1/a_young_persons_guide_to_writing_a_will_in_the_us/","permalink":"/r/legaladvice/comments/1p6mfl1/a_young_persons_guide_to_writing_a_will_in_the_us/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764100087.0,"edited":0.0,"link_flair_text":"Wills Trusts and Estates","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6meok","name":"t3_1p6meok","subreddit":"legaladvice","author":"HillOfBeano","title":"Tracking down oil/mineral rights/royalty accounts on inherited land","selftext":"Location: Louisiana\n\nI am located in New York and my father's probate is in California\n\nI'm not sure if this belongs here, personal finance, or somewhere else, but here goes. I inherited (via intestate succession, so no trust) some land in rural Louisiana. My father owned it jointly with his brother, who is not of sound mind and thus is of no use. \n\nThere are apparently oil leases on the property and I receive checks to my father from multiple royalty accounts. The only information I have is a stack of uncashed checks and random paperwork going back to at least 2018, and whatever gets forwarded to me in the mail. No signed leases or contracts. \n\nSome of these accounts, I have managed to track down and transfer to my name from the checks I found. A lot of them, though, do not have ANY information aside from the company name on the check. No address, no phone number, nothing, and google hasn't been entirely helpful as a lot of the numbers don't seem to be in service. Others, I call them and they say oh yeah we transferred those rights to XYZ here's the new place. So I would imagine that some of these unidentified places are doing the same thing. It feels like whack-a-mole\n\nI need to get this wrapped up asap (so I can close my dad's probate in California, I am depositing any checks to his name into that estate account) but since I am a New York suburbanite who has never stepped foot on this property I have no idea how to go about figuring this out. Research tells me that I might need a Landman? But the Netflix show keeps getting int he way of researching that. I want to just pay someone to figure this out and tell me what to do because I am tired.\n\nAny help I can get is appreciated.","url":"https://www.reddit.com/r/legaladvice/comments/1p6meok/tracking_down_oilmineral_rightsroyalty_accounts/","permalink":"/r/legaladvice/comments/1p6meok/tracking_down_oilmineral_rightsroyalty_accounts/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764100034.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m7ow","name":"t3_1p6m7ow","subreddit":"legaladvice","author":"West-Classic-900","title":"Contract from dealership","selftext":"Location: Arizona\n\nI bought a truck from a decent sized local dealership earlier this year. The dealership said the contract would be sent to my email but it never showed up so I called and requested it be sent over and they told me the salesman would reach out and/or send it by email. Well, I ended up forgetting about it in the everyday shuffle of life until yesterday. I called them back and spoke to someone in administration and they forwarded me to the same salesman but went straight to voicemail so I called back again asking why she can’t just send me the contract. She said she would leave a message for the guy to call me back. \n\nMy question is, what should I do? And what do I do if they don’t give me my copy of the contract?","url":"https://www.reddit.com/r/legaladvice/comments/1p6m7ow/contract_from_dealership/","permalink":"/r/legaladvice/comments/1p6m7ow/contract_from_dealership/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764099609.0,"edited":0.0,"link_flair_text":"Contracts","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m5bs","name":"t3_1p6m5bs","subreddit":"legaladvice","author":"Abject_Check_3263","title":"Parking violation help","selftext":"Location: Detroit, MI \nI recently visited Detroit from New York and received a parking violation for parking in a bus stop. I'm not denying the fact that I committed this violation, but rather the lack of knowledge I had that it was a bus stop that I parked in. Is there any surefire way to have this thrown or at least reduced?","url":"https://www.reddit.com/r/legaladvice/comments/1p6m5bs/parking_violation_help/","permalink":"/r/legaladvice/comments/1p6m5bs/parking_violation_help/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764099461.0,"edited":0.0,"link_flair_text":"Traffic and Parking","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m3e3","name":"t3_1p6m3e3","subreddit":"legaladvice","author":"Puzzleheaded-Owl-268","title":"Question","selftext":"Location: MN \n\nMy mother is currently racking up debt in hopes it heirs to me when she passes away, is this something I should be concerned about? ","url":"https://www.reddit.com/r/legaladvice/comments/1p6m3e3/question/","permalink":"/r/legaladvice/comments/1p6m3e3/question/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764099339.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lsai","name":"t3_1p6lsai","subreddit":"legaladvice","author":"Evening-Flounder-854","title":"(North Carolina) Judgment issued for debt last Dec, debt isn't mine and was never served","selftext":"Location: North Carolina   \nHello Reddit, I'm at a loss here. I discovered a judgment was issued against me and my parents. The situation is this. I work for my parents as a W2 employee, I have NO ownership or any stake in their company. Last year, a vendor filed for some unjust enrichment suit over money owed and named not just my parents but myself as well. The address the documents claim I was served at is their address... but I haven't lived there in now over 5 years and can prove this (I live in another county entirely). I can also produce documentation that the invoice in question was billed to the company and provide any financial documentation like W2s and tax returns to prove I don't have ownership in this company. I saw some other things were filed earlier this year like an attempt to put a levy on some property but never got served. \n\nIs there any recourse for me here? It hasn't been quite a year since this was issued (12/19). Please help, this is a very strange situation and I'm at a loss as to what on Earth to do here. Thank you seriously for any input on this.","url":"https://www.reddit.com/r/legaladvice/comments/1p6lsai/north_carolina_judgment_issued_for_debt_last_dec/","permalink":"/r/legaladvice/comments/1p6lsai/north_carolina_judgment_issued_for_debt_last_dec/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764098646.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lr4o","name":"t3_1p6lr4o","subreddit":"legaladvice","author":"wyzapped","title":"Set back for wood racks?","selftext":"Location: Rhode Island, USA\nDoes anyone familiar with property law know if there are setback requirements for things like wood racks holding logs of cut wood? My neighbor built a huge one over six feet high and twelve feet long right next to my fence, almost certainly out of spite. It’s a bit higher than the fence. Is it allowed to be that close? I can attach photos as needs.  Thanks for any advice.  ","url":"https://www.reddit.com/r/legaladvice/comments/1p6lr4o/set_back_for_wood_racks/","permalink":"/r/legaladvice/comments/1p6lr4o/set_back_for_wood_racks/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764098577.0,"edited":1764102046.0,"link_flair_text":"Real Estate law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kw6q","name":"t3_1p6kw6q","subreddit":"legaladvice","author":"ChefFickle1907","title":"How to find out if I'm an exempt vs non exempt employee *U.S.* *CA*","selftext":"I'm trying to figure out my employment status with regards to exempt vs non-exempt employee, without notifying my employer(I may be owed years of back pay if I am exempt). Is my status listed on any official documents? If I am non-exempt, then do I need to be recording hours worked? Do I need a time card? \n\nLocation: California, U.S.","url":"https://www.reddit.com/r/legaladvice/comments/1p6kw6q/how_to_find_out_if_im_an_exempt_vs_non_exempt/","permalink":"/r/legaladvice/comments/1p6kw6q/how_to_find_out_if_im_an_exempt_vs_non_exempt/","score":1,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764096713.0,"edited":0.0,"link_flair_text":"Employment Law","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6klxs","name":"t3_1p6klxs","subreddit":"legaladvice","author":"Icutmr","title":"Legal advice","selftext":"Location: Alabama \nMy father is having legal troubles with our local county. About 2 years ago he got pulled over and got a speeding ticket. He showed up to court and they allegedly changed his court date. The next day he got pulled over for a suspended license. Apparently the day he went they still marked as a no show the day of court(not the rescheduled day). He waited 6 months and had to pay around 250 reinstatement fees. Now to the current problem, he got pulled over about 6 months ago for a suspended license, expired tag, reason for getting pulled over was having a tow hitch ball on the truck. He did not have a suspended license, or a expired tag. I called Montgomery myself and they verified the license was good. He had court on Nov 19. They sent a letter out on the 18th for suspended license again for failure to appear. But when he went on the 19th for his court, they changed court date again to April 16th 2026. What can he do? Obviously they're playing the system somehow which i honestly don't understand. Any advice?","url":"https://www.reddit.com/r/legaladvice/comments/1p6klxs/legal_advice/","permalink":"/r/legaladvice/comments/1p6klxs/legal_advice/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764096100.0,"edited":0.0,"link_flair_text":"Traffic and Parking","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6khhm","name":"t3_1p6khhm","subreddit":"legaladvice","author":"Impressive_Prune_478","title":"Event insurance wont do anything","selftext":"Our wedding (11/14-11/16) venue was double booked and we had to cancel. The venue issued us a full refund and a letter stating that they canceled due to their error. Because of the situation, we had to find emergency lodging ($4k) for 16 people. Had food ($1500) go to waste. Everyone's travel expenses were for no reason, etc.\n\n Insurance company is saying they wont cover anything because we got a refund? We are trying to argue that we incurred a lot of expenses because of the cancelation. \n\nWhat do we even do? My brain cant process any of it because im so heartbroken that our wedding was ruined. \n\nWe didnt get to have our ceremony and its pushed back a couple of years now, at the earliest. So when we asked the insurance about covering for rescheduling, it was a \"we will have to see\"  i dont even know...\n\nLocation: heber city, ut (venue), San Antonio, tx (home) ","url":"https://www.reddit.com/r/legaladvice/comments/1p6khhm/event_insurance_wont_do_anything/","permalink":"/r/legaladvice/comments/1p6khhm/event_insurance_wont_do_anything/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764095819.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kcs4","name":"t3_1p6kcs4","subreddit":"legaladvice","author":"Fluid-Pizza-5819","title":"Stock broker question","selftext":"Location: Florida US\nCross posting this here because it’s a related post. https://www.reddit.com/r/options/s/8hmOkMNP19  I bought some stock options for OPEN that expired on November 21st. These stock options were worth over 10k usd. I had planned to hold the stock options until expiration and have them be auto exercised. I have done this before and never had any issue because this is how fidelity claims they handle that https://www.fidelity.com/options-trading/options-auto-exercise-rules . In this case though they never auto exercised the options and told me that essentially all that money is gone now. I feel extremely misled according to how I was told they would be handled and how they have been handled in the past. Is there any legal action I could take here? Thank you for any info.","url":"https://www.reddit.com/r/legaladvice/comments/1p6kcs4/stock_broker_question/","permalink":"/r/legaladvice/comments/1p6kcs4/stock_broker_question/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764095531.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6iv5s","name":"t3_1p6iv5s","subreddit":"legaladvice","author":"kat_webby","title":"Tattoo studio zoning","selftext":"Location: Webster City, IA \nOn November 20th I was served a paper saying the building Location is not commercial zoning. The building has previously been a clinic but is in a R-3 district. So essentially the building itself is zoned for a business but the neighborhood is not. I was given some basic advice by someone but im a little confused on the process. Tattoo shop is Arachnid Ink  1505 Lynx Ave, Webster City Iowa and I was given a email but im not sure the best person to contact first.\n\nBecause the proposed use is not listed here, the Zoning Board of Adjustment cannot approve a special use permit for this property.\n\n\"Based on guidance from the City Attorney, the appropriate process would be:\n\n1. Request the City Council to consider a zoning amendment to allow the proposed use.\n\n2. If the amendment is approved, the property would then need a code review for the change of occupancy, conducted by a licensed engineer.\n\n3. A Change of Use Permit would need to be submitted to formalize the occupancy and ensure compliance with all applicable codes.\" \n\nIf you need further clarification to help let me know!","url":"https://www.reddit.com/r/legaladvice/comments/1p6iv5s/tattoo_studio_zoning/","permalink":"/r/legaladvice/comments/1p6iv5s/tattoo_studio_zoning/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764092292.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ihu2","name":"t3_1p6ihu2","subreddit":"legaladvice","author":"itsmebeeitches","title":"Legal name change","selftext":"Location: South Carolina \nI am changing my name and on the documents  it says plaintiff ( I assume me ) and defendant. Who would be the defendant?","url":"https://www.reddit.com/r/legaladvice/comments/1p6ihu2/legal_name_change/","permalink":"/r/legaladvice/comments/1p6ihu2/legal_name_change/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764091472.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6id01","name":"t3_1p6id01","subreddit":"legaladvice","author":"jpasuncowboy","title":"Do I have to let my son's father come to our house?","selftext":"Location: Georgia. My child's father and I were never married, but he's legitimized. We split up when our child was 6 months old, and they'll be 12 years old next month. We used to live in the same county, but I moved two counties away back in July, and he's not been handling it well. He's always been very volatile, but I thought things would calm down by now, and they haven't. I haven't told him our new address yet because it hasn't mattered - I've been driving our son to and from, no big deal. I don't ask for child support, gas money, nothing. Over the last couple days, he's been pushing to bring our son to my new house, and I don't want that. For context, in 2019, he got very upset that I was seeing someone, and he ended up kicking my door in one morning; he was arrested for it. With all that in mind, I understand I likely have to legally tell him my address, but am I allowed to tell him we can meet somewhere else and I don't want him coming to my house?\n\nAnd for added context, I have tried to go for full custody in the past, but he seems to be very friendly with a lot of the police and attorneys in the county, and the judge berated me in the courtroom for not being able to afford an attorney, as well as ignored all the evidence I had of him harassing me via text and in person. I've called family attorneys in my area and have been told I'm looking for legal advice which they \"won't give for free.\" I'm sorry if this is all over the place, and thank y'all in advance.","url":"https://www.reddit.com/r/legaladvice/comments/1p6id01/do_i_have_to_let_my_sons_father_come_to_our_house/","permalink":"/r/legaladvice/comments/1p6id01/do_i_have_to_let_my_sons_father_come_to_our_house/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764091178.0,"edited":0.0,"link_flair_text":"Custody Divorce and Family","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i01e","name":"t3_1p6i01e","subreddit":"legaladvice","author":"warlicki","title":"Financial Documents for a Private Company?","selftext":"Location: WI, USA\n\nI’m an employer at a privately held company and have some curiosity about the way the company is owned and its financials. I know I can find a copy of the annual report through WI DFI, but is it possible to get a copy of the corporate returns from either the state or the IRS? I will technically be an owner through our employer stock program, will that entitle me to copies of these documents?","url":"https://www.reddit.com/r/legaladvice/comments/1p6i01e/financial_documents_for_a_private_company/","permalink":"/r/legaladvice/comments/1p6i01e/financial_documents_for_a_private_company/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764090390.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6gtxi","name":"t3_1p6gtxi","subreddit":"legaladvice","author":"Feeling-Minute-6513","title":"With prorated rent, Can landlord demand full rent up front then refund","selftext":"Location: Portland Oregon\n\nMy lease allows prorated rent for last month. I've given 30 days so I only owe half the last months rent. The landlord is demanding the full month up front, then will refund. Am I legally obligated to front the full month, or can I get away with only paying the half that I'll live in the unit ","url":"https://www.reddit.com/r/legaladvice/comments/1p6gtxi/with_prorated_rent_can_landlord_demand_full_rent/","permalink":"/r/legaladvice/comments/1p6gtxi/with_prorated_rent_can_landlord_demand_full_rent/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764087801.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
