{"id":"1otqefo","name":"t3_1otqefo","subreddit":"writing","author":"No-Rise6223","title":"Examples of fiction with \"evil\" main characters.","selftext":"I prefer the characters I create to be morally ambiguous. Recently I've been trying to create a protagonist who is a genuinely villainous person. I'd love some examples that I can learn from. ","url":"https://www.reddit.com/r/writing/comments/1otqefo/examples_of_fiction_with_evil_main_characters/","permalink":"/r/writing/comments/1otqefo/examples_of_fiction_with_evil_main_characters/","score":101,"num_comments":122,"over_18":false,"stickied":false,"created_utc":1762809669.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ouag84","name":"t3_1ouag84","subreddit":"writing","author":"moonlit_antihero","title":"Why are so many novelists writing series?","selftext":"Serious question. Why do so many novelists on forums seem to be writing series?\n\nDon't get me wrong, a series is great if your first book is a massive hit. And some series like the Dresden series work great as individual books that follow the same protagonist. But if the first of the series isn't a hit, and you have to read them in order, aren't you just setting yourself up for failure. Even with a massive hit, the following books usually still do worse. Even though people that liked the first one are more likely to buy the second one.\n\nHowever, a whole new standalone book can do even better. The readers of the first book are still more likely to buy the second if they like your writing. A whole new second book may mean people who didn't like the first are willing to give this new story a try.\n\nSeries writing just doesn't make sense to me from a business standpoint. If your first book bombs, you won't build much of an audience, just recycle a few readers. Where standalones, you have an opportunity to have a big hit and pick up new readers with every new book. Even though they may not like story two, they liked story one and may try story three. You can always add to the series years later after other stories build your reputation. Why do it one after the other. Although if you got a lot to say, go for it.\n\nI personally have 100 separate stories I want to tell.","url":"https://www.reddit.com/r/writing/comments/1ouag84/why_are_so_many_novelists_writing_series/","permalink":"/r/writing/comments/1ouag84/why_are_so_many_novelists_writing_series/","score":96,"num_comments":114,"over_18":false,"stickied":false,"created_utc":1762870331.0,"edited":1762878942.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otko3u","name":"t3_1otko3u","subreddit":"writing","author":"tachendo71","title":"Should I start writing without knowing the ending?","selftext":"Hi everyone, I've started writing a story and I already have a rough outline (at least the beginning and middle). The problem is, I can't seem to find the ending. I've been mulling it over for a long time, but I can't come up with anything that feels right, and that worries me because I don't want to abandon the story out of frustration (like I have with others).\n\nSo my question is: Should I start writing even though I don't know the ending, hoping it will come to me later, or should I keep working on it to make the story more coherent?\n\nThanks for reading, and please excuse my English.","url":"https://www.reddit.com/r/writing/comments/1otko3u/should_i_start_writing_without_knowing_the_ending/","permalink":"/r/writing/comments/1otko3u/should_i_start_writing_without_knowing_the_ending/","score":57,"num_comments":74,"over_18":false,"stickied":false,"created_utc":1762797121.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otooz3","name":"t3_1otooz3","subreddit":"writing","author":"Grouchy-Bike-262","title":"How can I encourage my boyfriend to start writing his story?","selftext":"Hi everyone,\nMy boyfriend has an amazing story idea that everyone who’s heard it absolutely loves. It’s genuinely such a creative, cinematic idea, and I think it could turn into something incredible if he ever put it on paper.\nThe problem is, he’s not sure how to start. He has all these ideas in his head, characters, plot twists, and world-building details. He also knows how to put it in writing but I guess he just doesn’t know where to start because it’s just something he has never done, and maybe it’s fear? I really want to encourage him without putting pressure on him or making it feel like “work.”\nFor people who’ve been in a similar situation (or writers in general): What’s the best way to help someone take the first step into writing? Are there small, fun exercises or ways to “test” the idea before writing a full novel? How can I help him stay motivated and not feel overwhelmed?","url":"https://www.reddit.com/r/writing/comments/1otooz3/how_can_i_encourage_my_boyfriend_to_start_writing/","permalink":"/r/writing/comments/1otooz3/how_can_i_encourage_my_boyfriend_to_start_writing/","score":29,"num_comments":63,"over_18":false,"stickied":false,"created_utc":1762805831.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otsl4t","name":"t3_1otsl4t","subreddit":"writing","author":"Ok-Cap1727","title":"What's the easiest thing to write? (For you)","selftext":"I'm gonna be honest, I could write fantasy smut for days while I would rather write something completely different. At the same time, fictional diary entries feel like the easiest thing to write for me. What's the things you could write for ages without end? ","url":"https://www.reddit.com/r/writing/comments/1otsl4t/whats_the_easiest_thing_to_write_for_you/","permalink":"/r/writing/comments/1otsl4t/whats_the_easiest_thing_to_write_for_you/","score":21,"num_comments":57,"over_18":false,"stickied":false,"created_utc":1762814831.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou0c2u","name":"t3_1ou0c2u","subreddit":"writing","author":"BalaTheTravelDweller","title":"Is what this person said about describing characters true?","selftext":"Hello everyone, \n\nI hope that you're doing well! \n\nSo, I was in a workshop where this one guy kept submitting stuff that was racist and misogynistic. \n\nIn one of the workshops, a classmate got into a heated discussion about this person's essay and its inherent racism. I agree with everything he said about the essay, but... during the discussion he went on a tangent and said that white people shouldn't **ever** use the word \"Black\" to describe people in writing or in real life. He was not a Black person, though he was a person of color. \n\nFor context, I'm white. I'm also a non-passing trans woman (I am NOT equating the trans experience with the experiences people of color have) and I've experienced a lot of transphobia in my life. I approach writing with a goal of wanting to include everyone while not assuming the reality of things I will never fully understand or experience. Discrimination, whether intentional or not, absolutely fucking sucks and I don't want to make anyone feel that way. So, my question basically is whether or not what that person said is true? Like, I don't want to assume it's not, but it was also something I'd never heard before so I wanted to follow up.\n\nThanks and I hope it's ok to ask this kind of thing in this subreddit! ","url":"https://www.reddit.com/r/writing/comments/1ou0c2u/is_what_this_person_said_about_describing/","permalink":"/r/writing/comments/1ou0c2u/is_what_this_person_said_about_describing/","score":16,"num_comments":80,"over_18":false,"stickied":false,"created_utc":1762835953.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oud46t","name":"t3_1oud46t","subreddit":"writing","author":"Mari_1432","title":"What is the most brutal way you have killed a character?","selftext":"In my case, I had a character that was disintegrated by a laser. Y'all probably have some Mortal Kombat/Final Destination typa shit","url":"https://www.reddit.com/r/writing/comments/1oud46t/what_is_the_most_brutal_way_you_have_killed_a/","permalink":"/r/writing/comments/1oud46t/what_is_the_most_brutal_way_you_have_killed_a/","score":7,"num_comments":53,"over_18":false,"stickied":false,"created_utc":1762876645.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oueg8u","name":"t3_1oueg8u","subreddit":"writing","author":"Fancy_Annual_828","title":"Writing advice","selftext":"Looking for political thrillers where the protagonist isn't CIA/military - just a politician in an impossible situation?\n\nI'm writing one (Speaker of the House, moral collapse, trolley problem on a national scale) and realized I don't know what my comps are. It's NOT *House of Cards* power-hunger - it's more 'what if doing your job correctly destroys everything?'\n\nRecommendations? Trying to figure out if this lane even exists or if I'm creating a weird subgenre nobody wants.","url":"https://www.reddit.com/r/writing/comments/1oueg8u/writing_advice/","permalink":"/r/writing/comments/1oueg8u/writing_advice/","score":5,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1762879591.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otyy14","name":"t3_1otyy14","subreddit":"writing","author":"Hungry_Tip_5822","title":"What are things you say when talking about your book?","selftext":"I have plans to write a contemporary fiction about a writer, and I want to include writer words that a lot of people would be like \"Wtf is that?\" Like what do you call your manuscript, that one unfinished project that haunts you, the piles of unfinished WIPS, etc.","url":"https://www.reddit.com/r/writing/comments/1otyy14/what_are_things_you_say_when_talking_about_your/","permalink":"/r/writing/comments/1otyy14/what_are_things_you_say_when_talking_about_your/","score":6,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1762831717.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ottvmu","name":"t3_1ottvmu","subreddit":"writing","author":"perdur","title":"Is there a middle ground between \"just write\" (but it's crap) and \"I've spent an hour rewriting the same sentence\" (but now it's good)?","selftext":"Hi everyone. I've been struggling with my writing for over a decade at this point. Apart from two projects that \"flowed\" (ie, I was more or less able to write at a steady pace), everything else I've tried to write is like pulling teeth just to get out a single sentence.\n\nI was diagnosed with OCD a few years ago, in part because I have all these \"rules\" that I'm trying to follow, where it feels like I have to contort every sentence to fit them. Some of these rules are reasonable and basic writing advice (eg, don't use bigger words like \"definitely\" twice in the same paragraph unless there's a specific reason for it), while others are definitely OCD (don't start two paragraphs in a row with the same word).\n\nI am working through this in therapy, but my therapist and I have hit a wall where I'm doing all the exposure exercises (intentionally breaking rules, only letting myself work on a sentence for x minutes, \"just writing\" without editing, etc), but I can't seem to break past these two extremes: either I can follow all my OCD rules, spend an hour working on a single sentence, and produce good writing, or I can \"just write\" but it's absolute crap.^\n\nI'm trying to find a middle ground where I can write steadily (maybe not quickly, but definitely not an hour-plus per sentence) and produce writing that I'm satisfied with (even though there'll always be things to fix in editing).\n\nDoes anyone have any advice on this? Am I searching for a unicorn? I know writing isn't easy, but it feels like it shouldn't be this goddamn *hard* all the time. It's especially frustrating because I've had those two projects where I *did* have that middle ground, but I can't figure out how to get back there.\n\n**tl;dr How do you strike a balance between \"just writing\" any crap that comes out and completely over-editing everything?**\n\n^ Crap meaning stream-of-consciousness type rambling, clunky phrasing that you'd raise your eyebrows at in a published book, half-assed sentences like \"Bobby's getting brunch in downtown Boston with Sally, Sally's latest boyfriend xxx, xxx's friend zzz, Ned, Dan, and Dan's girlfriend yyy (whose name Bobby can never remember in between get-togethers),\" that sort of thing.","url":"https://www.reddit.com/r/writing/comments/1ottvmu/is_there_a_middle_ground_between_just_write_but/","permalink":"/r/writing/comments/1ottvmu/is_there_a_middle_ground_between_just_write_but/","score":6,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1762817948.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oua6kr","name":"t3_1oua6kr","subreddit":"writing","author":"AutoModerator","title":"[Daily Discussion] Brainstorming- November 11, 2025","selftext":"\\*\\*Welcome to our daily discussion thread!\\*\\*\n\nWeekly schedule:\n\nMonday: Writer’s Block and Motivation\n\n\\*\\*Tuesday: Brainstorming\\*\\*\n\nWednesday: General Discussion\n\nThursday: Writer’s Block and Motivation\n\nFriday: Brainstorming\n\nSaturday: First Page Feedback\n\nSunday: Writing Tools, Software, and Hardware\n\n\\---\n\nStuck on a plot point? Need advice about a character? Not sure what to do next? Just want to chat with someone about your project? This thread is for brainstorming and project development.\n\nYou may also use this thread for regular general discussion and sharing!\n\n\\---\n\n[FAQ](https://www.reddit.com/r/writing/wiki/faq) \\-- Questions asked frequently\n\n[Wiki Index](https://www.reddit.com/r/writing/wiki/index) \\-- Ever-evolving and woefully under-curated, but we'll fix that some day\n\nYou can find our posting guidelines in the sidebar or the [wiki.](https://www.reddit.com/r/writing/wiki/rules)","url":"https://www.reddit.com/r/writing/comments/1oua6kr/daily_discussion_brainstorming_november_11_2025/","permalink":"/r/writing/comments/1oua6kr/daily_discussion_brainstorming_november_11_2025/","score":4,"num_comments":2,"over_18":false,"stickied":true,"created_utc":1762869636.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou70p9","name":"t3_1ou70p9","subreddit":"writing","author":"Huge_Egg_9998","title":"What do you recommend for staying motivated?","selftext":"Hello. I am new here but am wondering what people do to stay motivated or get themselves to write? I really enjoyed writing when I was younger. I still have the love for writing, but I can't get myself to do it. Since my junior year of high school (I am a senior now), I have been feeling burnt out. \n\nI have had many ideas, but I can never get myself to write them down. I have only done it once in the previous month, but that was it. I know I could use Google to look up answers to my question, but I also want to get feedback from you guys. ","url":"https://www.reddit.com/r/writing/comments/1ou70p9/what_do_you_recommend_for_staying_motivated/","permalink":"/r/writing/comments/1ou70p9/what_do_you_recommend_for_staying_motivated/","score":6,"num_comments":26,"over_18":false,"stickied":false,"created_utc":1762860391.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou3830","name":"t3_1ou3830","subreddit":"writing","author":"trashconverters","title":"Characters inspired by real people","selftext":"This is not asking for advice, just a discussion about how people navigate writing characters who they've based on real people, especially celebrities or historical figures.\n\nI'm writing a novel set in the Australian entertainment industry in 1980. One of the protagonists in inspired by [Graham Kennedy](https://en.wikipedia.org/wiki/Graham_Kennedy), a TV comedian who was most popular in the 1960s and 70s. There are key differences. My character would gawk at the idea of being a comedian, he's a film actor by trade. He has a better relationship with most of his family than Kennedy had. The causes of a lot of his anguish are unique. Also my MC is Catholic. Graham Kennedy was not a fan of Catholics. \n\nBut he's still a closeted gay Australian man working in show business, with a complex relationship with his sexuality and his weight. In fact, a key plot point (the MC putting on weight on purpose for a film role and struggling with his weight from that point onwards) was taken directly from the man who inspired him.\n\nI think I've personally struck a pretty good balance between outside inspiration and a brand new character. But how do you guys go about it, have you ever written a character based on real life, why did you decide to do so, how much did you change, etc etc. ","url":"https://www.reddit.com/r/writing/comments/1ou3830/characters_inspired_by_real_people/","permalink":"/r/writing/comments/1ou3830/characters_inspired_by_real_people/","score":5,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1762846084.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otvfzg","name":"t3_1otvfzg","subreddit":"writing","author":"MidKn1ght05","title":"When to say enough is enough?","selftext":"How do you guys decide when enough is enough of something? I don’t mean in a sense of being truly done, but saying to yourself it’s time to move onto the next topic of the story. Whether it’s writing the next creature or creating the new amazing character?\n\nI wrote chapter 1 for my book a while ago and constantly “finish it.” However, I always find myself going back and redoing things. Because of this I don’t think I’ll be able to show some of the cools things I believe I created or the future story I have planned. \n\nI do have chapter 2 already planned out but I don’t know why the first chapter never feels truly “complete”.\n\nSo I guess my question is that does anyone else go through this and how do you overcome it if you can?\n\n(In case you’re curious my Chp 1 at this time is about 12 pages, approaching 5,000 words. I don’t know if this is enough for a first chapter or to much but please comment if needed.)\n\nSorry if this is confusing, I can be more detailed if need be.","url":"https://www.reddit.com/r/writing/comments/1otvfzg/when_to_say_enough_is_enough/","permalink":"/r/writing/comments/1otvfzg/when_to_say_enough_is_enough/","score":6,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1762821970.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otyujy","name":"t3_1otyujy","subreddit":"writing","author":"lamningwon","title":"What age should a YA fantasy protagonist be?","selftext":"Just to debrief, I’ve written the first draft and my main character’s age is fifteen. Now that I’ll be going into editing for the second draft, I’m thinking of possibly aging her up a year at least because I’m worried she’d be considered too young for YA which in turn would lead to a lot of declines for rep for my book. \n\nSo what is a good age for YA fantasy that would be acceptable in the traditional publishing world? ","url":"https://www.reddit.com/r/writing/comments/1otyujy/what_age_should_a_ya_fantasy_protagonist_be/","permalink":"/r/writing/comments/1otyujy/what_age_should_a_ya_fantasy_protagonist_be/","score":1,"num_comments":25,"over_18":false,"stickied":false,"created_utc":1762831434.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otrlvw","name":"t3_1otrlvw","subreddit":"writing","author":"CognisantCognizant71","title":"Writing with Your Grandchild?","selftext":"Hi r/Writing,\n\nMy grandchild is in high school, and for a little spending money, she sort of warmed to the idea of her and Grandpa (me) writing a short story together that will take a couple months to do. Her job is to come up with a story idea, decide who and how many characters, and a general plot.\n\nShe is fourteen, and I realize that presents some personality challenge. I know Writer's Digest online has oodles of articles bout short story, but wonder if there is something online that will inform her and us without it becoming overwhelming?\n\nThe goal is to have her start, work through, and finish something that could be meaningful and maybe even published somewhere.\n\nThoughts welcomed, appreciated, esp by you if having done such an undertaking yourself.","url":"https://www.reddit.com/r/writing/comments/1otrlvw/writing_with_your_grandchild/","permalink":"/r/writing/comments/1otrlvw/writing_with_your_grandchild/","score":3,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1762812485.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oufhjd","name":"t3_1oufhjd","subreddit":"writing","author":"Possible_Music_2927","title":"Thoughts on A Biased 3rd Omniscient POV","selftext":"I tend to write from one character's POV pretty heavily per chapter, but there are some parts of a scene where I dip into others' thoughts/feelings/emotions. I would describe the POV as a biased 3rd omniscient since we're still mostly seeing the world through one character's eyes per section (and get a lot of their personal thoughts in the writing as well).\n\nI'm a bit torn as to what to do though. A lot of folks keep critiquing the POV, saying it felt like 3rd limited until I head hopped.\n\nI guess my question is: is this considered okay? I've done a bit of research and found that the Discworld series does this. Some consider LOTR to be a more omniscient perspective within the 3rd limited as well, but I can't really grasp if the technique is considered couth in the writing community.\n\nThoughts?","url":"https://www.reddit.com/r/writing/comments/1oufhjd/thoughts_on_a_biased_3rd_omniscient_pov/","permalink":"/r/writing/comments/1oufhjd/thoughts_on_a_biased_3rd_omniscient_pov/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1762881846.0,"edited":1762882737.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou6kff","name":"t3_1ou6kff","subreddit":"writing","author":"tarakanseryoga","title":"i feel like i’m not improving","selftext":"what do you guys do when you just feel stuck? like you’re not improving, your writing seems bland and dry, despite the efforts of reading a lot and studying others’ works and even practicing, and in general you don’t feel as confident in ur writing as u used to? i’m in this phase rn where i keep rewriting my story because it just doesn’t feel good enough","url":"https://www.reddit.com/r/writing/comments/1ou6kff/i_feel_like_im_not_improving/","permalink":"/r/writing/comments/1ou6kff/i_feel_like_im_not_improving/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1762858821.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou0e1z","name":"t3_1ou0e1z","subreddit":"writing","author":"ParallaxEl","title":"My multiple POV storytelling approach... what's yours?","selftext":"I'm writing an epic fantasy with one MC but a big cast of characters, including seven other POVs. Points-of-view characters get either a chapter to themselves, or share it with another POV character who is in the same scenes. No more than two POVs per chapter.\n\n  \nDo you have a multi-POV story? How did you construct it?\n\nHere's what I did in Draft 1:\n\n* Write the MCs arc, beginning to end. JUST the MC's arc, from their POV. Think of it like the sketch of a skeleton. How the MC's part of the story will begin, adventure, and end.\n* The above requires knowing how the story ends, so THINK, man. Imagine the climax. Dwell and steep in your *story* until you know how that story ends, and how awesome it makes your MC look. (If there are more stories, worry about them later. For now you need an MC story sketch.)\n* Oh look. I made you think out your main plot. Ooops! \n* Now \"all\" you need to do is add the other POV characters as threads through the story. In some cases, those new characters might be in the same scenes with the MC you already wrote. In other cases, they might be *converging* on the MC. They're going to join the party, or oppose them. Whatevs, it's other new characters.\n* Once you've written your new character threads into your story (after several years, in my case) you'll have 10 stories. Or whatever, X stories.\n* At the same time, you will also have reached \"The End\" for all of your 1st draft POV threads. That means you're done. You wrote your rough draft. It's there. It's clay, ready to be molded and shaped.\n\n  \nThat was Draft 1. Draft 2 was all about turning those X number of different stories into one story. Combing the rats out of the hair. ","url":"https://www.reddit.com/r/writing/comments/1ou0e1z/my_multiple_pov_storytelling_approach_whats_yours/","permalink":"/r/writing/comments/1ou0e1z/my_multiple_pov_storytelling_approach_whats_yours/","score":0,"num_comments":22,"over_18":false,"stickied":false,"created_utc":1762836136.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otw9j1","name":"t3_1otw9j1","subreddit":"writing","author":"Major_Lawfulness_769","title":"Scriptwriting","selftext":"hi everyone,\n\nnot even sure what I'm saying here. saying hi I guess. im currently working on my next script (I direct and produce them myself) and I really like how its been shaping up\n\nok right I'll probably go down this way, wanting some advice from fellow screenwriters - how I tend to write my scripts is writing the first draft; I'll write exactly what happens where I'm listening to music to really feel the moment of what's happening.  \non the second draft, I rewrite the whole script using the first draft; but this time I try to write it more creatively, expanding on ideas/feelings (or try to anyway)\n\nfor fellow screenwriters, how would you suggest I improve on the actual writing?  \n(like im great with coming up with ideas/dialogue. but its more the actual screen writing)\n\nsomeone in the industry gave a few suggestions, and thats where I'm trying to improve\n\nplease give me practical and easy to implement tips. it just works better for my brain haha ","url":"https://www.reddit.com/r/writing/comments/1otw9j1/scriptwriting/","permalink":"/r/writing/comments/1otw9j1/scriptwriting/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1762824184.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otqz6c","name":"t3_1otqz6c","subreddit":"writing","author":"Expensive_Ordinary72","title":"How do you get through with your ideas?","selftext":"I always get book ideas but the setting and context of my ideas always require a lot of research because I mostly want to write abourt different time periods or countries. I have the conception, but when I think about the work I have to do beforehand, I loose all my motivation. I don’t know how to go past this. ","url":"https://www.reddit.com/r/writing/comments/1otqz6c/how_do_you_get_through_with_your_ideas/","permalink":"/r/writing/comments/1otqz6c/how_do_you_get_through_with_your_ideas/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1762810989.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ouekxl","name":"t3_1ouekxl","subreddit":"writing","author":"Straight_Tangelo_795","title":"Two parts story","selftext":"I have a story with a sequel and a prequel. The story means it is not a collection of random ideas. Each sequel and prequel has a 50-60 pages of detailed treatment with characters, order of complete plots, detailed descriptions of scenes from the beginning to the climax of each one.\n\nThe sequel is about a family drama and domestic action thriller. It is about a disgraced son who must protect his wealthy family members that rejected him from a vengeful billionaire. The sequel ends with the question- how the protagonist is such ruthless and strategic and what shaped him like this?\n\nThe prequel will provide the answer. It is about the protagonist’s past. It is like a blend of high tech, intellectual and philosophical thriller. It is about the protagonist with his friends- how a group of students take down a shadowy elite organization that is playing with human suffering and responsible for the loss of the protagonist‘s surrogate family.\n\nTo be clear- the prequel is kinda like a story of Seven + Inception + SquidGames but completely different from any of them.\n\nFor me, the prequel is very massive and ambiguous. And I believe releasing the sequel first would be a great hook and massive impact for the prequel. I have already developed the entire plot for each prequel and sequel with 50-60 pages of detailed treatment for each.\n\nInitially, I wrote it as a form of recreation. But it left me with a deep impact. It is really hard for me to abandoning the story and storing it within me. It makes me think I am wasting it. But a person with no background, knowledge and experience, I don’t know what steps to take next.\n\nThat’s why I am here to ask for your advice and suggestions.","url":"https://www.reddit.com/r/writing/comments/1ouekxl/two_parts_story/","permalink":"/r/writing/comments/1ouekxl/two_parts_story/","score":0,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1762879876.0,"edited":1762880185.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oud0y8","name":"t3_1oud0y8","subreddit":"writing","author":"Jacksleftnutsack","title":"Should I keep beta reading for this guy?","selftext":"I’ve got this beta reader who I’m beginning to realize has entirely different tastes to me. We both knew from the beginning he writes literary fiction, and mostly reads classic literature, while I’m a pretty commercial/contemporary writer who reads mostly modern fiction, but I figured it doesn’t hurt to have someone who might not normally read your genre to give their perspective. I’ve beta read other’s literary fiction before and really enjoyed it, so I wasn’t too worried.\n\nI’m realizing a little too late our differences go beyond genre. I’ve read a few of his pieces and unfortunately am not a huge fan of his prose or the subject matter he mostly write about (almost always romance. I can enjoy romance, just not the gushy way he writes about it). I miss all the themes he swears should be pretty obvious to his readers. It’s almost comical, the way he’ll highlight certain paragraphs that he really enjoyed that were the same paragraphs that I couldn’t take seriously.\n\nI’m trying to be nice and constructive in my critiques, but he’s also not super receptive to criticism. He has said repeatedly, he has a confidence about his writing and he knows he has things to say about the world that people need to hear. As a fellow writer, I come from a pretty opposing perspective. Sure I love what I write, but the reason I find beta readers is primarily because I want to ensure others ALSO love what I write, and am (within reason) willing to make changes to optimize the reader’s experience. \n\nHe has a justification for everything. This paragraph sounds clunky? He thinks it sounds fine. This theme wasn’t obvious? He’s not sure how much more clear he can be. This character didn’t seem to have much of an arc? Well he can’t have them change too much or it will ruin the story. I get that beta readers are more for ‘data points’ and you shouldn’t change your whole story because of one person’s experience, but based on a few things he’s said, it seems like there are other beta readers who’ve had similar issues.\n\nNot to mention, it feels like he’s phoning in his critiques of my writing. Last time we ‘swapped’, I had to push for almost every thought he gave me. He gave a weirdly ‘positive’ review, saying things made sense, he liked the way I described this character’s profession, “No I can’t think of any negatives”, but all with the delivery of Eeyore from Winnie the Pooh. And then he ‘ran out of time’ to read my third chapter and didn’t tell me until we met up to go over each other’s writing. \n\nI just want to tell him I’m not his audience and maybe we should both find people more in line with our tastes. Is that a cop out? I just started beta reading for others somewhat recently and I’m not sure where to draw the line. He also is the guy who introduced me to this writing group I really like so I won’t be able to ‘cut him off’. \n\n\n","url":"https://www.reddit.com/r/writing/comments/1oud0y8/should_i_keep_beta_reading_for_this_guy/","permalink":"/r/writing/comments/1oud0y8/should_i_keep_beta_reading_for_this_guy/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1762876451.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otv9j3","name":"t3_1otv9j3","subreddit":"writing","author":"BlastarBanshee","title":"Struggling to finish what I start","selftext":"Anyone else great at starting stories but terrible at finishing them?\n\nI’ve got like 5 drafts sitting around all with solid openings decent characters and then… I just kinda fizzle out halfway through. Either I get bored, doubt the plot or convince myself it’s not good enough to keep going. How do you push through that middle slump? Do you outline everything first or just force yourself to write to the end no matter what? Would love to hear how you deal with this.","url":"https://www.reddit.com/r/writing/comments/1otv9j3/struggling_to_finish_what_i_start/","permalink":"/r/writing/comments/1otv9j3/struggling_to_finish_what_i_start/","score":0,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1762821494.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otmxx9","name":"t3_1otmxx9","subreddit":"writing","author":"MessyMidlife","title":"Short stories views","selftext":"What do you feel about short story books? They are not very in vogue but I love them. Any one got any recommendations or thoughts?","url":"https://www.reddit.com/r/writing/comments/1otmxx9/short_stories_views/","permalink":"/r/writing/comments/1otmxx9/short_stories_views/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1762801975.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otmfmn","name":"t3_1otmfmn","subreddit":"writing","author":"Fluffy_Corner541","title":"How do I improve my writing","selftext":"I’m a sophomore in college who struggles with writing. I freeze when it comes to certain assignments because I don’t know what to say or how to articulate it in a more professional tone","url":"https://www.reddit.com/r/writing/comments/1otmfmn/how_do_i_improve_my_writing/","permalink":"/r/writing/comments/1otmfmn/how_do_i_improve_my_writing/","score":0,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1762800875.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otlmei","name":"t3_1otlmei","subreddit":"writing","author":"Specialist-One-2734","title":"The problem I have with writing","selftext":"I started actively writing since my freshmen year of highschool. First it was just a journal, then it was fragmented short stories and many poems and songs- though the problem with me is that I can never have a character, a plot, a scene- it seems like I just keep running around in circles of consciousness and infinitely many ideas. I keep going back and forth and I never really get a stable concrete story. And I get it, a lot of authors write like this, Virginia, Joyce; but my writing is nothing like theirs, even in my journals I have a hard time talking about simple topics that either happened to me or the stuff I'm feeling. I'm 18 and I've wrote like this since I've started pursuing writing, I have never had a story, never had an oc- it was only spiraling and spiraling like I am aiming for something higher.\nBy \"aiming for something higher\" I mean establishing my philosophical thinking with things that I'm writing, and a problem that arises from that is that the philosophy I'm ran by, is not concrete, not even a bit. I like Kierkegaard and Sartre, I dwell on simple things like mugs and lights for too long, which, at the end, it all comes down to being whirlpool with no meaning.\nI tried making an oc, but it just feels wrong to me, having a character that has a name, that has a certain personality, certain looks- I can't comprehend that, I can't even start writing something like that. For example, if I have an idea, I will start writing about it and then the idea would burst and go in all direction. I would start using these weird sentence formats, making a system with it, which then collapses under it's own rules and meaningless.Trying to come up with a plot beforehand just doesn't do me good. I can never complete it beforehand, I can't complete my thoughts and therefore I cannot complete the vision- which again just lead to me blurting out nonsense.\n\nI don't know what to do, in me there's a crater of ideas and thoughts which I feel I will never be able to put on paper, and that makes me agitated and dissatisfied; I feel as I can never express myself with language- so if anyone has any tips for me, I'll be glad to hear them!!!!!!!!!!!!!","url":"https://www.reddit.com/r/writing/comments/1otlmei/the_problem_i_have_with_writing/","permalink":"/r/writing/comments/1otlmei/the_problem_i_have_with_writing/","score":0,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1762799154.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ouf42d","name":"t3_1ouf42d","subreddit":"writing","author":"IWorshipKenma","title":"Advice on writing Male CSA victims.","selftext":"So I wrote this side character who was SA’d by his step mom and developed disgust towards s3x but until he met the antagonist that appears as his savior and shows him what real love is and gets completely attached to her but then she dumps him for whatever I haven’t decided on a reason but she is manipulative.\n\nthen he meets his true pairing as an arranged marriage it’s an fri-enimes to lovers plot, he still very attached to the antagonist but he later slowly falls in love w his fiancé but doesn’t realize it as he feels like he’s betraying his savior then realizes he’s hurting both his fiancée and him self and moves on But the antagonist notices and tries to bring him back to his lowest point but at some point I’ll make him completely move on from her then he realizes how much of a psycho she is.\n\nthe story ofc is t just abt romance the antagonist has done way more crazy shit then manipulating a guy so that’s why I called her a psycho.\n\nas I was writing I felt like something is wrong cuz I am projecting  my own experience w sa rather than a male’s pov and I want to make this somewhat relatable to male SA victims any advice?","url":"https://www.reddit.com/r/writing/comments/1ouf42d/advice_on_writing_male_csa_victims/","permalink":"/r/writing/comments/1ouf42d/advice_on_writing_male_csa_victims/","score":0,"num_comments":2,"over_18":true,"stickied":false,"created_utc":1762881031.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"nsfw"}
{"id":"1oucz7j","name":"t3_1oucz7j","subreddit":"writing","author":"jjavaco","title":"World building advice!!","selftext":"I want to start writing and in my head I’ve got this massive world and characters. And I know I can turn it into a story but I’m struggling to get the setting and arc to mesh and actually onto paper. It’s hard because I can feel the story in my brain- and I have a feeling of how it should go. But I have no idea how to make it as epic irl.\n\nDo you have any advice on what you include/ discard when it comes to world building and what’s important to set up one? Like what’s crucial when starting out and what can be added later.\n\nAnd what do you think makes a good arc? Like when you read or write, what makes it too muddled? Is it over explaining? Or under explaining? I’ve read books that do both but sound amazing… is it taking too long to get into the drama/ action of the story, or rushing to do it and then everyone is totally clueless on what their reading?\n\nAnd finally, what would u recommend to get better at writing? Like what can I do to up this skill (if that makes sense)\n\nThank you very much for reading! And I hope yall got some good advice for me ♡","url":"https://www.reddit.com/r/writing/comments/1oucz7j/world_building_advice/","permalink":"/r/writing/comments/1oucz7j/world_building_advice/","score":0,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1762876338.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou9i1n","name":"t3_1ou9i1n","subreddit":"writing","author":"Purple-Charge6445","title":"Do you really need to wait 3-4 months before you start editing?","selftext":"Hi everyone! So, I just completed the first draft of my first ever historical fiction novel yesterday. ~~(on the third try)~~   \n\nNow, the next obvious step is developmental editing. All advice I've seen so far says you need to \"put the draft aside for at least 3-4 months, so that you can look at it with fresh eyes\". \n\nBut... does one really have to wait so long? I'm about to start a new job soon and afraid I won't have time or energy to edit my novel in four months' time. Plus, I already have a few specific ideas of what I should change in the draft. I might forget them if I delay editing until spring. \n\nWhat's your experience?\n\nIs it fine to begin editing in a few weeks, not months? What helps you acquire that \"fresh\" look at your manuscript? Thanks a lot.","url":"https://www.reddit.com/r/writing/comments/1ou9i1n/do_you_really_need_to_wait_34_months_before_you/","permalink":"/r/writing/comments/1ou9i1n/do_you_really_need_to_wait_34_months_before_you/","score":0,"num_comments":34,"over_18":false,"stickied":false,"created_utc":1762867855.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ottxa7","name":"t3_1ottxa7","subreddit":"writing","author":"ClassicSandwich7831","title":"I have a plan of the story but I can’t write it.","selftext":"Do you have any advice how to actually start writing? All I see is tutorials about planning the story and I already have that. I know what the story is about, how it starts, how it ends, how to get there, I know what scenes I want to put there. But I don’t know how to actually start writing, everything I write feels empty, either too much like summery or too dialog focused. And everything feels just bad. I know it’s lack of practice, I haven’t written anything in years.\nBut I hope that maybe someone knows the answer. How to stop planning and start actually writing? What do you do to make the scenes that you can clearly imagine translate into written words?\n\n(I hope it doesn’t violate community guidelines to put this post here. The posts on “how to write something” are supposed to be somewhere else but I feel it’s more about how to write something specific and I want a general advice. But maybe I’ve interpreted it wrong)","url":"https://www.reddit.com/r/writing/comments/1ottxa7/i_have_a_plan_of_the_story_but_i_cant_write_it/","permalink":"/r/writing/comments/1ottxa7/i_have_a_plan_of_the_story_but_i_cant_write_it/","score":0,"num_comments":11,"over_18":false,"stickied":false,"created_utc":1762818057.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ottmot","name":"t3_1ottmot","subreddit":"writing","author":"acpcacpc","title":"MFA at U of Arkansas Faculty?","selftext":"Does the University of Arkansas have any fiction faculty currently? It’s hard to tell from their webpage! Seems like they are all mostly poets! I’d love to apply, but 🤷","url":"https://www.reddit.com/r/writing/comments/1ottmot/mfa_at_u_of_arkansas_faculty/","permalink":"/r/writing/comments/1ottmot/mfa_at_u_of_arkansas_faculty/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1762817302.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otplwy","name":"t3_1otplwy","subreddit":"writing","author":"GCCJ_26","title":"Practice exercise suggestions.","selftext":"I'm thinking as a form of practice to create to a very short story; I am currently thinking of posting it somewhere on a blog site like Blogger (or on this subreddit) and listen to feedback, as I want to give myself a good enough excuse to practice my creative efficiency in storytelling. I want to make effective usage of words as I want to stretch to my potential.\n\nHowever, I would like to hear people's methods for practicing or refining their skills. Does it even matter if my stuff may not be perfect? Or should I not show any of my work until I am confident it's completely competent art? ","url":"https://www.reddit.com/r/writing/comments/1otplwy/practice_exercise_suggestions/","permalink":"/r/writing/comments/1otplwy/practice_exercise_suggestions/","score":0,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1762807887.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otov4m","name":"t3_1otov4m","subreddit":"writing","author":"Aledipiaz","title":"Before recent years has it ever exist that some writers of movies/books/tv series made fan theories canon?","selftext":"So we know in recent years it has become more and more popular for writers to please fans more knowing their expectations. Many people are blaming it as a “ruining “ of media. Of course it is becoming too used However I always heard that writers in a way or another tried to please their fan when they started to reach a little  bit of success. Do we know specifically if before the 21st century (or at least before 2010s) there was an episode were writers tried to make a “fan theory” canon?","url":"https://www.reddit.com/r/writing/comments/1otov4m/before_recent_years_has_it_ever_exist_that_some/","permalink":"/r/writing/comments/1otov4m/before_recent_years_has_it_ever_exist_that_some/","score":0,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1762806211.0,"edited":0.0,"link_flair_text":"Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otokwx","name":"t3_1otokwx","subreddit":"writing","author":"Anxious-Animator-415","title":"Question about Getting Published","selftext":"Hey there, fellow writers! I'm about to finish a novel and I'm looking to get it published. Its genre is high fantasy, and it has around 170,000 words. I've read in several sites that a word count as high as mine can really be an issue when attempting to get published traditionally. Regardless, I want to try and see if luck is on my side. Could someone recommend a legitimate website to find a literary agent? Also, do you have some tips on how to find one as an author who's never had anything published before? Thank you very much in advance for your responses!","url":"https://www.reddit.com/r/writing/comments/1otokwx/question_about_getting_published/","permalink":"/r/writing/comments/1otokwx/question_about_getting_published/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1762805582.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otm0br","name":"t3_1otm0br","subreddit":"writing","author":"Funny_w0lf","title":"The Draft Process","selftext":"I've had the same book series idea for a few years. I know the backstory prologue (an ancient evil) and the modern events that happen that bring that spirit back by the end of the second book. \n\nIts very clear what I want to write. But the filler and draft process has barley begun on my first book. I have a total of 1 chapter in a 25 ish book (averaging maybe 100,000 words ?) I feel like im stuck. How is it i know what major events need to take place, but actually writing it out is hard? Especially in the beginning. \n\nShould I write out main plot points first? Skip around to writing what I actually want to write and fill in the gaps later? Is writing not linear? I feel like im stuck trying to stay linear, maybe thats the problem? Any advice is appreciated ","url":"https://www.reddit.com/r/writing/comments/1otm0br/the_draft_process/","permalink":"/r/writing/comments/1otm0br/the_draft_process/","score":0,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1762799976.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otkmg7","name":"t3_1otkmg7","subreddit":"writing","author":"Gogobunny2500","title":"My Process (From Outline to Final Draft) Share yours if you have one!","selftext":"Just sharing what happens before I send a novel out to agents. I focus on science fiction/fantasy, and while I have \"pantsed\" most of my published shorts, I am definitely a planner/gardener for novel-length works. \n\nI love hearing what other planners are doing. Spreadsheets? Scrivener corkboard? Lmk!\n\n  \n\\*Outlining Process\\*\n\nPremise: One sentence summary of the book. I'll pause and work on characters (goals, arcs, key history points)\n\nSummary/Blurb: A paragraph description of the main plot, including my MC. I tend to use the style you'd find on the back of a book cover or on an Amazon description\n\n7 Point Plot Structure: I love this format to expand on my idea. It works better for me than the three-act structure.  I allow a paragraph per plot point and a bullet point list of key scenes in each plot point.  \n\nFinal Summary- Letter format to submit to agencies. I redo this throughout the outlining and drafting process to have a finished version that I use in ask for Beta/Alpha readers. \n\n\\*Drafting and Editing Process\\*\n\nDraft 0: This one is messy. I'm not worried about formatting, plot, or anything. I'm just excited to get my idea out of my brain and onto paper. I take a break for a month and likely outline a completely different story or two.\n\nD1: I return and trim the fat. I rewrite the book, dropping things that don't work at all, and improving the areas I know need work (For me, that's usually plotting issues) \n\nD2, D2.5: Rewrite (and maybe re-outline). This is the draft I'm sharing first with Beta readers and then again with Alpha readers after absorbing Beta reader feedback. By this draft, there are no plot holes, and I'm solid on what my characters are experiencing. I ask for specific feedback in the form of three specific questions: \"What do you like? What don't you like? What was hard to believe?\" This feedback format works best for me. \n\nD3: Partial rewrite. This is the draft I would send to agencies. At this point, I'm incorporating the feedback that aligns with my goals for the story and then likely printing a copy to do a line edit. (This can involve a red pen and reading out loud) If I have an editor at this point, I will send it to them next.\n\nD4: This is D3 but edited. (By me and possibly an outside source) This one goes off to the races, and any subsequent rewrites come after agency feedback. \n\nWhat is your process? I'm always looking to learn new things. ","url":"https://www.reddit.com/r/writing/comments/1otkmg7/my_process_from_outline_to_final_draft_share/","permalink":"/r/writing/comments/1otkmg7/my_process_from_outline_to_final_draft_share/","score":0,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1762797022.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou918a","name":"t3_1ou918a","subreddit":"writing","author":"Starstruck_isnotdead","title":"How do i stop being super uncreative?","selftext":"(Not exactly for a book but idk where else to ask.) Im really bad at coming up with cool settings/story premises, and every time i come up with a good idea it's usually already been done.\n\nAny tips??","url":"https://www.reddit.com/r/writing/comments/1ou918a/how_do_i_stop_being_super_uncreative/","permalink":"/r/writing/comments/1ou918a/how_do_i_stop_being_super_uncreative/","score":0,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1762866591.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou7306","name":"t3_1ou7306","subreddit":"writing","author":"Certain-Implement859","title":"What genre is this?","selftext":"Getting further along in my novel and it's never fallen perfectly into a genre (which I'm fine with, but still hoping to see which is closest). Hoping someone here has some thoughts!\n\nHere's the gist:\n- it's set in the future after civilization has collapsed\n- technology has gotten back to the point where it's around ancient Greece \n- so it takes place in a future ancient Greece with no magic or anything among ruins of today's civilization \n- the plot is around power politics and different factions trying to reach the top \n\n\nAny thoughts appreciated!","url":"https://www.reddit.com/r/writing/comments/1ou7306/what_genre_is_this/","permalink":"/r/writing/comments/1ou7306/what_genre_is_this/","score":0,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1762860623.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otyf7y","name":"t3_1otyf7y","subreddit":"writing","author":"Visual-Plum-6923","title":"Question.","selftext":"I am struggling to find a free plagiarism checker that is accurate and reliable.\nSo far the ones I have found seem to just say the plagiarism level is high to encourage purchase of a subscription, and The percentage keeps changing every time I put in the same text from a book I wrote on Wattpad.\nDoes anyone know of a good checker that is free, accurate and reliable? ","url":"https://www.reddit.com/r/writing/comments/1otyf7y/question/","permalink":"/r/writing/comments/1otyf7y/question/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1762830202.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otwyrl","name":"t3_1otwyrl","subreddit":"writing","author":"Interesting-Sir6098","title":"Self-Published My Book, Now What?","selftext":"Hello everyone,\n\nRecently I published (or re-published because of problems with my \"publisher\") my first book. I told people about it on Facebook, Instagram, and on my YouTube page, but I haven't had any sales yet. What am I doing wrong? What do I do now?","url":"https://www.reddit.com/r/writing/comments/1otwyrl/selfpublished_my_book_now_what/","permalink":"/r/writing/comments/1otwyrl/selfpublished_my_book_now_what/","score":0,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1762826122.0,"edited":0.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otpjb7","name":"t3_1otpjb7","subreddit":"writing","author":"Lemon-Munch","title":"Im a European and I have an idea for a mystery story centered around early US history.","selftext":"Obviously American would have to do just as much research about early US history as any European however the fact that I’m not even from America makes me more anxious and nervous about doing it.\n\nI feel like if I get something wrong, people will judge it by higher standards because it’s a mistake made by an “outsider”.\n\nStandards should obviously be high, I’m not denying that.\n\nAm I right or wrong for thinking that ?","url":"https://www.reddit.com/r/writing/comments/1otpjb7/im_a_european_and_i_have_an_idea_for_a_mystery/","permalink":"/r/writing/comments/1otpjb7/im_a_european_and_i_have_an_idea_for_a_mystery/","score":0,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1762807726.0,"edited":1762808010.0,"link_flair_text":"Advice","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
