{"id":"1p6iw15","name":"t3_1p6iw15","subreddit":"college","author":"Temporary-West-3879","title":"Is an hour drive too much? Or should I dorm?","selftext":"Hello, I am going to a university that is an hour away from home. However I am undecided whether to dorm or commute. I wanna hear your experiences for those who commute somewhat long distances to school and hear your opinions.","url":"https://www.reddit.com/r/college/comments/1p6iw15/is_an_hour_drive_too_much_or_should_i_dorm/","permalink":"/r/college/comments/1p6iw15/is_an_hour_drive_too_much_or_should_i_dorm/","score":70,"num_comments":49,"over_18":false,"stickied":false,"created_utc":1764092347.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6g4wz","name":"t3_1p6g4wz","subreddit":"college","author":"Opposite_Magician_81","title":"How do I email professor without sounding disrespectful?","selftext":"My professor stated that they gave me a 0 because I submitted late work but that’s impossible. The program we use does not allow us to submit group discussions after the end date. Should I send a screenshot with the time stamp? I hate that this happened but I don’t want a bad grade. \nI’m already doing horrible in math. My other grades are so good. \n\nI messaged them and it was a fault on my end.  \nI was in the wrong, and forgot all about due dates on the syllabus 😭. This is my second semester and it’s a bit different from the last. I forgot the due dates in the syllabus were the previous day, and the extra day(I had submitted the assignment on) on the discussion boards online were just for emergencies. I feel embarrassed that I forgot about that. Thank you for all the replies. ","url":"https://www.reddit.com/r/college/comments/1p6g4wz/how_do_i_email_professor_without_sounding/","permalink":"/r/college/comments/1p6g4wz/how_do_i_email_professor_without_sounding/","score":64,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764086282.0,"edited":1764097638.0,"link_flair_text":"Academic Life","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6o68p","name":"t3_1p6o68p","subreddit":"college","author":"Objective_Prize_8213","title":"Ticked all the boxes in life except college.","selftext":"I got married young, raised 4 children as a stay at home mom, bought a house, paid off the house. Now I want to get a degree that is flexible. I still don't know what I want to be when I grow up. Math is not my strong suit and I am an introvert. I like the idea of working in an office doing administration but a lot of administrative degrees have a lot more math than I'd like to take. I don't know how far I would get with a general BA in Psychology or Sociology? Human Development?  \nWhen I go back to work, I guess I'd like to not start off as a rock bottom cashier like I did as a teenager. I would love a degree that might give me a boost in almost any career choice. If I work at wal-mart, for example, is there a degree that would get me past the minimum wage position? I think that's really what I am after.","url":"https://www.reddit.com/r/college/comments/1p6o68p/ticked_all_the_boxes_in_life_except_college/","permalink":"/r/college/comments/1p6o68p/ticked_all_the_boxes_in_life_except_college/","score":21,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764104028.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p682zm","name":"t3_1p682zm","subreddit":"college","author":"Yusuro_Yuki","title":"How do I meet new people at college?","selftext":"So I'm in my third year of college. So much stuff happened and I'm all alone now, so I want to start anew again. The clubs and circles at my college aren't really active, at least the ones I'm interested in. And no parties and bars are not as rampant as I'd like where I'm from. Most of my interactions with others are in class and in between classes. So how do I meet new people? I'm not a very social person so approaching strangers for socializing has always been daunting. Strangely though, if it's work related I can talk to anyone and everyone. It's only my social life which is an absolute mess. Also I really wanna cuddle. If only my dorm allowed pets. I'd keep a dog and two kitties. Anyways so how do I socialize? Any ideas... Any tips on how to socialize would be really appreciated ","url":"https://www.reddit.com/r/college/comments/1p682zm/how_do_i_meet_new_people_at_college/","permalink":"/r/college/comments/1p682zm/how_do_i_meet_new_people_at_college/","score":7,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764062693.0,"edited":0.0,"link_flair_text":"Social Life","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6rz1e","name":"t3_1p6rz1e","subreddit":"college","author":"BumbleDeezNuts","title":"Going back to school after finishing BS, to get BS in Mathematics?","selftext":"Hi everyone!\n\nI just wanted to get some advice or insight into this idea I have.\n\nRight now I am currently getting my bachelors of science in Managerial Economics (basically applied economics). I am using a VA program called Vocational Rehabilitation to fund this and I have just enough of the benefit to complete this BS. \n\nBefore I transferred from my community college, I fell in love with mathematics but I wasn't able to change my degree focus and keep Voc Rehab to fund my education. \n\nI was considering double majoring in Man Econ and Math but I don't think my rehabilitation counselor would be willing to let me make the change. \n\nI was wondering, should I just complete the BS in Man Econ and then take a gap year or so and come back and pursue mathematics?","url":"https://www.reddit.com/r/college/comments/1p6rz1e/going_back_to_school_after_finishing_bs_to_get_bs/","permalink":"/r/college/comments/1p6rz1e/going_back_to_school_after_finishing_bs_to_get_bs/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764113107.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
