{"id":"1otr99z","name":"t3_1otr99z","subreddit":"books","author":"misana123","title":"Flesh by David Szalay wins the Booker Prize 2025","selftext":"","url":"https://thebookerprizes.com/the-booker-library/prize-years/2025","permalink":"/r/books/comments/1otr99z/flesh_by_david_szalay_wins_the_booker_prize_2025/","score":406,"num_comments":31,"over_18":false,"stickied":false,"created_utc":1762811663.0,"edited":false,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":"default"}
{"id":"1ou3gxj","name":"t3_1ou3gxj","subreddit":"books","author":"4ofclubs","title":"How do you read when your environment is never quiet?","selftext":"I live in an apartment downtown with paper thin walls. If its not noise outside, its my neighbour upstairs TV or my neighbour downstairs partying. I'd love to sit on the couch and read in evenings but I find it impossible to focus with so much going around me.\n\nDoes anyone have secrets on how to read in these situations? We don't all live in quiet suburbs sadly. ","url":"https://www.reddit.com/r/books/comments/1ou3gxj/how_do_you_read_when_your_environment_is_never/","permalink":"/r/books/comments/1ou3gxj/how_do_you_read_when_your_environment_is_never/","score":156,"num_comments":236,"over_18":false,"stickied":false,"created_utc":1762847017.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otlwr4","name":"t3_1otlwr4","subreddit":"books","author":"cmrizzle","title":"Took almost two years due to my pure laziness and need for endless scrolling, finally finished East of Eden.","selftext":"I don’t know where to begin. I almost think that it taking me so long to finish helped me fully indulge in the characters and the story. My heart broke when I read Aron died. It’s almost like a weight lifted off my shoulders when Catherine finally died, her whole spirit always had a dark shadow over the story, just looming in the background which I think is a testament to how wonderful Steinbeck is able to write and flesh out his characters. \n\nI was in tears when Cal first realized he didn’t want to keep being mean. He struggled so hard to walk the line of being good and winning the approval of his father, then often succumbing to his meanness then starting all over again. Steinbeck all the while showing there is a choice to be made and you can still choose to be good. Charles never understood that it seems, but Cal did. Lee was such a delight of a character and really tied the whole story together. I almost wish Sam Hamilton didn’t die so early on in the book but his spirit still clearly lived on in the pages following. \n\nOverall, a very beautifully written book. I can now understand why it’s a classic and I will be dwelling on what i just read for some time. ","url":"https://www.reddit.com/r/books/comments/1otlwr4/took_almost_two_years_due_to_my_pure_laziness_and/","permalink":"/r/books/comments/1otlwr4/took_almost_two_years_due_to_my_pure_laziness_and/","score":107,"num_comments":26,"over_18":false,"stickied":false,"created_utc":1762799766.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":true,"locked":false,"thumbnail":"spoiler"}
{"id":"1ou45nw","name":"t3_1ou45nw","subreddit":"books","author":"Zehreelakomdareturns","title":"Fear and Loathing in Las Vegas, a review.","selftext":"*“We were somewhere around Barstow on the edge of the desert when the drugs began to take hold”*\n\nThis is the iconic opening line from *Fear and Loathing in Las Vegas*(1971) by *Hunter S. Thompson*, an anarchic classic recounting a drug fuelled roadtrip through the wreckage  of the “American Dream”. \n\nWhat begins as a sports assignment for Sports Illustrated mutates into a hallucinatory odyssey through Las Vegas, drenched in drugs, satire and existential despair. Hunter S. Thompson, writing under his alter ego Raoul Duke and his unhinged companion Dr. Gonzo (based on real-life attorney Oscar Zeta Acosta) stumble through a blinding 400 mile dirt bike race, hotels, casinos, police conference,National  District attorney's convention to fight narcotics, airport etc. \n\nThe prose is a whirlwind: part journalism, part fever dream and part rant against everything hollow in post-1960s ‘Summer of love’ America. Thompson’s invention of “gonzo journalism” (where the reporter becomes the story) is on full display here.  The language is abrasive, the pacing erratic and the excess overwhelming, making it feel like being on the verge of a paranoid spiral with two unhinged people. The book’s chaotic structure mirrors its drug fuelled content, yet beneath the madness lies a surprisingly lucid message about disillusionment, greed and the failure of the 60s counterculture idealism.\n\nOnce dismissed as vulgar, I understand why now its considered as a literary landmark, finally recognized as a time capsule of 1970s America, embraced for its honesty,humour and fearless chaos. The 1998 Terry Gilliam film adaptation has further cemented its cult status, especially with Johnny Depp’s uncanny portrayal of Thompson, who even had his ashes fired from a cannon years later.\n\nPick it up if you want a book that hits like a bad trip and stays like a revelation. \n\n8/10","url":"https://www.reddit.com/r/books/comments/1ou45nw/fear_and_loathing_in_las_vegas_a_review/","permalink":"/r/books/comments/1ou45nw/fear_and_loathing_in_las_vegas_a_review/","score":30,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1762849641.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1oucw7x","name":"t3_1oucw7x","subreddit":"books","author":"casperscare","title":"In the The Lost Fleet: Dauntless by Jack Campbell, are there any other competent commanders other than John 'Black Jack' Geary.","selftext":"I posted on the r/suggestmeabook subreddit a while back, requesting for books with competent commanders and leaders apart from the main protagonist because I was looking for books like the Sun-Eater series, where the empire has other competent military and civilian leaders, especially the emperor, who to me is quite brave and a competent leader. I believe that apart from Hadrian, he is the only thing keeping the empire together.\n\nAnd the lost fleet was suggested to me.\n\nAlso, in a reddit thread about \"smart characters being smart only because other people around them are written to be dumb\". The Lost Fleet was a book suggestion that subverts that.\n\nI just started, but so far it's been the opposite. A lot of the leaders of the other ships in the alliance are just so incompetent or just stupid, which is baffling. The conversations with other commanders of the various ships just pointed out their ignorance, like the idea of every man for himself. Which was going to fail, given that the enemy was in front of the singular gate that they were going to use to run. So would have been death, and the only option that John pointed out was to do some system hopping, which another commander concededly looked down on the idea. Without offering any other viable solutions, it wasn't the best idea, but it's better than certain death.\n\nNot to mention how the alliance evolved to a system whereby, before a plan/strategy is adopted, debates on it first, then all commanders vote on it.\n\nNow I get this is meant to show how John is out of time and the future has changed greatly from what he used to know but this is just stupid. I'm wondering how the way of doing things changed to that. \n\nThat wasn't how things were done during his time also in all that time till now the alliance was still losing. And somehow their military evolved to a situation where during a war, when quick decisions have to be made, you have to spend a considerable amount of time debating and politicking. \n\nI'm wondering if this book is for me, as I find some of the things the alliance is doing to be so stupid that it's not reasonable, and it's breaking the immersion for me. And I'm genuinely thinking of dropping it.\n\nI know I've just started, but usually when reading I expect to have a reason to either trust the book and keep on going or have a reason to read on. But so far it's been nothing if the book continues with stupid actions by commanders, with Jack being the only competent leader with the alliance being made to look too stupid to the point of being annoying, then I don't see what's so great about reading it.\n\n","url":"https://www.reddit.com/r/books/comments/1oucw7x/in_the_the_lost_fleet_dauntless_by_jack_campbell/","permalink":"/r/books/comments/1oucw7x/in_the_the_lost_fleet_dauntless_by_jack_campbell/","score":7,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1762876152.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou4h46","name":"t3_1ou4h46","subreddit":"books","author":"Crafty-Dependent1802","title":"The Magus, what happened?","selftext":"I have just finished *The Magus* and I am absolutely baffled. Honestly, I have no idea what happened, or why. Don’t get me wrong, the writing is beautiful, but I couldn’t grasp the point of the book. What was the experiment actually about? What were these so-called \"pretend gods\" trying to teach Nicholas? The motives behind the \"game\" felt paper-thin to me, and the constant references to books and authors, while impressive, often felt like name-dropping rather than adding depth to the story.\n\nAt first, the book reminded me a bit of Umberto Eco’s *Foucault’s Pendulum*, that idea of what is real and what is not....but as the story progressed and I got more confused, that comparison fell apart. I have re-read *Foucault’s Pendulum* at least five times and always find something new. I doubt I’ll return to *The Magus*.\n\nThat said, I know there are readers who absolutely loved this book, if you’re one of them, could you help me understand? What exactly was the point of the game, and what was it trying to prove?","url":"https://www.reddit.com/r/books/comments/1ou4h46/the_magus_what_happened/","permalink":"/r/books/comments/1ou4h46/the_magus_what_happened/","score":6,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1762850916.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":true,"locked":false,"thumbnail":"spoiler"}
{"id":"1ou6bzp","name":"t3_1ou6bzp","subreddit":"books","author":"Quack_Quack_Duck","title":"Is the Apple Classics Frankenstein the 1818 or the 1831 version?","selftext":"I read the Apple Classics free version of the book a while ago unaware that there were two very different versions. I just saw a video on my feed that talked about the differences and one of them was that Victor and Elizabeth are blood-cousins in the original 1818. I’m very certain the one I read was the revised 1831 because it explained that Elizabeth was adopted into the family by Victor’s mother. I just want to make sure. I very much enjoyed the book, but I would like to read the other version to compare.","url":"https://www.reddit.com/r/books/comments/1ou6bzp/is_the_apple_classics_frankenstein_the_1818_or/","permalink":"/r/books/comments/1ou6bzp/is_the_apple_classics_frankenstein_the_1818_or/","score":3,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1762857965.0,"edited":false,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1ou5l1r","name":"t3_1ou5l1r","subreddit":"books","author":"AutoModerator","title":"Simple Questions: November 11, 2025","selftext":"Welcome readers, \n        \nHave you ever wanted to ask something but you didn't feel like it deserved its own post but it isn't covered by one of our other scheduled posts?  Allow us to introduce you to our new Simple Questions thread!  Twice a week, every Tuesday and Saturday, a new Simple Questions thread will be posted for you to ask anything you'd like.  And please look for other questions in this thread that you could also answer!  A reminder that this is not the thread to ask for book recommendations.  All book recommendations should be asked in /r/suggestmeabook or our Weekly Recommendation Thread.\n        \nThank you and enjoy!","url":"https://www.reddit.com/r/books/comments/1ou5l1r/simple_questions_november_11_2025/","permalink":"/r/books/comments/1ou5l1r/simple_questions_november_11_2025/","score":4,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1762855236.0,"edited":false,"link_flair_text":"WeeklyThread","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
