{"id":"1p63ros","name":"t3_1p63ros","subreddit":"BestofRedditorUpdates","author":"Direct-Caterpillar77","title":"Single father [38M] with daughter [17F], discovered she has a large amount of cash and I'm suspicious","selftext":"**I am not The OOP, OOP is u/numbthrowaway12**\n\n**Single father [38M] with daughter [17F], discovered she has a large amount of cash and I'm suspicious**\n\n**TRIGGER WARNING:** >!Death of a loved one, fears of drug use!<\n\n**MOOD SPOILER:** >!Positive ending!<\n\n[Original Post](https://www.reddit.com/r/relationships/comments/2or7bz/single_father_38m_with_daughter_17f_discovered/)  **Dec 9, 2014**\n\nI'm a concerned father of a 17 year-old daughter seeking advice. Names have been changed to maintain some confidentiality.\n\nMy background info: My wife passed away when my daughter was very young. I was still in college, but with the help of my parents, managed to finish college and graduate school while raising her. I've dated a few times since the death of my wife, but haven't been able to maintain a serious relationship due to my career and the responsibilities of raising my daughter.\n\nMy relationship with my daughter, Sarah, has always been very good. Sarah shared my love of the outdoors so we used to go hiking, kayaking and camping together quite often. In the last year or so, she seemed to become interested in other activities at school so she hasn't spent as much time with me. I'm perfectly ok with that, she's growing up and coming into her own.\n\nFinancially we're very secure, I've been fortunate to make a nice living in a career I enjoy, and the hours are pretty manageable. Despite that, I've tried not to spoil my daughter and make sure she understand the importance of work. In exchange for an allowance and gas money, she has to complete chores around the house as well as help our elderly neighbor (she's 90) with things like taking out the trash, getting groceries, etc. She's an A-student, participates well in school activities and used to be a girl scout until she was 14. Honestly, I've always been very proud of her.\n\nShe was out with her friends Saturday to watch a movie. I had a contractor come over to replace a couple of windows in the house while she was out. Now, I've always respected her space, and she knew about this before hand. I ended up having to move around some of the furniture in her room and discovered a small box behind her drawers. Curiosity got the best of me and I opened it after the contractor was done, and there was about $3000 in cash inside! That's way too much money for her to have. After the discovery, I snooped around her room a bit and found some expensive brand-name clothing in her closet that I had never seen her wear before. Some were a bit too mature for my taste, but that's a discussion for another day.\n\nSince then, I've doubled checked my accounts to see if she had secretly taken money from my accounts, but no. I never carry much cash on me so she couldn't have stolen it from me. I don't think she's selling drugs, because I never found a stash in her room. She's not dating anybody as far as I know, so it couldn't be a boyfriend's money either.\n\nI haven't discussed the discovery with her yet, but I intend to do it tonight. Any advice on how to approach this subject with her? $3000 is a lot of money for her age, and I imagine she's spent more so we could be talking about $5000-$6000 here. I don't want to be too confrontational and would a way to bring up the subject so she feels safe enough to be completely honest with me. I'm so worried, I keep hoping she isn't caught up in something illegal that could jeopardize her future. Maybe I overlooked some signs? I'm freaking out and looking for your help here.\n\ntl;dr: Found a large amount of cash in my daughter's room. Not sure how to bring up the subject in a way that will encourage her to be honest with me about it. Any advice would help.\n\n**RELEVANT COMMENTS**\n\n**Zorkeldschorken**\n\n> You need to talk to her.  \"I was cleaning up after the contractors left and found that box of cash under your dresser.  That's a lot of money to leave lying around the house.  It would probably be better to deposit that into a bank.  How did you managed to save that much up, anyway?\"\n>\n> Everyone's jumping to the worst possible scenarios (drugs/prostitution/whatever), but chances are it's perfectly innocent.\n>\n> She may be doing more odd jobs for other neighbors.  Maybe the neighbor she's helping out has been giving her tips or more money than you're aware of.\n>\n> The fact that it was stashed in a box in her room is nothing to be worried about.  She's 17.  She's probably been keeping stuff in that box since she was a kid, and doesn't realize that a bank would be a better place.\n\n**OOP**\n\n>>Thanks for the advice, this seems like a good way to start the conversation. I don't want her to think that I'm snooping around in her bedroom and invading her privacy. I've always stressed to her the importance of dialogue and honesty, so I'm hoping she will come clean and it's nothing serious. \n\n**~**\n\n**wombatzilla**\n\n> Does she work? I worked from the time I was 15 and I saved up enough money by the time I was 18 to buy myself a computer, a very nice film camera, and plane tickets / rent for an apartment. \n>\n> If she's been working that's really not that much money. \n>\n> Either way I think you need to just ask her about it and don't come from an accusatory place. If she responds in a secretive/angry way you know something weird is going on. If she's calm and has a reasonable explanation for it you know she's probably telling the truth. \n\n\nEdit: My daughter doesn't have a part-time job. She does have a savings account that I opened for her with about $1200 in it, which is why I'm worried she's keeping this money secret. She's accessed her savings account before to buy things like a new phone and camera, as well as gifts and other smaller purchases. She gets $50 a week in allowance, but if she wants to buy electronics or other things that she wants, it comes out of her savings. Any expenditure from extracurricular activities also comes out of her allowance. As for the neighbor, I've told her before that she does not have to give my daughter anything for helping out, since I'm already paying her via allowance.\n\nEdit2: The clothing were really high-end brands, like Gucci and Versace. By mature I didn't mean revealing or anything like that, just didn't seem like clothing a 17 year-old would want/wear. Also, I know $50 seems like a lot but we live in an expensive city, the cheapest takeout place near me costs like $9 just for lunch. As for my neighbor, she might be 90 but her mind is pretty sharp. I don't know why but I didn't think about her slipping my daughter cash here and there, so that's a possibility. The more I think about it, the calmer I'm feeling. I'll talk to her tonight and explain the circumstances of my discovery, and take it from there.\n\n\n[Update](https://www.reddit.com/r/relationships/s/bYVgldGLa5)  **Dec 12, 2014 (3 days later)**\n\nI was signed into this account on my laptop and noticed I received PMs asking for an update to my [post](https://ud.reddit.com/r/relationships/comments/2or7bz/single_father_38m_with_daughter_17f_discovered/). So, here it is. \n\nI had a long talk with my daughter Sarah that night. I sat her down and described the circumstances of the discovery. I explained that I was worried because it's a large sum of money and I didn't want her savings to be stolen. \n\nWell, turns out the elderly neighbor, Anne, has been giving her cash for the better part of a year now. Anne wanted her to have the money to help with college expenses, and told Sarah to keep it a secret from me because I've always refused to accept money from her. Sarah also told me that part of the money was her own. She had been saving up for my birthday present and didn't want to put it in the savings account because, well, she'd have to ask me and it wouldn't be a surprise anymore. \n\nLater in the conversation, I brought up the expensive clothing. Those were throwaways from her friend's mother. Her friend is really tall so she couldn't wear them and gave them to Sarah instead. They needed some slight alterations so she hasn't worn them yet. I apologized for snooping and explained that as a father, I was obviously concerned for her well-being. I also assured her that we are financially stable and that I've put aside enough money for her college expenses. I told her to keep an eye out for Anne, to make sure that her welfare is not affected by the money she's paying Sarah. Also, I asked her to write a thank-you card to her friend's mom and to include a present for her at Christmas this year.  \n\nAfter the revelations, I wanted to reward her for her savings habit, so I offered to start a checking account for her and we looked into the options online. Turns out, the bank I use offers a junior checking which I can co-sign (overdraft fees, etc) for her. It turns into her own personal account at 18. She'll have the use of a debit card, the bank also offers an online-based financial planning guide, so she will read that before starting the account. We're going to the local branch to set that up for her this weekend.\n\nSarah seemed to reflect well to our talk. She took the opportunity to reveal that she has been in a relationship for a couple of months. I've actually met her girlfriend a few times before, they go to the same school and I just thought they were good friends so that was a surprise. So yes, she came out of the closet to me. \n\nBeing a dad, I still verified the clothing story with her friend's mom. Overall, I'm happy it was just me dramatically overreacting. However, I do feel rather guilty for the minor panic attack I had. As a parent, it's astonishing sometimes how quickly your child grows up. Just another part of the learning process I guess. \n\nP/S: I didn't reduce her allowance but did encourage her to keep saving because it's an excellent habit. \n\n---   \n**tl;dr**: Money from neighbor, clothes from friend's mom, so she's getting her own checking account. She also disclosed she's in a relationship. Worst of all, my tortured soul is left wondering what she's buying for my birthday.\n\n**THIS IS A REPOST SUB - I AM NOT THE OOP** \n\n**DO NOT CONTACT THE OOP's OR COMMENT ON LINKED POSTS, REMEMBER - RULE 7**","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p63ros/single_father_38m_with_daughter_17f_discovered/","permalink":"/r/BestofRedditorUpdates/comments/1p63ros/single_father_38m_with_daughter_17f_discovered/","score":9880,"num_comments":430,"over_18":false,"stickied":false,"created_utc":1764046801.0,"edited":0.0,"link_flair_text":"CONCLUDED","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p63uo8","name":"t3_1p63uo8","subreddit":"BestofRedditorUpdates","author":"Choice_Evidence1983","title":"Did I Cross a Boundary by teaching my bf’s son how to cook?","selftext":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p63uo8/did_i_cross_a_boundary_by_teaching_my_bfs_son_how**I am NOT OOP, OOP is u/Sad_Active8131**\n\n**Originally posted to r/Marriage**\n\n**Did I Cross a Boundary by teaching my bf’s son how to cook?**\n\n**Trigger Warnings:** >!infidelity, entitlement, emotional abuse and manipulation, controlling behavior!<\n\n----\n\n[Original Post](https://www.reddit.com/r/Marriage/s/qHY0pIVSLm): **November 17, 2025**\n\nI (F, 27) just made this account to ask a question before my boyfriend comes home and we talk. I just want to know if I crossed any boundaries and if I owe him and his ex-wife an apology.\n\nMy boyfriend (M, 35) and his ex-wife (F, 37) share a son named Tristan. Tristan (M, 8) comes to our place every other week. I recently moved in with my boyfriend after two years of dating. I asked Tristan what his favourite meal is. He said butter chicken, so I make sure to cook it on the night he comes to our place.\n\nToday, he was home because of a PD Day, and I had the day off too to be with him. I told him, “Do you want to make it together? I’ll supervise and tell you what to do. It’ll be fun!” So we prepared rice and butter chicken together. He was so proud of himself. He asked me to take a picture and send it to his mom and dad while he held the plate all ready. I did, and I wrote, “Chef Tristan made his first butter chicken today!”\n\nHis mom lost it and messaged that I robbed her of his first cooking experience and that I’m just a girlfriend trying to “play family.” I said I didn’t mean it that way and that I thought it was just a fun activity. I apologized.\n\nMy boyfriend messaged saying I should have talked to his mom first, especially since it involved being close to the oven or cutting. I told him I did the cutting and I truly didn’t mean to insult his mom. Now Tristan has finished his meal and I’m waiting for his dad to come home.\n\nDid I cross the line?\n\n**Added later:** no it’s not a cultural meal for any of us . He just really likes this meal . I wasn’t my bf’s affair partner . Tristan’s mom broke up with my bf when Tristan was 1 when she met her coworker. Tristan has a half sister from his mom’s side. She is still with the guy\n\n**update** I talked to him. Well apparently I crossed the line because it was his fav meal ! It was supposed to be his mom’s job to teach him not me as I was told . My bf asked if I could first check with Tristan’s mom first in future first before doing anything . I told him there won’t be a next time because I refuse to do anything one on one with him. He thinks I’m overreacting and I should just let it go. What do I know I’m just some girl playing family .. ugh I’m so annoyed by him being such a wuss\n\n**Editor's note: OOP has made the same original post onto another subreddit, I am adding the relevant comments for more context**\n\n**Relevant Comments**\n\n**Commenter 1:** If Tristan's parents want to criticize you, for taking a day off, to watch their son for them, and actually making that day fun, they owe you an apology. They also need to stay home with him if every first is so critically important. Let them use their own time off to watch their own son in their own way. They don't get to have it both ways. They either have you watching him and you choosing things to do or they do it themselves.\n\n> **OOP:** When he has PD *(editor's note: professional development)* day and with us my bf and I take time to be with him\n\n**Commenter 2:** Were you taking care of him while the mom and dad were at work? If so I would stop babysitting immediately and make that clear after this response. \n\n> **OOP:** It’s his week with my bf. His mom is a SAHM\n\n**Commenter 3:** I don't have kids, so maybe I'm missing something, but is cooking their first meal with some assistance that big of a deal that a grown woman needs to throw a tantrum? Some things I can understand feeling like, nope, step-parent should not take that opportunity from the actual parents. But cooking? Something, by the way, his mother could have done with him a million times over but never actually did?\n\nI will say though, that the real issue here is your partner not taking your side. At the very least he should have calmed her down and had a conversation with her about it, and also about how she spoke to you. Either way if I were you I'd cut contact with her for now and let your partner and him do the communicating until things settle.\n\n> **OOP:** I don’t have any kids so this was new to me\n\n**Commenter 4:** You didn’t mean any harm. It was sweet, but involving Tristan in something his mom sees as a “first” crossed a boundary.\n\nA quick apology and telling her it was just for fun should fix it. Next time, check with both parents first.\n\n> **OOP:** Well apparently I crossed the line because it was his fav meal ! It was supposed to be his mom’s job to teach him not me as I was told . My bf asked if I could first check with Tristan’s mom first in future first before doing anything . I told him there won’t be a next time because I refuse to do anything one on one with him. He thinks I’m overreacting and I should just let it go. What do I know I’m just some girl playing family .. ugh I’m so annoyed by him being such a wuss\n\n**Commenter 5:** Was there any other option but you staying home? Just wanting to check that you’re not being treated as a babysitter.\n\nBeing a step parent is hard - you facilitated an activity to support the rapport between you and your step child and it sounds like he had a great time and made something he was proud of. Parents are in the wrong here and how dare dad turn it on you.\n\n> **OOP:** He is with us until Sunday (he came here Sunday afternoon). Today was PD. When he is here and it’s a pd his dad and I take turn to watch him. He took a day off last time so this time it was my turn. I just posted an update in the original post. I’m officially refusing to get involved in anything related to their son from now on\n\n**Commenter 6:** Reaction to update. You’re overreacting?!?? And their insane response is not an overreaction?!? Ask her every time you do anything? This is too much, I’d be seriously considering if I wanted to stay with a man who let his ex speak to me that way, especially when I was doing the both of them a favor by watching their kid. He needs to grow a pair and stick up for you or I’d be gone. You don’t need this drama.\n\n> **OOP:** Yea I’m the one overreacting... I dropped the towel buddy! I’m not going to be involved in anything kid related from now on\n\n+\n\n> He is such a wuss! So terrified of her and thinks she can take full custody because of his work schedule. She can’t ! But my bf thinks she can and terrified of losing Tristan\n\n**OOP explains why she is calling Tristan her BF's son, not her stepson**\n\n> **OOP:** I’m not allowed to even call him my stepson hence I call him my bf’s son because we are not married. He says im his dad’s gf or calls me by my first name and his mom told my bf that I should just say he is my bf’s son. I’m trying to be respectful but tonight I’m really annoyed\n\n**Is OOP going to stay with her BF?**\n\n> **OOP:** I’m currently sleeping on the couch because I’m mad at him lol I went to bed early he came acted like nothing happened started kissing me and initiating sex! Nope! I’m mad at you! He kept saying oh come on! No\n\n&nbsp;\n\n[Update](https://www.reddit.com/r/Marriage/s/FxXs77k3jJ): **November 18, 2025 (next day)**\n\nFinal Update - teaching my bf’s son how to cook\n\nI guess this is my final update. I called him on my lunch break and told him I had thought about everything, and that both he and his ex-wife owe me an apology. I explained that I was bonding with Tristan and made a meal with him after taking care of him all day, and she got mad and insulted me and then he took her side. Then he had the audacity to come to bed and ask for a blow job.\n\nHe said I was being ridiculous and immature. I told him that if I didn’t hear a real apology, I wasn’t coming home and we were done. He said, “Fine, whatever, sorry.” I said that didn’t sound sincere at all, and asked whether he was going to ask his ex to apologize to me. He said, “Are you insane? No. Out of the question.” I asked him if he honestly wouldn’t even try to stand up for me. He said I was being unrealistic and that it wasn’t like that.\n\nSo I told him we were done, because he wasn’t even trying.\n\nRight now I’m at my best friend’s house eating sushi take-out and watching Gilmore Girls reruns, lol. I’m more mad than sad. I’m not at eating ice cream and cry stage yet ! I guess that’s it ! we’re done. He’s been texting saying we need to talk, but I have nothing to talk about. We’re done. My best friend and I will start looking at rental places online for me after dinner .\n\nThank you for all your feedback\n\n**Editor's note: OOP has made the same update post onto another subreddit, I am adding the relevant comments for more context**\n\n**Relevant / Top Comments**\n\n**Commenter 1:** It is better that you found out about your ex and his wacko ex before you got married to him. You dodged a bullet with both of them. I feel sorry for Tristan. If his mother was a good one, she would appreciate you trying to bond with her son.\n\n> **OOP:** I wonder if he would ever even marry me or his ex wife wouldn’t allow this one either!\n\n**Commenter 2:** Wow, just wow. Not only did he not back you but wanted sex afterward. The trash took itself out. The sad and tragic thing is, this is going to happen with his son with any woman in his life. The dude doesn't have a spine, he is just a jelly. Mommy monster is going to be in for a rude awakening so is he as his child gets older.\n\n> **OOP:** Yea he came to our bed acting like nothing had happened then started kissing me and initiating sex. I said get off me ! He said fine give me a good blow job at least . I slept on the couch last night! The audacity of this man\n\n**Commenter 3:**The one I feel sorry for most here is Tristan. He could have had another caring adult in his life, one who actually wanted to spend time bonding with him, but his mom had to get in the way of that because she was jealous, and your ex is clearly too spineless to stand up to her.\n\nIt sucks this happened, OP, but better to find out now than after getting married. I once dated a guy who had a daughter with his ex, and she came over every other weekend. He went on about how he thought I would be such a good influence in his child's life, but once we moved in together, I wasn't even afforded the respect of a roommate, let alone partner, where his daughter was concerned. I broke things off, and trust me, I have no regrets!\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p63uo8/did_i_cross_a_boundary_by_teaching_my_bfs_son_how/","permalink":"/r/BestofRedditorUpdates/comments/1p63uo8/did_i_cross_a_boundary_by_teaching_my_bfs_son_how/","score":4830,"num_comments":490,"over_18":false,"stickied":false,"created_utc":1764047046.0,"edited":1764085077.0,"link_flair_text":"CONCLUDED","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p63tbk","name":"t3_1p63tbk","subreddit":"BestofRedditorUpdates","author":"Choice_Evidence1983","title":"AITAH for telling my assistant she can’t have her vacation?","selftext":"**I am NOT OOP, OOP is u/Honest_Kick_5400**\n\n**Originally posted to r/AITAH**\n\n**AITAH for telling my assistant she can’t have her vacation?**\n\n**Trigger Warnings:** >!hostile workplace, entitlement!<\n\n----\n\n**Editor's note: the body texts for both original and update posts have been saved before they were removed**\n\n[Original Post](https://www.reddit.com/r/AITAH/s/yUeuhh6ywX): **October 18, 2025**\n\nThe title sounds rough but hear me out on this.\n\nI (31F) have been managing a little Starbucks kiosk in my store for a little over a year now and in that had nothing but struggles, mainly with my assistant. We’ll call her Betty.\n\nWhen Betty first got hired on, she made a deal with the old manager that she absolutely needs Thursdays and Fridays off but never gave a legitimate reason why she needs those days off in her interview. (At the time, I was the bookkeeper so I heard her entire interview as the bookkeeping office and store office is side by side with each other.) Our old manager granted that to her but it never turned into a written agreement. That was over two years ago. Betty calls out sick twice a month after her weekend claiming she has the flu or food poisoning but comes back the next day like nothing ever happened and takes four 10 day vacations a year. Is that stressful on me? Yes, but I’ve always managed to get through it. However, when I’m sick (which is rare - I have to feel like I’m dying to call out), she refuses to cover me or anyone else even though I’ve covered for her countless times working doubles when she calls out. Betty is always ready at the minute her shift ends to leave whether someone is here or not for coverage and leaves me high and dry.\n\nI normally don’t care about someone taking vacation as that is part of our compensation. I put my vacations in as soon as my vacation renews so there’s no need to fight over it. One of them includes my one year anniversary with my boyfriend right after New Year’s. Betty came up to me two days ago and said that she talked to our ASM about getting January 2nd through the 10th off for a wedding she has been talking endlessly about. I get the excitement but I told her, “Unfortunately, that’s not going to work because I have January 2nd through the 6th off as January 2nd is my one year anniversary with my boyfriend and I won’t be on this side of the state. One of us has to be here.” Betty looked at me shocked and said, “Well can you change the time you go out of town? We already put the deposit on the venue.” I looked at Betty and said, “This is why I have the planner for us to put our vacations in so we know when either of us is gone and there’s no overlapping issues. I’ve had this time off approved since the end of July and I’m not willing to change it or give you my planned vacation time that works for my boyfriend and I before he begins his next quarter of school.” I could tell that Betty was furious and all I got was, “We’ll see about that.”\n\nBetty went up to management today and lied to them saying that I agreed to change my vacation in January so she could get married. Management came up to me on the sales floor in front of her and said it was generous of me to change my vacation for her life plans. I WAS PISSED. I turned to Betty and said, “What on God’s green earth made you think it was a good idea to lie to management? I never have stopped you from taking a vacation in the past nor did anyone else here. But I told you I’m unwilling to change my anniversary trip to another weekend so you can get married. I’m sorry you’ll be losing money but you have to pick a different day.” This is where I turned to management and told them, “If you still approve this, not only will I go to corporate and the union and complain but you’ll be looking for a new manager for this department. I will not be treated this way for one person to get whatever she wants.”\n\nBetty was infuriated with my response to the point where I saw her starting to cry as she said she needed a minute. A slight part of me feels bad for blowing up but in this situation, she only did it to herself.\n\nAITAH?\n\n**AITAH has no consensus bot, OOP was NTA**\n\n**Relevant Comments**\n\n**Commenter 1:** NTA. She doesn't get to lie to management to get her way. You claimed the days first. Be aware -- she's likely going to try to sabotage. You and your manager need a plan ready to go if she quits right before or just doesn't show up. If you're caught unaware, it's 100% on you guys.\n\nWhat country are you in that she gets this much PTO? Four 10-day vacations??\n\nI have zero problem with her getting Thursdays and Fridays off -- like it or not, that was agreed to when she was hired. I also have no problem with her not picking up extra shifts. That is NOT required. She doesn't have to be a \"team player;\" this not a \"family.\" It's a job.\n\nCalling in sick on a predictable basis IS a problem -- and should be HEAVILY documented. Explain the issue to your direct manager and to HR. Ask them how you can handle it because it's not all right.\n\nTrack ALL of her call outs with details about when (relative to the shift) she called out, who was available to cover, what her excuse was, when it happened relative to her other days off, if it was on a holiday or especially busy period, etc. If you have access to her social media, see if she's posting pics on those days -- or pics of partying the night before. Build a detailed file.\n\n> **OOP:** I live in the US and how it works with my company is the first 10 years in the company, you only get 90 hours of PTO. Between 10 and 12 years, you get 100 hours. 12 to 14 years, you get 160. 15 and above, you get 200. Allotted PTO is based off of how long you’ve worked for the company. I just hit 12 years in July, so I’m at the 160 hour mark. Betty has been with the company for 3 years so she only gets 90 hours PTO and the rest is UTO which employees don’t get reprimanded for as it’s a requested day off.\n> \n> I do have a year’s record of her call outs but not just her, everybody. Including myself. I didn’t want anyone to feel targeted and I make sure that everyone knows I keep track of this stuff including me. I have presented her attendance issue not just to upper management but to both DMs on the company’s side and Starbucks (since I deal with both). They have spoken to my manager and nothing has happened. At this point, it’s on him.\n> \n> I do also have the morning crew alert me if she called out and I come in sooner as the department is my responsibility to keep it up and running.\n> \n> Another thing I forgot to add in, agreements that are not written with previous management are null and void when new management steps in in my company. But Betty goes to the union each time something doesn’t go her way, forcing management to roll on their backs.\n\n**OOP responds to a downvoted comment about when she got hired at the company at a such young age** \n\n> **OOP:** I’m 31 and got hired right before I turned 19. Technical and community colleges accept people well beyond 18 for education in the US.\n\n**OOP explains what happens if she and Betty can't be off at the same time even if it's for a few days**\n\n> **OOP:** If the main manager is out, the assistant needs to be present. Vice versa. Basically, a manager needs to be present each day regardless how it works out.\n\n**Commenter 2:** Betty is an entitled brat but you could have picked a fight with her on any other time that wasn't her wedding. \n\n> **OOP:** I understand your point. The wedding just came up within the last week months after I had the time off approved. My boyfriend is in school and this is during his vacation. It would be one thing if I could pick a different weekend with my boyfriend even with major holidays being a blackout period but to lie to management to take my vacation time after it was approved months ago is not okay with me. I won’t roll on my back for that.\n\n**Commenter 3:** NTA - why is Betty still employed there?\n\n> **OOP:** We’re a union so it’s very difficult to fire someone.\n\n**Can OOP go to the union and report Betty since she lied to the management?**\n\n> **OOP:** I have talked to my ASM *(editor's note: assistant store manager)* about her attendance issues and there has already been a problem with Betty going to corporate and making a false accusation on HR. Nothing has been done on their end. I can only make so many suggestions to them about having a documented conversation when they don’t seem interest.\n> \n> We are a licensed store. Not a franchise. So we are technically employees under the other company in the partnership (Kroger company) and union.\n> \n> It’s very hard to just fire people in a union. There has to be damning reason and fighting for time off that was approved months ago for a last second notice is not grounds for termination. Dishonesty is but they don’t do anything about it.\n\n**Commenter 4:** It doesn’t sound like Betty is doing anything out with her rights on any of your background info. You’re the manager, if there’s no coverage at the end of her shift that is a YOU problem. It sounds like you need to hire another person.\n\n> **OOP:** I understand your point. We are a partnership kiosk, not an actual franchise store. I already work six days a week and can’t work a seventh. That’s part of our union contract. If it happens on my day off, Betty is in charge so it becomes her responsibility to find coverage much like how it is my responsibility to do the same when she calls out. That much I understand but I tend to work doubles since my closers can’t come in early due to school interference. I wish I was a part of the hiring process but HR leaves department managers out of that\n\n**OOP clarifies on the pay cut for her position**\n\n> **OOP:** I actually didn’t take a pay cut for this position. I was under the impression that I was going to get a raise for being in a manager position but they took that away so I kept my current pay and the tips make up for it.\n> \n> I developed the habit of tracking things very early on in life so this is just natural habit at this point. When I was the bookkeeper, management also wanted me in three other departments helping out and I got to a point where I just wanted something stable and reliable for work and this was my ticket.\n\n**Has OOP spoke with the proper district managers of her company about the situation with Betty and the days off?**\n\n> **OOP:** I have already spoken to Starbucks DM and my company (Kroger) DM about her in one of my planning visits. I didn’t have to mention her work ethic as they already knew about it but I did mention and present how often she calls out, stating that her attendance is a liability. I know it was put in an email because I have it printed out in a file in my locker with my boss CC’d in it but nothing on his end was done about it.\n> \n> As far as her days off go, that was the least of my issues with her because I have a set day off each week. However, we’re going through some scheduling changes to where Thursdays and Fridays off for Betty is not doable for business purposes. I even had to change my day off which I was fine with. There’s a couple problems with the Thursday Friday weekend for Betty now. 1.) Not doable for business purposes. 2.) That was a non written agreement under different management so that agreement is now null and void. Our current manager doesn’t need to honor that. 3.) She’s pulling everything she can to get her way. Even if it means calling the union.\n\n&nbsp;\n\n[Update](https://www.reddit.com/r/AITAH/s/dCFKNbfYB1): **November 18, 2025 (one month later)**\n\nAITAH for telling my assistant she can’t have her vacation? ***UPDATE***\n\nOkay, so the original has been posted a month ago and while plenty of people wanted updates, I waited for more to unfold.\n\nFor a recap, my assistant, Betty, asked me to reschedule my one year anniversary trip with my boyfriend so she could have her wedding to which I declined. Then, Betty went to management and lied saying I would do it for her only for it to blow up in her face.\n\nOne thing I forgot to add in the original is that I keep a planner in the department not just for important things coming up like a launch or sale dates but so Betty and I can put in our vacation and work around each other so no vacation overlaps due to previous problems last year. And yes, Betty is fully aware that this exists. I not only put my vacation time off in the system but the planner as well as soon as my vacation hours renew (all vacations six months to a year in advance) so there’s no question of it.\n\nFast forward to today, Betty did it again.\n\nI was flipping through the planner so for the coming months, I knew what to expect and have a plan weeks in advance of important dates. I knew Betty scheduled her wedding date but didn’t know when. I only had the hint that it would fall towards the end of May to early June (in a local park you can rent part of for the day…no shaming but I know that dates can be switched easier than an actual venue) which works for me as I will be around. For the last four months, I have been pretty vocal with my plans the week of the 21st through the 27th of June as my boyfriend and I will be going to Yellowstone as an End Of School Year/Summer Kick Off vacation. When I saw the month of June, I noticed she wrote in her wedding day falls on the start of my vacation.\n\nThree days ago, Betty looked at me and said, “I know you’re excited about going to Yellowstone in June and you’ve been planning it since the end of March but I was hoping you would do me a favor and push your trip back so I could have my wedding day. I scheduled it for the 21st.”\n\nI looked at her in disbelief because apparently, she didn’t get the hint the first time. Yes, I did have to gather my thoughts because it’s clear to me she is doing this on purpose at this point.\n\nI calmly told her, “No. We have been down this road and I’m not rescheduling anything I’ve had planned and approved on work’s end for months because you planned poorly. I’ll also remind you that we have a planner for these reasons - to schedule around each other’s vacations so nothing overlaps. We are both in leadership roles so when one of us is on vacation, the other has to be here.”\n\nBetty stayed silent and I saw her face turn red. But instead of giving her the opportunity to lie to management again, I went up and said something. I showed my boss the planner and our system and that this is a problem she doesn’t see. I made it clear, “Even though it shows one day, expect her to call out the next day or two. I will be in Wyoming and not willing to change anything as this trip is half of my boyfriend’s big Christmas present.” Management confirmed that her day off has not been approved and she will need to rearrange the day as I got approved first.\n\nBetty did look like she wanted to cry because she is not getting the princess treatment she wants but she also doesn’t realize that other people have lives too. I do fully expect her to call out and leave the department high and dry like she has done MANY times in the past, especially while I’m gone. We will see what happens.\n\n**Relevant Comments**\n\n**Commenter:** What kind of person books a venue for a day that they know they have to work?\n\n> **OOP:** A local park. She does because we all know she’s going to call out but what she should know since she’s called the union so many times making false accusations is that if she calls out on a denied request then that’s grounds for termination.\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p63tbk/aitah_for_telling_my_assistant_she_cant_have_her/","permalink":"/r/BestofRedditorUpdates/comments/1p63tbk/aitah_for_telling_my_assistant_she_cant_have_her/","score":3599,"num_comments":390,"over_18":false,"stickied":false,"created_utc":1764046926.0,"edited":0.0,"link_flair_text":"ONGOING","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p63rrb","name":"t3_1p63rrb","subreddit":"BestofRedditorUpdates","author":"Choice_Evidence1983","title":"AITAH for refusing to break up with my white girlfriend after my mom and sister demanded it?","selftext":"**I am NOT OOP, OOP is u/Party_Sign_6753**\n\n**Originally posted to r/AITAH**\n\n**AITAH for refusing to break up with my white girlfriend after my mom and sister demanded it?**\n\n**Trigger Warnings:** >!emotional manipulation, racism, bullying, favoritism!<\n\n----\n\n[Original Post](https://www.reddit.com/r/AITAH/s/na6YJVOaou): **November 16, 2025**\n\nI (20M) introduced my girlfriend (19F) to my Arab family last week, and it was a disaster lmao.\n\nFor context: I've never had a great relationship with my mom or sister (24F). My mom is a \"girl mom\" who treats my sister like her best friend while I was always treated like a burden. Growing up, my sister and her friends bullied me until I hit a growth spurt. My mom treated my sister's boyfriends better than she ever treated me—she once told one of them he was better than me and wished I could be more like him lol.\n\nMy sister almost exclusively dated white guys in college, and my mom actively encouraged it. She'd say Arab men are \"uncultured, backwards, and have big noses\" and tell my sister to find a \"nice boy with blue eyes and a small nose\"—while I was literally in the room. I have a stereotypical Arab nose and have always been insecure about it, but when I told her this hurt, she said I was being too sensitive.\n\nI threw myself into sports and academics, got into my dream university, and met my girlfriend there. She's an Irish international student, and we clicked instantly. I'm even thinking about proposing eventually, so I wanted her to meet my family first.\n\nMy dad seemed happy, but my mom and sister were ice cold. During dinner, my girlfriend offered to help with dishes, and my mom apparently told her nasty things while they were in the kitchen—that white people don't care about family, that Arab women are better, that my girlfriend might be after my dad's money, and even implied she was promiscuous. My girlfriend came back and looked awfully quiet I even asked her if everything was alright and she said yes and I didn't think much about it.\n\nThe next day, she called me in tears saying she wasn't sure our relationship could work because of my family. When I confronted my mom, she said I needed to \"consider the family's opinions\" and settle down with a nice Arab woman. When I protested, my sister started crying and yelling that I was hurting her feelings because \"Arab men hate their own kind\" and now her little brother is no different.\n\nThey both cornered me, demanding I break up with my girlfriend. My dad tried to help, but once my sister turned on the waterworks, he went to console her instead.\n\nI refuse to end things with my girlfriend over this hypocrisy, but now my family is furious with me. AITAH?\n\n**Edit:** hey y'all thanks for all the support it means a lot to me. I've posted an update as well.\n\n**AITAH has no consensus bot, OOP was NTA**\n\n**Editor's note: OOP has made lots of responses, I am posting the top common questions asked and responses**\n\n**Relevant Comments**\n\n**Commenter 1:** NTA. And you can consider then reject your “family’s” (your mom’s) opinion on the grounds she is openly racist\n\n> **OOP:** Thank you! I'm utterly confused here because this is the same woman who used to encourage my sister to only date white guys I even thought that in some fucked up racist way she'll be happy that I found a white girl. I don't even know why she's upset.\n\n**Commenter 2:** NTA Your mom and sister have this weird notion that Arab women are great and Arab men are horrible. You can call them out on this double standard, but it won't do much I'm afraid. Your dad might be treated in the same way but has been 'tamed'. The better choice probably is distancing yourself from your mom and sister and ignoring whatever they say. Also make it clear to your girlfriend they you will chose her over you mom and sister. Your gf sounds lovely!\n\n> **OOP:** Thanks my dad has gotten very used to all those comparative comments over the years stuff that would never go well with me, he's a very stoic man and he doesn't care much but I'm not that stoic and it's hard to let this stuff slide and yes my gf is very lovely she speaks 3 languages and plays the violin!\n\n**Commenter 3:** NTA. F your family. Don’t give up your relationship for people who have done nothing but antagonize and disrespect you. If your girlfriend makes you happy, brightens your day after your family has made you feel low and unworthy, stay with her and appreciate her.\n\n> **OOP:** Thanks I appreciate your kind words. I've put up with too much BS over the years and I'm not gonna let this one slide I'll find a way to get my mum to apologise. It's a long shot but I wanna let my gf know that I won't let people disrespect her. She's been very polite in general and I'm just worried that my mum must have said something really nasty to her. She says that she called her promiscuous but I bet she said something like white women are all 304s or something. This honestly makes my blood boil and I won't let this slide.\n\n**Commenter 4:** Your mum and sister are racist and sexist. They are happy for your sister to date a white man but feel insecure about you dating a white woman. Your mother and sister are both seriously lacking integrity.\n\nI broke up with my really lovely first girlfriend because her mother, was so hostile to me. I just didn't feel comfortable visiting her at home, and although she never treated me badly, she never stood up to her mother either. Our relationship eventually fizzled out.\n\nYou may have to go NC with mother and sister, sorry this happening to you bro. NTA\n\n> **OOP:** Well I'm not sure if I can go NC with them but I certainly will stand up to them, I certainly don't have the patience nor am I stoic like my dad to let this slide. As the only son my parents do expect me to look after the family which I'm glad to do so but I can't sacrifice my relationship for that and I do think if I take up more responsibility and really be the man of the house my sister and my mum can't push me around much.\n> \n>> **Commenter 4:** Hmm… they might try. Simply shutting down any open hostility may not be enough. They could act kind to your face but behave badly toward your girlfriend behind closed doors. When people can’t win in open conflict, the nastier ones often resort to doing things quietly and behind the scenes. I really hope I’m wrong though.\n>> \n>>> **OOP:** That's not actually uncommon I've heard that my grandmother used to do that to my mum when she first married my dad. It only makes it more confusing why she'd wanna do that to my gf.\n\n**OOP explains if he is still financially dependent on his family**\n\n> **OOP:** I have a scholarship and I'm only dependent on my dad and he's not cutting me off for any reason. He seemed to really like my gf. Her major is linguistics and my dad and her actually got along well they talked about middle eastern poets and he seemed impressed that she knew so much about our culture. It's just my mum and sister. I'm definitely not letting this slide I'm certainly gonna try to get them to apologise. It's a long shot but I wanna make a point they can't treat her that way.\n\n**Has OOP spoke with his father about the issues with his mother and sister?**\n\n> **OOP:** I wouldn't call my dad a weak man, he just grew up in a different world where a man's feelings didn't matter. He's a catholic refuge who migrated here during the 80s and he genuinely can't understand things like how my mum mistreating me affected me because it doesn't make much sense to him. He used to tell me stories about walking many miles to school and teachers beating the students with switches. In a way for him putting up with mistreatment is part of being a man. I don't blame him it's just the way he's raised.\n> \n> My mum's not one of those people who can be reasoned with but I'm not gonna let this one slide I'll certainly get her to apologise but my gf imagined having a great relationship with them and I'm just sad for her that it's probably not possible.\n\n+\n\n> Well he's very old fashioned like he regards my mum being unreasonable and irrational as normal. I used to complain to him about my mum and sister when I was younger and his response was almost always some variant of \"they're women they can be that way but you're a man so you have to endure it\". He believes that putting up with mistreatment from the women of the house is part of what makes a man. I don't blame him, he grew up in a different world before he moved to the states.\n\n**Has OOP's mother and sister treated him like this all of his life?**\n\n> **OOP:** Yea my mum and sister have treated me like dogshit for most of my childhood and it hurts that they're trying to do the same with my girlfriend. I'm not gonna let it slide this time.\n\n**Commenter 5:** Stick with your girl, OP. She sounds great. Don’t listen to your mom and sister. I see a double standard from your mom: your sister is allowed to date white men but you’re not allowed to date white women? NTA\n\n> **OOP:** I will but the double standard doesn't even make any sense to me lol. My gf was hoping to have a great relationship with them and it's such a shame that they won't let themselves find out what an amazing woman she is.\n\n**How did OOP meet his GF?**\n\n> **OOP:** Theatre group. I was pretty lonely in my sophomore year and I'm pretty tall almost 6'5 and I've been told I look scary so it's hard to make friends. So I joined the theatre club and guess what character they made me read for? Saddam Hussein lol. The theme was contemporary history and we had to enact this scene where a miscommunication between Saddam Hussein and the American ambassador April glaspie led to the kuwait invasion (the first gulf war). She read for the ambassador part we took some time to prepare for it and it was really fun ofc I met her but I also made lots of friends.\n\n**Is OOP the only son in his family?**\n\n> **OOP:** Well as the only son they expect me to look after them which I will but I'd certainly limit contact at least with my mum\n\n&nbsp;\n\n[Update](https://www.reddit.com/r/AITAH/s/4VBleHVf83): **November 17, 2025 (next day)**\n\nUPDATE: AITAH for refusing to breakup with my white girlfriend after my mom and sister demanded it?\n\nCheckout my previous post: https://www.reddit.com/r/AITAH/s/8Onzx6iHpe\n\nTldr toxic mum and sister bullied my white girlfriend when she came over for dinner and asked me to break up with her.\n\nHey everyone, thanks for all the support on my original post. I wanted to give you all an update.\n\nAfter my showdown with my mom and sister, they still refused to back down. The whole house felt very ominous. There were attempts to guilt-trip me, claims that she's manipulated me and has me wrapped around her finger you know, the usual BS. My dad finally did step up though. He told them to drop the issue and not bother me about it since I won't be home for long and will soon go back to uni, so there's basically a truce about the topic of my girlfriend.\n\nI tried calling her back but she wouldn't respond. She eventually texted me and asked how I was doing. We just chatted and pretended like nothing happened for a few minutes, but I apologized later. I feel kind of stupid about this—I should have known they'd do something like this. I have no idea why I gave them the benefit of the doubt lol. It's honestly really disappointing because she wanted to stay with us at our house and she was so excited to meet everyone. The plan was she was going to spend Thanksgiving with us and then I'd fly out to Ireland with her to spend Christmas and New Year's with her family, but it's a shame that it all went down the way it did.\n\nShe asked me to come over to her hotel, which I did, and we had a long, honest conversation about everything my family and our future. She was still upset, but I managed to make her laugh (which honestly isn't hard and it's one of my favorite things about her), and we ended up making love and really reconnecting.\n\nWe've agreed that I'm going low contact with my mom and sister. It's just them who have the problem anyway but my dad genuinely likes her and they got along great. He was really impressed when they talked about Arab literature and poets (she's a linguistics major with a history minor), so it's clear this isn't about her not respecting our culture or our backgrounds.\n\nI asked if I could arrange some kind of intervention to make my mom and sister apologize, but she refused. She doesn't want to see or talk to them, and honestly, I can't blame her after what they put her through. At least she likes my dad. She's still staying at the hotel and I can't even ask her to come stay with me after what my mom did. We're supposed to go back to uni after Thanksgiving, but she says she wants us to leave now, and honestly, I can't blame her.\n\nWe even joked that every good love story needs a few adversaries and obstacles to overcome lmao.\n\nI won't be spending Thanksgiving with my family this time, it'll just be the two of us, which is actually not so bad. Maybe we'll find a place close to campus to crash. I think some of our friends live nearby so there's always that possibility. As of now I just wanna let her heal and not rush things. \n\nAfter what happened with my folks, I don't know if it's the best idea to spend Christmas and New Year's with hers either. I've spoken with her sister before (who's cool), but I haven't spoken to her mom yet. My girlfriend just dropped a bombshell, she's vaguely mentioned to her mom that she's dating a Catholic guy in college, and her mom seemed happy about it, but she doesn't know that I'm Arab. She swears her mom is chill, but after what just happened with my family, I'm worried it's going to be a repeat from the other side.\n\nMy mom's probably gonna be pissed that I won't be home for Thanksgiving, or maybe she won't care idk one thing I've learnt is I clearly can't predict what this woman will or won't do but this is the least I can do for my girl considering what my mom did to her.\n\nSo yeah, my girlfriend and I are solid and committed to each other.\n\n**Editor's note: again, OOP has made lots of responses in the update post, I am posting common questions asked and responses**\n\n**Relevant Comments**\n\n**Commenter 1:** People like your mom won't take kindly to being told no or losing their punching bag. I suggest double checking if you have everything important with you in case she retaliates. All your papers, accounts and so on. Maybe try and meet your dad alone.\n\n> **OOP:** I don't think they'll go that far but there isn't anything important that I've left at home except for my passport and some ID maybe but I'm leaving tomorrow so I'll take them with me. Nothing to worry about.\n> \n>> **Commenter:** Lock your credit. You left your ID there, wouldn't put it past your mother to take up some loans as \"restitution\".\n>> \n>>> **OOP:** Well I don't think she'll do that but she doesn't know what I'm up to lol. I'll be leaving early in the morning tomorrow and I'll only be telling my dad, he can tell them why I left early.\n\n**Commenter 2:** I'm so glad you and your partner are about to support each other through this.\n\nIf she's up for it, it is the perfect opportunity to meet her folks this Xmas.\n\nIt will either be a lovely time. Or you'll understand where both folks stand early and can discuss options moving forward.\n\n> **OOP:** It's been a bit tense with everything that just happened so I don't wanna bring up anything for at least a week maybe then I'll talk to her about it. It's very likely that I'll probably fly out because she's asking her mum to buy tickets for us which again worries me more she's probably expecting some catholic white guy and I'm gonna show up lol. Anyways I hope for the best and maybe it will turn out fine.\n\n**Commenter 3:** INFO: I just read your original thread. Did you ask your mom why she pushed her daughter to be with a white guy with a small nose and blue eyes but she was against you having a white girlfriend?\n\nEnjoy your holidays with your gf. I really hope her family embraces you\n\n> **OOP:** I can't reason with her. Logic is something that's completely foreign to her. She'll probably gaslight me more. I tried mentioning that she didn't have a problem with my sister dating white guys but she just deflected.\n\n**Commenter 4:** Welcome to adult life with a dysfunctional family kid. I came here to say 2 things. Before going to her family make sure she tells them all that your Arab so you don't have this same problem. Stop feeling self conscious about your looks. I spent a lot of time in the Middle East and a lot of Arabic men are sexy as hell and obviously your girlfriend thinks so too. Good luck.\n\n> **OOP:** Well her sister knows that I'm arab. I don't think I'm ugly or anything I get compliments all the time and I've done well dating wise. I'm tall (6'5) and I'm pretty athletic. So I'm aware that I'm atleast moderately attractive but again when you're a kid and your mum's telling your sister to find guys with blue eyes and small noses it's just hard not to take it personally lol. Even if I was a white guy that probably would have given me a complex about not having blue eyes or blonde hair.\n> \n> But you're right though I should probably ask her to tell her mum that I'm arab but again we just calmed down after the shit show that we went through so I'll give it some time maybe a week or so before I bring this up again. I'm not so sure if I have that much time, her mum might buy tickets sooner but we'll see.\n\n**OOP clarifies on his Catholic background**\n\n> **OOP:** I'm actually catholic yes but I'm a maronite catholic (Lebanese). Some of our practices have changed a lot particularly for the current generation but it's still a little different from irish catholicism. I have attended roman rite parishes when I was younger before we found our maronite churches basically our liturgies involve a lot of Arabic and mass times are longer.\n\n**OOP should consider about getting therapy**\n\n> **OOP:** Thanks i appreciate your concern. I'm feeling so exhausted with all my work and I don't know when I'll find time for therapy if I can afford it. I think there's probably a counsellor at my uni but I haven't checked it out yet. I'm just focused on keeping my girl safe for now before I could think about myself.\n\n&nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p63rrb/aitah_for_refusing_to_break_up_with_my_white/","permalink":"/r/BestofRedditorUpdates/comments/1p63rrb/aitah_for_refusing_to_break_up_with_my_white/","score":1428,"num_comments":165,"over_18":false,"stickied":false,"created_utc":1764046807.0,"edited":0.0,"link_flair_text":"ONGOING","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6sy88","name":"t3_1p6sy88","subreddit":"BestofRedditorUpdates","author":"Direct-Caterpillar77","title":"I (20F) think my brother's (30M) kid (13M) is a psychopath or something","selftext":"**I am not The OOP, OOP is u/ThrowRA_ahhhhhhh**\n\n**I (20F) think my brother's (30M) kid (13M) is a psychopath or something.**\n\n**Originally posted to r/relationship_advice**\n\n**TRIGGER WARNING:** >!Homophobia, financial abuse, verbal abuse, physical assault, mentions of sexual assault!<\n\n[Original Post](https://www.reddit.com/r/relationship_advice/s/msPnZ8QNnI)  **May 16, 2020**\n\nI'm staying with my parents for quarantine. I live alone eight hours away, and I don't have many friends. I'm asthmatic and I don't have anyone to help me in case of emergency so I'm back with my parents for the pandemic.\n\nMy brother was a teendad and he has been married for about six years. They have two children together. One is thirteen and the other one is a six-year-old girl. My brother and SIL are here too, and I'm beginning to suspect that my brother's kid is a psychopath. (I'm exaggerating, maybe not a psychopath but something is definitely wrong with him)\n\nMy brother is not a bad person but he has changed since he met SIL so we don't see them often these days. SIL doesn't like us, especially me. I'm bisexual and I have a girlfriend, and SIL is against it. She constantly makes comments about it, and is usually bitchy towards me.\n\nHer daughter is lovely, and we get along well when SIL is not looking. She doesn't let her daughter come near me in case I \"rape\" her because I like girls. Whatever. I don't particularly like kids anyway, but I have to say her daughter is a smart little girl. I honestly wonder if she's adopted sometimes because she's not at all like her parents and brother.\n\nAnyway, back to the topic, 13M is rude, obnoxious and weird. He constantly parades into my room and rummages through my things. He stole my underwear and bra, and doesn't listen to me! He came into my room and actually CUT MY hair while I was sleeping. I woke up to see my head looking like a rat ate it! It was not much but he cut my bangs and I look like an idiot!\n\nI got so angry and I cried so hard, and SIL made a comment that I was overrreacting. \"It's quarantine, no one would see it.\" \"It'll grow back\" fuck that! HE came into MY room and CUT MY HAIR with SCISSORS! Doesn't that make her worry??? As his mother??\n\n13M steals a lot. He stole my earphones, clothes, my colours (I like to paint) etc and when I confront him about it, he says he didn't take it. When I search his room and find it, he says it's HIS and not mine. HOW CAN A WOMAN'S BRA BE HIS?? That's right. It's his GIRLFRIEND'S. There's always some excuse.\n\n13M is always rude to me and constantly makes homophobic and mean comments about me and my girlfriend. I can't even come out of my room without hearing something hurtful. He's always asking me if I know what a real man's dick feels like. His comments are always weirdly sexual, but I feel like he's just repeating SIL'S words.\n\nI'm sick and tired of fighting about this with SIL and brother.\n\nMy brother always has some kind of excuse. \"He's a kid\" \"He's immature\" \"He's young\" \"Boys will be boys.\" I have heard it all. The truth is his mother is a monster.\n\n13M is also rude to his sister. He steals her food and shoves her when he's angry, but I have only seen it once or twice. \n\nAs I mentioned above, I'm asthmatic. I have two inhalers in case I ever lose one. My attacks aren't that frequent but it does happen. I have used my inhaler in front of him a few times, and I KNOW that he knows what it's used for. He actually STOLE my inhalers. He stole my new inhaler and went through my things and stole the SECOND inhaler as well.\n\nWhen I had an asthma attack, I couldn't find my inhaler anywhere. I freaked out and I was literally gasping for breath. My mom had to search his room for my inhaler. I finally got it, but he didn't even look remorseful. He called me a freak and went back to playing video games like it was nothing. My mom yelled at him but my SIL said god was punishing me for my sins. What the fuck. It was HER son, not god! What is wrong with her? What is wrong with her son?\n\nShe dismisses everything her son does to me as \"it's god's way of punishing you\"\n\nWhat can I do in this situation? What can I do to survive the rest of quarantine with him? He's turning into a criminal or robber or a murderer, I don't know! I'm sorry for the rant. I'm angry and baffled. I have to deal with this kid and listen to homophobic shit everyday and also suffer without seeing my gf. I feel like I'm losing my sanity. Please give me any advice you can. Thank you.\n\nTL;DR : my brother's kid steals my things. He stole my inhaler and called me a freak. He cut my hair while I was sleeping. He's rude and weird. His mother doesn't think there's anything wrong with him. She says it's gods way of punishing me for being bisexual. What can I do to survive the rest of quarantine with these people?\n\n**RELEVANT COMMENTS**\n\n**anbrosiabelle**\n\n>That’s terrible. Sorry you are going through this. I haven’t any advice to offer, aside from maybe finding a way to move out. Sorry can’t be much help. What do your parents say about it?\n\n**OOP**\n\n>>My dad just had a surgery and is on bed rest. My mom does scold my nephew, but he doesn't listen because his mom is on his side. My brother is the only person they'll listen to and no matter how much my mom shouts at him, my brother just apologizes and doesn't do much.\n\n[Update](https://www.reddit.com/r/relationship_advice/s/Zl3zOKWk29)  **May 21, 2020**\n\nHello. Thank you so much for all the support you have shown me. I didn't think so many of you would reach out to me and offer help. I'm truly grateful. Some of you were so nice that it made me teary. It's so amazing that people that don't even know me can be so kind to me when my own family is acting like this. Thank you. I appreciate it.\n\nI have to warn you that this might be long. I'm back in my apartment and in a considerably better mood. I might end up talking a lot about myself haha. Sorry about that.\n\nAfter posting on reddit, I actually decided to buy a lock, but I didn't get to buy it. Before that, my SIL and I had an argument. She actually tried to set me up with our neighbour who is married and is forty-two years old. I'm pretty sure his wife is a doctor and they are very much still together. She's not home right now, but she's a DOCTOR. It could be because she's busy, but for some reason, my SIL believed that his wife left him, and tried to talk me into going over to his home to help. \n\nI don't know what she was thinking. That would be so awkward?? Trying to seduce a married guy in front of his kids?? Why would I do that? I can't understand her thinking at all.\n\nI refused to do that, and she wouldn't stop pestering me. At night, I ended up video calling my gf in the living room, hoping SIL would see it. Looking back, I shouldn't have provoked her. My niece actually saw me talking to my gf and asked me who it was. I could literally feel SIL glaring at me, but it would be rude to not introduce her so I ended up introducing her to my gf. \n\nThat backfired and after the call ended, SIL accused me of brainwashing/influencing her daughter. We ended up arguing about it, and she wouldn't stop saying very disgusting stuff like I was trying to “rape” her daughter (she didn't use the word rape. She said I was trying to do “gay things” to her daughter) or I was trying to “transfer my deformity” Those were the exact words. I don't even know what it means! Wtf.\n\nI know I should've fought back and stuff, but I don't have that kind of courage. I ended up just going back to my room because she wouldn't stop calling me names. I guess it was sort of my fault. It's her daughter so I don't think I have a right to say anything about that. \n\nAfter that, it was kind of quiet for a while, but the next day, I was taking a shower and my nephew went to my room again. I had been keeping my inhalers locked in this little safe-like box. I kept the key with me at all times, but that little demon threw my shoes, the box with my inhalers and some of my clothes out of the window. I did go down to the backyard and bring it back so I didn't lose anything.\n\nWhen my mom confronted SIL about throwing my stuff, all she said was that god did it. This was the last straw, and I felt like they really just wanted to get rid of me. Nephew had been banging and kicking on the door to annoy me too. He would also shout or scream when I didn't give him attention.\n\nI ended up calling my gf. I really didn't want to, because I was the one who encouraged her to go back to her parents because she was worried about them (They're really old, 61F and 63M) *Edit: I'm really sorry for saying 61 is old. I keep getting mean messages about it. I got it, guys. I'm so sorry. It was a mistake. Please don't get angry. I already got told off by a lot of people. Please stop messaging me about it. I'm sorry.*\n\nShe came to take me back the day before yesterday. We packed my stuff together and came back to my apartment in her car. My brother didn't even try to stop me and say anything. That hurt just a little bit, but that's okay. I didn't expect anything from him anyway.\n\nThe only small victory we had was my gf didn't answer any of my SIL's questions seriously. SIL kept hanging around us while we packed, and my gf made a joke out of all of SIL'S little comments. SIL made a small comment that we would go to hell and my gf said something like \"Yeah we'll have lots of kinky lesbian sex in this life and then meet you there.” I should've used that trick this whole time. I didn't know it would work.\n\nI'm now back in my apartment, and I'm in a much better mood. I just talked to my gf's mom and she's just such a sweet person. She told me I can go there anytime, and it really made me happy. \n\nSo yeah, it may not have been the perfect ending. I also lost my colours and stuff which nephew hid somewhere, but I guess I'm okay. I can just buy more. I know some of you were like “punch them both and throw them on the street” but yeah, I can't do that. I'm sorry. I can't tell my brother and SIL to get out.\n\nThere are many reasons for that. First of all, my dad just had a heart surgery and my mom is not in a good place emotionally. My SIL is a bitch to me but she's very helpful and she's the one taking care of MY father. My brother is supporting my parents financially which is something I can't do at the moment. Telling them to get out is the most selfish thing I can do at the moment.\n\nThank you for all the help though. I won't be seeing my brother and SIL for a long time, and I'm happy I don't have to worry about that anymore. I was hoping my brother would at least say something, but it's alright for now. Maybe he'll come to his senses some time in the future. \n\nFor now, I'm just going to spend the rest of quarantine in my own apartment and try to enjoy some time with my girlfriend. Thanks :)\n\n**THIS IS A REPOST SUB - I AM NOT THE OOP** \n\n**DO NOT CONTACT THE OOP's OR COMMENT ON LINKED POSTS, REMEMBER - RULE 7**","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p6sy88/i_20f_think_my_brothers_30m_kid_13m_is_a/","permalink":"/r/BestofRedditorUpdates/comments/1p6sy88/i_20f_think_my_brothers_30m_kid_13m_is_a/","score":717,"num_comments":136,"over_18":false,"stickied":false,"created_utc":1764115672.0,"edited":0.0,"link_flair_text":"CONCLUDED","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ky4o","name":"t3_1p6ky4o","subreddit":"BestofRedditorUpdates","author":"ToiIetGhost","title":"AITA for bashing my sister in the head with a Christmas present and telling her to consider me dead? (6 parts)","selftext":"**DO NOT COMMENT ON LINKED POSTS. I am NOT OP. Original post by u/Junior_Duck8089 in r/TwoHotTakes**\r\n\r\ntrigger warnings: >!violence, abuse, attempted murder, cancer!<\r\n\r\nmood spoilers: >!hopeful!<\r\n\n*Editor’s note: I made slight grammatical changes and altered some titles. To break up the wall of text, updates are marked with 🔻 and comments with 🧬.*\n\r\n———————————————\r\n\n&nbsp;\r\n\n🔻🔻🔻🔻🔻\n\r\n[**Part 1 - AITA for bashing my sister in the head with a Christmas present and telling her to consider me dead?**](https://www.reddit.com/r/TwoHotTakes/comments/172dljm/aita_for_bashing_my_sister_in_the_head_with_a/) - **7 Oct 2023**\n\nSo this situation happened December of last year, just before I left for a college program in Orlando. I (20F) have never gotten along with my younger sister (18F) who has various mental health issues and a personal vendetta against me I will never fully understand. She hurt me a lot when we were kids, and not in a “sisters hair pulling” kind of way. We’re talking burning me with irons on purpose, trying to hold me under the pool water when my parents weren’t around (she’s a larger girl compared and later on I’ll explain why this is), cutting my hair, cutting me with scissors, ripping heads off my dolls, and even would tell lies about me at school- like how she said I got hit by a bus and died in the 5th grade.\n\nWhen I was a sophomore the issues between us only got worse and worse. I started trying to stand up for myself more and while my Mother would separate us when things seemed to go too far (because I’ll admit I’m no angel, I had my share of unkind words and jabs), however when we stayed at my Dad’s it was a much different story. He would go into his room and sleep if get so angry he couldn’t handle it, so he walked away; which would lead to my worst nightmare.\n\nWhile eating dinner I tried to pause the tv to use the restroom and my sister got mad. I told her not to unpause it until I came back, but she didn’t wait for me and I got upset and called her a bitch. Again, I had my fair share of insults, but never one time had I been violent with her- I’ve only ever put my hands up or ran away.\nThat day, however, she decided violence would be the only answer to my calling her that as she took the steak knife from her dinner plate and held it to my neck. It was like time froze for me. I don’t even remember to this day when she put it down or how I ended up on the floor- just the smell of the food, the way it felt against my neck, and that she said she wanted to kill me.\n\nI do remember running to tell my Dad, but he was out cold and so instead I went to bed and put a chair behind my door because I was scared. I actually called 911 but ended up saying it was an accidental dial because I was scared of what they would do to my sister.\n\nThe next day my grandmother picked us up and took me to school (my mom homeschooled my sister after finding out she was bullying some girls at her school and stealing money from my grandmother’s fundraiser- she also had kids sign a ‘petition’ to rename me as ‘dumb hoe’ or something) where I had a full on panic attack in the bathroom mirror. I don’t know what caused it. I may sound dramatic but I really only remember bits and pieces of what happened that day to lead me to the counselors’ office, where I spilled everything. \n\nI waited in her office for what felt like a million years when my Mom came in along with a police officer and my grandma (Dad’s Mom).\n\nTwo days of sleeping at grandma’s later, we get a call my sister is in a jail cell for the night. She had attacked my mother, who recently had stomach surgery, and tried to hit her in the stitches. My mom ended up going to the hospital because of the bruising and my sister was trying to claim child abuse after my mother got her to the ground by the back of her neck. She only managed to call 911 because my grandpa lived one house away and heard all the commotion.\n\nShe ended up admitting to the officers she didn’t want to kill my mother but she “really really wanted to hurt (my name) because she took my life.” I still don’t know what she meant by that.\n\nFast forward after various behavioral facilities, ins/outs of public school, and multiple different medication/therapy trials- she and I started to get better during the pandemic, though there was an entire city distance from each other. She still made comments about me and would fly off the handle but she hadn’t been violent in a long time.\n\nNow that you know our history, let’s go back to December: The first incident was when dad dropped a Christmas present she’d gotten her dog and the paper scratched a bit. She waited until he went back to grab more from the house and (with me in the back seat) took his phone, keys, and wallet before trying to speed off and nearly wrecking us into the neighbors fence before my dad jumped infront of the car and started banging on the window. Mind you, her therapist had informed my dad to tell any family of ours to record this kind of behavior: so that’s what I did. I sent it to my Mom to talk to Dad about later (I try to seem involved as little as possible on her mental space). \n\nAt Christmas with Mom, I won $200 in lottery tickets, and she won only $8 which lead to her wishing me dead and leaving without any of the gifts I’d worked to buy her.\n\nAnd finally, the straw that broke the camels back for me, was when she lunged at me from across the room while opening presents with my elderly grandmother and so I slammed the Christmas gift in my hand right into her face. She’d seen the video on mom’s phone while trying to send herself pictures of the day.\n\nBecause of this, in the eyes of some, I may deserve it- but I was done. And when she told me she hoped I got assaulted and murdered in Orlando, that she wished I never come home and claimed I’d ruined her life, I was broken. She ran off crying and I chased her into the other room telling her that she should consider me a stranger. As far as she was concerned, I wasn’t family to her anymore and she was dead to me. \n\nI go home today. I have had her blocked on every piece of media or contact possible, I even deleted any pictures of us. I am done with her. And these past 10 months away from her, with no contact, have made me realize just how much better my life is without the anxiety she brings in it.\n\nBut now that I’m coming home, my grandmother wants me to apologize even though my sister told her she hates to breath the same air as me, let alone see my face.\n\nShould I apologize and AITA?\n\nEdit: I have a LOT of people asking what I hit her with. It was a makeup mini fridge. Also I forgot to explain what I meant by why she is ‘larger’ than me. She had a growth spurt at the age of 11 and even (tmi) got her period before me. She’s struggled with weight loss her entire life after the fact.\n\n&nbsp;\n\n🧬🧬🧬🧬🧬\n\n&nbsp;\r\n\n**[deleted]**: She sounds like a budding murderer. I think you should go no contact for your own safety. She’s not your problem. Start a new chapter in your life and breathe easy for once.\n\n**MaydaysMom**: NTA I am surprised that your sister isn’t permanently institutionalized by now. Whatever help she has been given isn’t working.\n\nDo not apologize, your parents and grandmother should be apologizing to you for putting you through this your whole life.\nI would have an order of protection out against her with no end date. This is not normal.\n\n**TheAndreaDonoso**: This... just with the first paragraph I thought \"why is she not in a mental facility?\" Is not normal at all... unless OP is not telling everything and she did something really wrong or their upbringing was really violent, her behavior doesn't make any sense.\n\n> **OOP**: That’s something that’s always confused me: we have a good life outside of all this! We aren’t poor, aren’t rich. Middle class. Parents (had) split custody and got along well enough.\n\n**maccrogenoff**: NTA. You have nothing to apologize for so you shouldn’t apologize. The people who owe apologies here are every member of your family who didn’t protect you from your sister. They owe you apologies and reparations.\n\nI would advise you against living with your mother considering your sister’s violent vindictiveness and your family members’ inability to protect you. If I were you, I would move away, get a restraining order against your sister and not tell any of your family members where you live.\n\nYour sister wants to kill you. Take that seriously.\n\n> **OOP**: My mother has banned her from her home. That was our agreement when I agreed to move back in with her and my step father. I also informed my dad (a few minutes ago actually) me and my grandmother (his mom) who wants us to ‘let things go’ are only to meet in public places when I have my own vehicle so I can leave if she ever shows.\n\n**superwholockian**: NTA. WTF took you so long to disown her?\n\n> **OOP**: If I’m honest: mostly pressure by my family members. The only people who have never pressure me to get along with her in the past is my mother (who only speaks to her via text and sees her maybe once every 3 months at the restaurant my sister works at), my step father (he’s an officer himself now and actually knows some connections now if I choose to press charges in the future), my aunts and uncles on my mother’s side, my uncle (dad’s brother who was on my side for years saying something wasn’t normal about my sister), and my little brother.\n\n**catsmom63**: NTA. It sounds like the sister is a danger to herself and others. Does she go to therapy? Does she have a diagnosis?\n\nBased on the fact she has tried to hurt multiple people I don’t understand why she isn’t institutionalized by the state?\n\n> **OOP**: At first they thought it was a form of aggravated ADD and while others suggest personality disorders, the only real thing they can all agree on (she’s seen maybe 3 therapists, spent a week at a behavioral facility, and actively tried around 9+ different forms of medication) is that she seems to actually somewhat calm down when she’s on high doses of estrogen.\n\n> **StructureKey2739**: Seems?\n\n> **OOP**: It’s hard to tell at times because she sometimes also self-isolates. They often notice she is able to rationalize and act less impulsive when on high doses of estrogen.\n\n**Francie1966**: Do you have a friend you can stay with?\n\n> **OOP**: She lives with my dad at the moment because my mother banned her from the house when I agreed to come home to finish up my degree.\n\n> **[downvoted comment]**: There it is. You left the most important part out.\nSounds like that's what she meant by you took her life- right? You said she had no idea what that could mean.. but you literally took her place. I can see why the grandmother wants you to apologize.\nShe was displaced from her home when the favorite daughter came home. How would you feel if the situation was reversed? Not to mention you are taping her and sending it to people. I wonder now what was said or done that caused her to pull a knife on you.. or did that even happen? […] Both of you are violent and have severe issues. I hope you are getting help also.\n\n> **OOP**: I’ve tried to see in her view multiple times but I really can’t understand it. Like I said in my post, I’m no angel, and you’re right to say that maybe I could have been a better person/example at times. But I’m always the one who has to say sorry. I’m the one who has to let her do what she wants and cancel plans to fit her. I’m the one whose had to cut off family because they defend her actions and now I’m likely having to go LC with more after coming home. I’m no angel, but I don’t see how anyone deserves this feeling. I’m not looking for a pity party either I just want advice and (honestly) to rant. I can’t tell people about these things in my daily life. I’m from a small town where people talk and everyone knows everyone. Trust is hard for me here.\n\n**OOP** *on the extent of her sister’s injuries*: I really just reacted without thinking. It was so sudden I barely registered what I’d done until seconds after it happened. I hit her with a makeup mini fridge and there was a bit of red (not blood!!!) on the side of the face/head where I hit her with it.\n\n*On previous fights*: I’m not really much of a physical fighter. Aside from the Christmas incident and maybe a few hair pulls in self defense, I’m more of a verbal type gal.\n\n*On possibly confronting her sister in the future*: I don’t think I could ever do that. I’m too worried she’ll explode on me.\n\n&nbsp;\n\n🔻🔻🔻🔻🔻\n\n&nbsp;\r\n\r\n[**Part 2 - Need Advice!**](https://www.reddit.com/r/TwoHotTakes/comments/175dbgp/aita_for_bashing_my_sister_in_the_head_with_a/) - **11 Oct 2023** (4 days later)\n\nFirst off, thank you all so much for your advice and kind words. When I first posted it was (admittedly) more of a venting session due to stress more than anything but your recommendations and encouragement have helped lift me up in ways I can’t put into words.\n\nThat being said I feel it would be wrong to not update you all on my current situation, should anything happen in the future. And sadly, at this time, I do need more advice.\n\nThis week as I moved in I spoke to my Mother, who agreed (though I would have went through with it anyways) it would be best to go less contact with my grandmother and her siblings who agree with her. My Dad doesn’t like it but says he understands and won’t say a word about my whereabouts to my Grandmother until after the fact.\n\nHowever we have an entirely new storm about to brew: My Dad’s brother’s wife (my aunt) wants to do a big family picture as we haven’t had one since 2017, when things with my sister reached it’s peak.\nEVERYONE involved in this picture keeps bugging me about it. Sending me outfit ideas, texting me times and locations, asking me to plan poses for them (I was and still technically am a contract model which somehow makes me an expert in all things photography, despite me never holding a pro camera in my life???). I honestly don’t know how to say I can’t be in a family picture if my sister is there and, knowing them, if I ask them to choose between us I know it will end with them trying to make me compromise and be ‘as far away as possible’ or ‘make it quick and easy, we wouldn’t even have to talk.’\n\nIf you were me, what would you say? Because I really don’t know if I’m ready to be in the same room as her yet, if ever.\n\nDecision made: I will suddenly have a false positive Covid test this November. Thank you. (Also might steal that cardboard cutout idea if they give me too much shit before I put them in ‘time out’ as suggested by another user.)\n\n&nbsp;\n\n🔻🔻🔻🔻🔻\n\n&nbsp;\r\n\r\n[**Part 3 - Card in the Car**](https://www.reddit.com/r/TwoHotTakes/comments/17fmlcv/done_aita_for_bashing_my_sister_in_the_head_with/) - **24 Oct 2023** (2 weeks later)\n\n(Another update on my situation- if you aren’t up to speed all of my post are captioned the same but in parts as I update. These posts are not for ‘clout’ purposes and are strictly to update those concerned for my situation or give insight to those going through similar issues.)\n\nSince moving back home I have remained completely NC with my younger sister and LC with my grandmother (Dad’s Side). It’s been great. I have 3 job interviews scheduled, made a small amount of money taking up baby sitting jobs for relatives and friends. I will say my Dad has been much more supportive throughout the NC process than I thought he would be. He’s only mentioned reconnecting once and after I explained my reasoning for wanting to remain NC he immediately dropped it. This last week I did some home improvements at his place while my sister was at work and our paths only crossed once but we were in our vehicles as I was leaving so I never saw her face to face.\nFor those concerned about her pets, they seem to be taken care of well enough though part of the home improvements I worked on involved flooring that swelled from where she didn’t clean up the dog’s urine in a corner of her bedroom. Dad now charges her rent after that.\n\nInstead of paying me my Dad decided to give me a car. It’s his old one from work that he’s fully paid off and since he’s getting a new truck he won’t need it any more. The only thing is his old work car more or less became a driving trash dump. It’s littered with soda cans, food bins, old welding equipment, and (as I’d soon find) unused condoms. While I was cleaning it out at my Mom’s place I found a letter addressed to me under some of the trash. It seemed old enough with stains on it from whatever rolled on top of it. “My names on it- I may as well open it,” I’d thought to myself before realizing it was from my sister. 3 years ago. For my High school graduation.\n\nI never even knew she got me anything and honestly after seeing it I don’t know how to feel. I’m not sure why but it made me second guess if I’d been too harsh on her in the past, then I remembered everything she did and practically threw it in a drawer and walked away. That was two days ago. I just feel weird having it now and while I have no intention of contacting her still I wonder if there was ever a time she really cared for me. It may sound stupid and silly to some but she’s never actually written anything so nice to me or given me anything outside of Christmas. Not even for my birthday. Is it normal to question these things or think this way?\n\nEdit because I forgot: I am starting therapy in two weeks. Being a small town the options are limited, especially with insurance. I’m hopeful I’ll get in sooner.\n\n&nbsp;\n\n🧬🧬🧬🧬🧬\n\n&nbsp;\n\n**MissMurderpants**: What did the letter say? Did she start acting out on you as she became a preteen or has she always been like this towards you?\n\n> **OOP**: It started off when we were younger with things like cutting, burning, hair pulling, lying to people saying I was dead, etc. It has gotten worse as we’ve gotten older. The letter just said it was from her and I worked hard to graduate despite my struggles with ADHD.\n\n> **MissMurderpants**: There are some mental illnesses that start to manifest when people reach puberty.\n\n> **OOP**: I still wonder to this day if it’s not partly a hormonal issue. The more advice I get and the more people I reach out to about my situation the more I realize there is this huge emotional and mental issue, yes, but I wonder if there’s a more chemical aspect to it. A little TMI: She got her period before me and her body started to undergo its… female changes… at around 10-12 years old (I think 11 but I can’t be 100% right now). Around that same time her actions toward me seemed to get worse and worse. I’m getting tired of looking for answers I may never have tho so I’m trying not to look into her mental/physical health much further. I think trying to find a cause over all these years has almost driven me insane.\n\n**[deleted]**: Your sister sounds like the medical definition of a psychopath or psychopathic tendencies towards you at least. Maybe she resents you for being older, better looking (yes making assumption based on weight and the fact you said you model.) what could have started out as a childhood resentment for multiple reasons has grown into a full on hatred it seems like. You know what she’s like and what she has done to you, most everyone who has siblings has fought or still fights with them; I highly doubt the average gets a knife to their throat and ptsd over it though. So hold your ground for your own safety, the card could’ve been a few reasons: the abuser honestly felt bad for what they had done for a moment and tried to change, the abuser is trying to make you let your guard down so they can continue in their aggressive ways; or even possibly you parent(s) pushed her into showing a heart warming gesture for what some consider a life milestone. In any of those cases the guilt does not fall to you in anyway, choose your safety first. If you’re concerned for your family, well we can’t really make people change their minds, they have to figure it out for themselves more often than not.\n\nIf family keeps pushing, stick to your reasons and don’t forget them, and just say nothing can change until she gets some serious therapy… for years 😶\n\n&nbsp;\n\n🔻🔻🔻🔻🔻\n\n&nbsp;\r\n\r\n[**Part 4 - Mom has cancer. Taking the picture and leaving.**](https://undelete.pullpush.io/r/TwoHotTakes/comments/17rdzfp/deleted_by_user/) - deleted by OOP, recovered with Unddit - **9 Nov 2023** (2 weeks later)\n\nSmaller update: I didn’t get the teller job but they kept my resume for future positions. I did, however, get a job working for my Mother’s boss as a secretary. It pays well and I honestly am alone a lot so it’s been good for some self/reflection. I also got a boyfriend! He’s a little bit on the country side and we’ve had a few political debates but I’ve never had a guy make me feel this way. He’s become a major supporter of me and is actually a prison guard and state-trooper hopeful. I guess opposites really do attract sometimes, because while he’s out hunting deer I’m watch RuPaul’s Drag Race re-runs. I also dropped out of college. I couldn’t handle it atop all my other personal issues. \n\nThe bigger update(s): \n\nAs my caption says, my family has been hit hard by my mother’s recent cancer diagnosis. At first we were told since it was her thyroid, which according to the doctor is the ‘best’ type of cancer you can have, it should be a simple removal. Turns out it’s much more serious than that but I’m going to only speak lightly on it, as we are waiting to learn more before we tell anyone outside of direct family and I want to properly update on the situation. \nNow for the latest thing my family has tried to pull. \n\nI made a deal with my family. If my sister is there, I won’t be unless they make sure she stays a number of feet away. After that we go back to our regularly schedule NC.\n\nEveryone seemed fine with that. I said I’d get in a picture with her and Dad, who despite our issues I know would take her down if she tried anything. Am I going to put myself at some risk? Yes. But unlike the rest of my family I am driving myself and can leave at anytime, plus I’m a former model with the photographer they selected and he has been aware of our situation for some time as a close friend which gives me some comfort that he’ll move us as far as possible for photos. \nWhy did I agree? Because my LC grandmother is in bad health. I think that’s why she has pushed for us to ‘make up’ so badly which is no excuse in my eyes but gives me some clarity. It may be our last chance at a big family photo. I don’t want to deny my cousins of this. They have always loved and supported me. I feel security in knowing how many people are on my side and will be vigilant when it comes to her behavior. \n\n[*Editor’s note: I was unable to recover the image included in this post*.]\n\nThe message above however is between me and my Dad after my aunt texted in the group chat a paper detailing of what shots she really wants. One is me and my sister. Together. On a bridge. Alone. \n\nI sent the above message to my dad basically saying absolutely the f*ck not and I haven’t heard back since. Now that blanket of security I felt feels like it’s slowly tearing away after reading that and his lack of response. There’s still time to back out but now it would just cause even more bullshit and I’m honestly lost as to what to do.\n\n&nbsp;\n\n🔻🔻🔻🔻🔻\n\n&nbsp;\r\n\r\n[**Part 5 - Sister is at it again**](https://www.reddit.com/r/TwoHotTakes/comments/18pdjv1/update_to_aita_for_bashing_my_sister_in_the_head/) - **23 Dec 2023** (1 month later)\n\n(Hey guys! I have decided to start tagging as ‘personal write in’ since I’ve finally come to terms I can’t control these things and no longer need to question if I am at fault for me and my sister’s situation.)\n\nSo. My sister has started once again with her hatred towards me at the family holiday. I made the recent decision I would be civil so we can have Christmas all together for the sake of mom. I’m not sure if I ever mentioned this in my previous update but she was recently diagnosed with thyroid cancer since my coming home. Strange as it may sound the doctors say it’s the best cancer to have? Still, she’s scared to death going through something I could never understand and made the promise that she’d keep my sister as far away as humanly possible. Unlike other family members she didn’t really even push me- just suggested it. I hesitated but knowing how many events my mother has went without all of her children and all of the stress she’s went through lately I just agreed.\n\nI’m already starting to regret my decision. I don’t feel scared I’ll be physically harmed because if she tries anything I now have a 6’1” prison guard/self-declared gym ‘nut’ (my bf) to keep her away. He’s one of the few people who I’ve told everything to.\nAnd because he says he loves me I guess my sister hates him.\n\nShe messaged mom on Facebook a few weeks prior that if he came to our family gifts with us then she’d not show. That if I was at the gingerbread night she was going to leave. She never even came to gingerbread night yesterday and after mom posted Facebook images of the event my sister went crazy online. Posting how she’s the ‘stranger’ and black sheep of our family. Cursing out my mother in comment sections and even not coming to our extended family Christmas breakfast today because of it.\n\nMy boyfriend offered to just see me later Christmas morning and I told him it would be different if it wasn’t because she hates me. Like, if mom wanted it to just be family, I may be less comfortable but it’s fine because she never stays long.\n\nBut she’s targeting my bf because she hates me and refuses to show because of me being there- I just know I’ll feel a lot of guilt because mom is going to be so hurt and I really don’t know if she’ll come.\n\nI don’t really need advice here, I guess I’m posting today because my mind is full of holiday worry for a mom who may not be here next year and has always supported me through this.\n\n&nbsp;\n\n🧬🧬🧬🧬🧬\n\n&nbsp;\n\n**No_Astronaut2795**: If this is real, I have no idea why you would put yourself in this situation again.\n\n> **OOP**: I don’t want to, truly, but family means everything to me and I’d do just about anything for my mother except be alone in a room with this person or somewhere with people I know will always turn a blind eye to what she does. It’s unlikely my sister will come, and a big part of me is praying she doesn’t, but I know my mother will be hurt. Like someone else said- holidays come with unrealistic expectations and disappointment. Add that with her medical situation (which I must say the more people message me, the better I feel about it) and its just makes things so worse in my mind.\n\n**d0rm0use2**: 2 things. As a thyroid cancer survivor, it’s the “best” to have cause it’s easy to fix. You can survive without a thyroid and take meds. 2nd - screw your sister.\n\n> **OOP**: The more people have messaged me the better I have felt about it. I think it’s the word “cancer” in general that puts me into a spin. If it’s ok, do you mind if I ask if you had any struggles after? Health wise or physically. I am going to help her through recovery since my job is only part-time and I’ll be home more than others.\n\n**Floomby**: This is not within your power to fix, so set that particular guilt aside. You cannot control your sister. You cannot fix her mental health, or control her reaction to anything. Therefore, you cannot provide that perfect family reunion for your mother. You can show up for your mother, and that's it.\n\nIn fact, you should probably not even try. You were thinking that you should make the big sacrifice, swallow your pride, and be with your sister for a sweet bit of theater, but that nice Kodak moment would depend on your sister's desire for the same thing. But remember, your sister was not asked if she was on board with your plan, nor would it be a good or remotely realistic idea. So by absenting herself, your sister is probably doing the wisest thing. Your mother seeing you one at a time is much better than having you two get together and having a repeat of the huge fight.\n\nPart of the reason holidays make people sad is that they put wildly unreasonable expectations on them. Rolling up and expecting your sister to take that as a cue to fix whatever mental illness she hasn't ever been able to fix before is one of those expectations. So just be there for your Mom, and give Sister space for her time, as long as she isn't getting abusive with her. Worry about your own behavior, and let Sister deal with herself.\n\n**OOP** *on her sister helping out*: My sister would never be involved in Mom’s recovery process. She never has in the past when it came to liver and bowel surgeries. I don’t think she’s ever once even asked about Mom’s current health status, not to my knowledge at least.\n\n&nbsp;\n\n🔻🔻🔻🔻🔻\n\n&nbsp;\r\n\r\n[**Part 6 - Final Update**](https://www.reddit.com/r/TwoHotTakes/s/KiuLlNuKjl) - **1 Jan 2024** (1 week later)\n\n(Hey guys! Please no donations! I’m not asking for money of any kind and I did find a job so I’m no longer struggling as much financially. I do appreciate the willingness to give but I cannot accept. If you would like I’m sure there are plenty of charities that are willing to accept such and I’ll gladly give suggestions if asked, but again, I will not accept.)\n\nHappy 2024! It’s officially been a few days over a year since I’ve spoken to my sister.\nI’ve learned a lot in this time and the holidays went smoothly enough- I basically avoided her like the plague and we were only in the same room for a short time period surrounded by people I know wouldn’t stand for her behavior.\n\nIn a shocking turn of events- I got offered a modeling job earlier this week. It’s runway modeling and I’ll definitely have to start hitting the gym for it, but my boyfriend thinks it could help me with stressors in life and my therapist even thinks its a wonderful idea! Any tips? I haven’t been to the gym in almost 4 months and even then I just ran a treadmill.\n\nI don’t bring this up to brag or be one of those attention seeking “I’m a model omg love me” types I see online (I was friends with one of those. They do exist and they are not good to be around). I bring this development up as an example of my progress mentally.\n\nMy sister found out about this opportunity- more specifically, she found out it was in NYC- and of course she complained to my Dad about how it’s not fair I get to do these things, I’m the world’s favorite, I don’t deserve this, etc.\n\nIn the past I’ve always let her comments bother a small part of me. Maybe they didn’t choose me to win xyz prize because they liked my work, maybe I was second call for abc project, maybe I did get lucky when I won lmnop scholarship.\n\nI know this all makes me sound like a big baby to a few of you. I know some of you will say I’m exaggerating and my thought process in the past has been way out there- and I’m here to say you’re right in a lot of ways.\n\nI was being hard on myself, hard on my accomplishments, and letting the words of someone else impact my life. But until I decided to let that person go and I reached my own boiling point I didn’t take as much pride in these things. I made excuses for how they came to be instead of how I built myself to these things. And that part is a fault of my own.\n\nFor the first time probably ever I actually laughed when my sister tried to bring me down and I feel like my confidence is growing. My therapist says this is a sign I’m actually healing and not letting her takeover.\n\nI’m happy to say I finally feel like I’m making progress a year later.\n\n&nbsp;\n\n🧬🧬🧬🧬🧬\n\n&nbsp;\n\n**Floomby**: It's soooo super unfair that Sister didn't get a job she didn't apply to and isn't qualified for! How dare you apply for jobs and achieve things! You should call that job up first thing tomorrow and tell them to offer it to your sister instead or you're a big stinky meanie!! (/s)\n\n**Leayla**: I’m so proud of you. I’ve been following your story and your sister has serious problems. I’m glad you are distancing yourself from her. 2024 is going to be a great year for you.\n\n&nbsp;\r\n\r\n**Reminder - I am not the original poster. DO NOT COMMENT ON LINKED POSTS.** 🎁","url":"https://www.reddit.com/r/BestofRedditorUpdates/comments/1p6ky4o/aita_for_bashing_my_sister_in_the_head_with_a/","permalink":"/r/BestofRedditorUpdates/comments/1p6ky4o/aita_for_bashing_my_sister_in_the_head_with_a/","score":121,"num_comments":30,"over_18":false,"stickied":false,"created_utc":1764096832.0,"edited":0.0,"link_flair_text":"CONCLUDED","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
