{"id":"1p6kqld","name":"t3_1p6kqld","subreddit":"AmItheAsshole","author":"americanjohn500","title":"WIBTA for refusing to bring $100 minimum to Thanksgiving","selftext":"My family and I celebrate Thanksgiving every year with my siblings, parents, and their kids. Roughly 20-25 people (including kids). My family is only 2 people with one 6 month old baby.\n\nIn the group chat it was decided that my nephew would cook meat since he bought a grill. He also told us that we could bring the sides. He chose to spend $300 on meat.\n\nI messaged in the group chat that we would bring mashed potatoes. My sister responding that every \"family\" has to bring $100 worth of food minimum or help my nephew pay for the meat.\n\nI'm not totally against the idea of bringing that much food, but just the way it was presented and the fact that it wasn't agreed to beforehand makes me upset.\n\nThe following day in the group chat, my sister said: \"Option 1: bring food enough for everyone, not just yourself\n\nOption 2: help thomas pay for meet $100/family\n\nOption 3: help dad pay water bill $200/family.\n\nChoose wisely…\"\n\nUpset, I responded with Option 4: don't show up.\n\nAm I being an asshole if I don't show up at all in \"protest\" to this $100 minimum rule?\n\n\n\nUpdate: I'm a teacher and she posted a picture of my salary she found online to shame me in the group chat. Definitely not going now.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6kqld/wibta_for_refusing_to_bring_100_minimum_to/","permalink":"/r/AmItheAsshole/comments/1p6kqld/wibta_for_refusing_to_bring_100_minimum_to/","score":4375,"num_comments":1484,"over_18":false,"stickied":false,"created_utc":1764096387.0,"edited":1764097308.0,"link_flair_text":"POO Mode Activated 💩","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p667d3","name":"t3_1p667d3","subreddit":"AmItheAsshole","author":"Icy-Quantity-7383","title":"AITA for telling my sister that if she needs this much handholding I won’t have her babysit anymore","selftext":"I am very good friends with the woman across the hall from me. She’s a single mom to 2 kids (2 and 6) and I help her a lot with the kids. She handles school and daycare drop off, I do pick up and extracurricular activities, dinner’s a solid 60% her, 20% me, 20% restaurants. When school and daycare are closed, I’m typically the one that stays home with them because my schedule is more flexible. I do get paid for my help with the kids but I charge her below market rate for babysitting. \n\nThe older one is out of school all week. I also have the week off so I’m mostly home with him but earlier today I had a dentist appointment so I left my sister (18) with him for 2 hours. \n\nI left instructions saying that he needed to read for 15 minutes, could have 30 minutes of screen time, a list of things she could give him when he got hungry (things that require a slight bit of preparation but next to no skill: peanut butter sandwich, dino nuggets (with instructions), Kraft mac and cheese, etc.) with a note to give him a fruit and vegetable. I also told her to tell him that he can take the dog to the park for a chocolate bar and left some craft kits out. This should’ve been the easiest babysitting job ever. \n\nShe started texting me 10 minutes in with the most basic questions, like what is he supposed to read (there’s a shelf full of books in the living room), is he allowed to play with the toys on the table, he wants a snack, what should she give him for lunch, does she need to go to the park with him and the dog, does tv count as screen time. I told her any book is fine, she needs to go to the park with him, figure the rest out based on the instructions and common sense. \n\nWhen I got back dude was an hour into a movie and my sister was upset that I basically left her to fend for herself and that just because this stuff comes easy to me, doesn’t mean it does to her. \n\nI told her that I left her a page of instructions, toys on the table, a shelf full of books, and that she should be able to figure the rest out on her own but if she needs this much handholding, I’ll get another babysitter next time. \n\nNow she’s mad at me because I know she needs the money and it’s not her fault that she didn’t know what to do. \n\nNow I’m wondering if I was a little harsh because she always did need things to be spelled out for her ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p667d3/aita_for_telling_my_sister_that_if_she_needs_this/","permalink":"/r/AmItheAsshole/comments/1p667d3/aita_for_telling_my_sister_that_if_she_needs_this/","score":2639,"num_comments":697,"over_18":false,"stickied":false,"created_utc":1764055347.0,"edited":0.0,"link_flair_text":"Asshole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6hdqx","name":"t3_1p6hdqx","subreddit":"AmItheAsshole","author":"Complex-Rest3524","title":"AITA for telling my bil I'll be on a see food diet","selftext":"For context, I'm super pregnant right now. My husband (29M) and I (26F) have another child who is almost 3. I didn't have a positive breastfeeding experience with her, I'm determined to have a better experience with our 2nd. His brother, my bil (30M) is a chronic yo-yo dieter. I personally think it's annoying because he tries to get everyone else around him to try it. I've always politely said no thanks. My husband has told him several times to stop bringing it up to me, but he's sneaky, and will ask when my husband is not in the room. I've just brushed it off as he's insecure.\n\nThere was one day when he and their sister (34F) were at our house and my husband had to use the bathroom. Bil asked me if I had done any research on how to loose weight when I have the baby. I had to take a deep breath so I didn't snap. I told him I had no plans for that. Then he proceeds to tell me about some kind of diet that requires cutting out all kinds of foods and apparently the baby weight will just fall right off. I told him no thank you, I'm not worried about my weight and neither are my doctors or my husband. Then he pressed even further, all while my husband is taking a shit. He asked me if I had any diets in mind and he would like to research them for me to see if they were good for me. I laughed and said that I would be on the see food diet. I'll see food and I'll eat it, because with breastfeeding, you burn lots of calories, so I'll probably be hungry all the time. He was visibly uncomfortable, but my sil was giggling. After my poor husband came out, bil suddenly decided he needed to take his dog for a walk. My husband asked if anything happened and I told him. He thought it was funny too and he was going to talk to his brother. I know I'm not the asshole, but part of me feels bad for the guy. If he's this insecure, could I be the asshole by being as sarcastic as I was?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6hdqx/aita_for_telling_my_bil_ill_be_on_a_see_food_diet/","permalink":"/r/AmItheAsshole/comments/1p6hdqx/aita_for_telling_my_bil_ill_be_on_a_see_food_diet/","score":2084,"num_comments":130,"over_18":false,"stickied":false,"created_utc":1764089036.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jjdt","name":"t3_1p6jjdt","subreddit":"AmItheAsshole","author":"CryptographerOld5750","title":"AITA for not being more discreet at the store for my son?","selftext":"My son 9m is upset with me right now for an incident that happened yesterday at the store. Yesterday we were at the store to stock up on groceries, it was me 37f, my son 9m and daughter 7f.\n\nMy son still wets the bed and wears  Goodnites ( big kid pull ups for bedwetting) for it and we went and got those first like we always do so we can hide them underneath other stuff. It went pretty good for most of the trip but there was an issue when we got to checkout. \n\nI was unloading the last of the groceries when I heard him say in a kinda worried voice \" no mom please stop \", but i had already put his Goodnites on the belt. I asked him what was wrong, he pointed out that his friend was at the store with her parents and might see us and he didn't want her to see his Goodnites.  \n\nI said it would be okay and put the last of the other groceries around his Goodnites so nobody would see them. We got our stuff rang up and left with no problems, but my son didn't say a word to me on the car ride home.\n\n Later I asked him what was making him so upset, he said he didn't want his friend to see his Goodnites and that's why he wanted me to stop unloading the groceries and said I was being a jerk for not stopping and his friend almost seeing them. \n\nI explained to him that I never meant to make him feel bad I just needed to get the groceries unloaded so they could be rung up. But this didn't help and he said I was being a jerk and didn't talk to me much for the rest of the evening and was very quiet at Breakfast today. \n\nI asked him if he was still upset and he said yes he was cuz I was a jerk. \n\nUpdate : I just talked to my son and apologized to him for making him feel like I didn't care about his feelings and being a jerk at the store, I told him I never meant to make him feel bad and I was sorry I did. \n\n I promised him we will be buying his Goodnites using curbside pickup from now on ( we do most of our shopping at Fred Meyers and they offer free delivery for orders 35$ and up so making his Goodnites part of a bigger delivery will work fine for us and not hurt our Budget ), he was quite glad to hear this which makes me wish I had done it sooner. \n\nHe accepted my apology and we cuddled for a few minutes and now we're about to cuddle up on the couch and watch a movie that he picks out. \n\nThanks everyone for your help!\n\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6jjdt/aita_for_not_being_more_discreet_at_the_store_for/","permalink":"/r/AmItheAsshole/comments/1p6jjdt/aita_for_not_being_more_discreet_at_the_store_for/","score":1522,"num_comments":567,"over_18":false,"stickied":false,"created_utc":1764093766.0,"edited":1764109731.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6hfq1","name":"t3_1p6hfq1","subreddit":"AmItheAsshole","author":"Throwra-House-5592","title":"AITA for telling my wife she should take the car if she wants alone time instead of asking me to leave the house with our kids?","selftext":"\n\n\n\nMy wife works from home part-time (2–3 days a week) and is the main at-home parent to our two kids. We live in a tiny apartment with very thin walls so I understand that it’s overwhelming and she’s always been a very introverted person who needs more alone time than most people.\n\n\n\n1-2 times a week I take the kids out for an hour or two so she can have the house to herself. She really appreciates it. The issue is that now she wants this every day, for longer and wants me to drop whatever I’m doing to take the kids out whenever she needs space.\n\n\n\nI’ve obliged several times when she’s been explicitly asking for it even when it was inconvenient for me, but I’ve started feeling taken advantage of. I also work full-time outside the house Monday–Friday, so the home is my decompression space too. Sometimes I just want to relax and watch TV without being sent out of my own house.\n\n\n\nRecently, she asked me again to take the kids out so she could have the house to herself. I said no because I feel like this “nice thing” I was doing has become an expectation. I told her she’s welcome to take the car and have alone time somewhere else if she needs it.\n\n\n\nShe said that’s unfair because she wants to relax at home, not outside. I said it’s also my home and if she needs the quiet time, she can relocate. I just don’t want to be displaced anymore. I told her that I’ll take the kids out when I genuinely want to do something nice for her but I don’t want to be told to leave my house every time she wants quiet.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6hfq1/aita_for_telling_my_wife_she_should_take_the_car/","permalink":"/r/AmItheAsshole/comments/1p6hfq1/aita_for_telling_my_wife_she_should_take_the_car/","score":1412,"num_comments":362,"over_18":false,"stickied":false,"created_utc":1764089154.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6660p","name":"t3_1p6660p","subreddit":"AmItheAsshole","author":"Maximum_Spend_5931","title":"AITA- F (49) telling a stranger (M 50+)to stop trying to bully me and the passenger next to me?","selftext":"Sitting in BC on a flight to YYZ from YVR. Overhead bin space is allocated above our  seats and a little tricky. Had to finesse my carry on flat not sideways (Lower height bins) and my seat mate looked up from her laptop and laughed with me as I took a moment to figure it out and said she had the same issue. It was sorted i closed the full bin and settled in for our flight. A man and a woman come rushing into the flight just after last call, and he’s huffing and complaining under his breath. He has 2x carry on’s and a huge backpack and starts opening bins left and right and tries to stuff his bags wherever he can. Then he opens ours and yells at us and says we did it wrong and that obviously we don’t know a thing about loading bags … and pulls out our luggage, puts his in and tries to  stuff our bags sideways and starts swearing as obviously the bins won’t close. I get up and tell him not to remove our bags and put them back.. and he glares at me and again tries to tell me I’m wrong… and keeps banging the bin on my luggage.  Finally I look at him and tell him to stop trying to mansplain how to do something we had figured out before he came on board and decided to play a game of bag Tetris. I was firm and annoyed.  And then the flight attendant came and told this man to leave our bags and sit down.. then she took his bags away (gate check) put ours back, and that was that. His wife looked embarrassed  apologized and said her husband had a bad day.. and after I sat down I felt bad about raising my voice. AITA? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6660p/aita_f_49_telling_a_stranger_m_50to_stop_trying/","permalink":"/r/AmItheAsshole/comments/1p6660p/aita_f_49_telling_a_stranger_m_50to_stop_trying/","score":666,"num_comments":59,"over_18":false,"stickied":false,"created_utc":1764055207.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64v3k","name":"t3_1p64v3k","subreddit":"AmItheAsshole","author":"butterflywhaleshark","title":"WIBTA for telling my dad to pick between me and his wife?","selftext":"I (18f) haven't seen my dad since I was 3. He had me at a young age and I was taken away from him. I spent my entire life building up this image of him and fantasizing that he would come rescue me from my home. (I grew up in a very abusive house and got removed at age 14). From age 12 to 17, I searched all over the internet trying to find him, but I didn't know anything about him so it was pointless. Eventually, after years and years of searching, at age 17 I found him. It was a sweet and tear filled virtual reunion. He told me how much he missed me and how much he loves me. All was well until the first time I asked to meet him in person. He told me something about his wife being the reason he can't. It has been over a year since that time, and I asked him if he would meet up with me for my 19th birthday coming up. It was a whole plan. Today I messaged him so I could finalize details and get ready to buy my plane ticket. (We were going to meet in my hometown because it's the closest I can get to where he lives. I can't stay in his house so I have to stay with someone else due to financial issues.) He messaged me back to tell me that his wife doesn't want him to come because she will be anxious and lonely for the few days that he is gone and she cannot come with him.  This is not the first time she has kept him from meeting me. I am debating telling him that if he constantly chooses her small temporary issues over meeting his long lost daughter, I don't need him in my life, because I am so tired of the heartbreak and feeling like he doesn't love me after finally feeling like I have a parent. WIBTA if I told him to pick her or me in this situation?\n\nEdit: to everyone who says she might not know about me, she definitely does. I would say we are relatively close. I've been talking to both of them for almost two years now over the phone. But every time we make plans or try to, they end up getting canceled.  ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p64v3k/wibta_for_telling_my_dad_to_pick_between_me_and/","permalink":"/r/AmItheAsshole/comments/1p64v3k/wibta_for_telling_my_dad_to_pick_between_me_and/","score":519,"num_comments":73,"over_18":false,"stickied":false,"created_utc":1764050463.0,"edited":1764054189.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p620n9","name":"t3_1p620n9","subreddit":"AmItheAsshole","author":"Neither-Chard-4152","title":"AITA for not picking up my half sister when she called me.","selftext":"sorry for any errors, not  a native English speaker\n\nI (27M) have a half-sister (16F), the illegitimate daughter of my father and a former colleague of his. For the past two years, she and her mother have lived separately from us, and we've had no contact whatsoever. I only knew of her existence because my father sponsored her education. Of course, my mother never really liked this situation, but it became worse after my half sister's mother passed away, and my half sister moved in with her.\n\nMy father went through a lot of trouble to gain custody of her, and eventually she moved in with him and my mother. My father is often away from home, so most of the time it's just my mother and half sister at home, and their relationship isn't good. A week ago, she (half sister) suddenly called me and asked me to pick her up. I asked her why she needed to come, since she was already home, and she said my mother told her to leave and she couldn't go anywhere. I told her I wasn't going to let her stay with me overnight and then hung up.\n\nMy dad called and yelled at me because she stayed overnight at a friend's house, and the friend's parents also called  him, which embarrassed him. My girlfriend thinks I should have picked her up because she might have gotten into trouble, but I don't feel it's my responsibility; after all, it was my dad's terrible decision to bring her to our house. Since she ended up staying overnight at her friend's anyways, I don't think I did anything wrong.\n\nEdit: Ok, after reading through the comments, I considered again how I would feel if something had happened to her, or if she didn't have a friend to take her in that night, and I feel guilty about how I handled it. I saw the drive as more of an inconvenience than helping her, and I did not want her in my home because of the pain that she represented for my mother. However, I should have tried to reason with my mother, or make my father deal with it directly instead of doing nothing. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p620n9/aita_for_not_picking_up_my_half_sister_when_she/","permalink":"/r/AmItheAsshole/comments/1p620n9/aita_for_not_picking_up_my_half_sister_when_she/","score":485,"num_comments":279,"over_18":false,"stickied":false,"created_utc":1764041353.0,"edited":1764047678.0,"link_flair_text":"Asshole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lpf3","name":"t3_1p6lpf3","subreddit":"AmItheAsshole","author":"Captain_Canuck71","title":"AITA - Coffee conundrum- who’s right?","selftext":"Daughter (24f) always upset because I (54m) often forget to empty portafilter on espresso machine. (Which to be fair she bought on her very tight students salary but she lives at home). I’ve always apologized and I try to remember but sometimes I get distracted. I dunno.  Anyway I’ve been on a perfect 3 month streak of cleaning it out - but today I got an angry text (that unfortunately I can’t post here) that started with a picture of the portafilter in the machine, which was only there because I had just flushed it.  I’ll transcribe the text chain:\n\nPicture of machine with portafilter attached. \n\nHer- You broke the streak:/\n\nMe- Nope\nIt's flushing\nOr was flushing\nNice try though\n\nHer - Why no finish flushing ?\n\nMe - I set it to flush. It takes like 6 minutes\nI'm not going to stand there\nYou're welcome for doing it\n\nHer- You have to press it again so it's not done\n\nMe - OK so press it\n\nHer - This is when I get angry (in response to the ‘You're welcome for doing it’ comment)\n\nMe- I set it up and put the tab in\n\nHer - Omg you use the machine it's bare minimum for you to clean it\n\nMe - I did\n\nHer - Don't start something and not finish it and then you ask for thanks\n\nMe - Only because you yelled at me for doing 99% of the job\n\nMe- Because just finish it??? And it's not even 99% there are multiple rounds left\n\nSooooo, AITA?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6lpf3/aita_coffee_conundrum_whos_right/","permalink":"/r/AmItheAsshole/comments/1p6lpf3/aita_coffee_conundrum_whos_right/","score":422,"num_comments":253,"over_18":false,"stickied":false,"created_utc":1764098470.0,"edited":1764099087.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nze0","name":"t3_1p6nze0","subreddit":"AmItheAsshole","author":"aussieforeverr","title":"AITA for refusing to redo a project for my group after they ignored everything I contributed?","selftext":"Hi so I’m 19 and freshly in uni, I have a pretty good passion towards my major so I don’t mind working on it. We had a huge group assignment worth a chunk of our grade. Our lecturer told us clearly that everyone had to contribute fairly and that the group was going to be marked as a whole. The groups were random and I ended up in a group with 3 others I didn’t know, at first everything was okay for the first week or so.\n\nWe made a plan, divided the sections, and set the dead lines for the assignment. I finished my part early and I sent it to the group chat asking if Anyone wanted edits or changes to be made in case they weren’t happy with it. Nobody ended up replying after 2 days so I assumed everything was okay and I shifted my focus to my other courses.\n\nA week later when we met up to combine everything together, I realised that they had rewritten my entire section without even telling me. Not just edited or paraphrased, I mean like completely rewritten my entire work, they started from scratch and replaced it all. When I asked why they said they felt like doing it themselves and that it would flow better and synchronise with their work more, which seemed like an outrage to me because they should’ve just told me if they were working on it together out of uni.\n\nI told them they could have at least told me the rewrote it and they just brushed me off and said it wasn’t personal, but it sure felt personal,\n\nTwo days after that, one of them messaged saying the rewritten section wasn’t good enough and asked me to redo it from scratch. They also wanted it done within a day because the deadline was close.\nI flat out said no. I told them I already did my part, they ignored it, rewrote it behind my back and now they expected me to fix their mess at the last minute?! Who do they think they are thinking that would ever happen. That started a whole argument where they accused me of being lazy, uncooperative and risking their grades, saying just because I didn’t care about education I shouldn’t drag them down with me.\n\nI told them if they didn’t like their version that wasn’t my problem. When I refused again they kept pushing until someone in the group said that they were going to tell the lecturer I was refusing to contribute to the assignment.\nI screenshotted everything, my completed work, the messages, the time stamps, and then emailed my lecturer personally to make them aware of the situation and to send the photos over as proof.\n\nNow the group is furious because the lecturer told them he’d be assessing contribution individually instead of giving one group grade. Now they’re blaming me for so called ‘overreacting’ and in turn punishing everyone else instead of just fixing the situation that the group had. WHICH MIND YOU THEY CAUSED.\n\nI told my parents about it and they said I should’ve just done it to maintain the peace, my mate tho said they’re just using me as a backup and got caught so that’s reassuring in a way.\nSo AITA for not doing the work or no?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6nze0/aita_for_refusing_to_redo_a_project_for_my_group/","permalink":"/r/AmItheAsshole/comments/1p6nze0/aita_for_refusing_to_redo_a_project_for_my_group/","score":271,"num_comments":97,"over_18":false,"stickied":false,"created_utc":1764103585.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o94q","name":"t3_1p6o94q","subreddit":"AmItheAsshole","author":"Accurate_Scale8379","title":"AITA for not keeping our daughter up so that my husband could video call her while he's away","selftext":"Hi, I've been conflicted about this,  since last night, I've been feeling guilty but also I'm not sure if I'm totally in the wrong so I wanted some perspective. \n\nMy husband has had to go to Seattle this week due to work (we live in Boston, so he's a 3 hours behind us). He flew there on Sunday.\n\nHe'd told me he'd call when he gets done with work and their post-work lunch. He couldnt give a fixed time because apparently theres been some transition or acquisition happening, its been hectic for him, so he doesn't know when the day will end for him.\n\nHe called me around 11 pm EST. We talked for a while I asked how his day had been he said it had been a long one. He then asked to see our daughter (she's 3). I told him it was 11 here, she was asleep. He got a bit short with me, said he'd told me he was going to call, that I could have kept her up or given her a nap earlier. I told him she had taken a short nap earlier but at 11, she goes to sleep regardless, and that I had no idea when he'd actually call. He just shook his head with very clear disappointment and said that after a long day he really wanted to talk to her and I could've been more considerate.\n\nThis part stung me because they both are really close to each other, he adores her, and she too is a total daddy's girl. I again said I'm sorry but I had no idea when he would call, if he'd given me some sort of tentative time even that would've helped. We kind of ended the call soon after.\n\nIve been thinking about this all day and been conflicted. AITA?\n\n\nAdding this now: He just texted and said he meant to call during lunch break but got taken out by some executives for lunch. He said he'll call when he gets done at 5 pm his time, so 8 pm ours. I told him that works great.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6o94q/aita_for_not_keeping_our_daughter_up_so_that_my/","permalink":"/r/AmItheAsshole/comments/1p6o94q/aita_for_not_keeping_our_daughter_up_so_that_my/","score":235,"num_comments":279,"over_18":false,"stickied":false,"created_utc":1764104200.0,"edited":1764108322.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kljd","name":"t3_1p6kljd","subreddit":"AmItheAsshole","author":"xsparkyx","title":"AITA for refusing to split babysitter costs on my ex-husband’s custody day?","selftext":"My ex husband (35M) just called me (37F) asking to split the cost for the daycare he put our daughter in for yesterday and today. I have her the rest of the week. I told him no because he did not coordinate with me ahead of time. I took the week off and could have helped during the workday.\n\nAm I the asshole for saying no to splitting child care costs on his day?\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6kljd/aita_for_refusing_to_split_babysitter_costs_on_my/","permalink":"/r/AmItheAsshole/comments/1p6kljd/aita_for_refusing_to_split_babysitter_costs_on_my/","score":213,"num_comments":74,"over_18":false,"stickied":false,"created_utc":1764096075.0,"edited":1764097392.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6oqeo","name":"t3_1p6oqeo","subreddit":"AmItheAsshole","author":"Far_Competition_3475","title":"AITA for not holding a baby","selftext":"Family from all over came to visit for the holidays. My partner‘s brother in law asked me if I wanted to hold his baby. I said no. He then asked if I would be willing to hold the baby. I said that I am not willing Then he asked if I would hold the baby so he could unload the dishwasher. I gestured to the baby’s uncle, my partner, who took the baby. \n\n  \nPeople told me that was rude, but I did not want to hold the baby. I was in the middle of doing something for work. I’m not a free babysitter just because I’m a woman. If he needed help, he should have asked for it. The baby is also old enough to just be left to run around too. No one needed to hold them. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6oqeo/aita_for_not_holding_a_baby/","permalink":"/r/AmItheAsshole/comments/1p6oqeo/aita_for_not_holding_a_baby/","score":168,"num_comments":83,"over_18":false,"stickied":false,"created_utc":1764105280.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6e06b","name":"t3_1p6e06b","subreddit":"AmItheAsshole","author":"Dr4nem","title":"AITA for not taking into account my brother's wishes for our wedding date","selftext":"My partner (38F) and I (39M) booked a venue for our wedding party in one year and a half, a weekend at the end of june 2027. My brother is complaining it might not work for his kids as it might be during exam period or their internship (Kids will be 21, 19 and 17 in 2027).\n\nThe context: We live in Germany, are french, and want to celebrate our wedding in France. My brother and the rest of my family live in the north of France, but we decided for a venue in the south of France, somewhat close to my partner's family, because the region is nicer than the north of France, and more chance of sun as we want a summer vibe for our party, as there is a pool, beach volley, boules field etc. The drive from my brother's to the venue is around 9 hours.\n\nFor his kids my brother's would have preferred a date in july-august, but the venue's price takes a 50% increase for that period, or during one of the long weekend of early may, but then more risk of chilly weather/rain.\n\nI would be sad if some of my nieces and nephews can't make it, I love them, but I can't help to feel annoyed at my brother for taking me on a guilt trip over this. I feel this our big day, we want to plan something that feels like us and not have to cater to other's needs, and we were hoping our closest ones would be happy for us instead of complaining.\n\nOr AITA for not taking his needs into consideration?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6e06b/aita_for_not_taking_into_account_my_brothers/","permalink":"/r/AmItheAsshole/comments/1p6e06b/aita_for_not_taking_into_account_my_brothers/","score":169,"num_comments":168,"over_18":false,"stickied":false,"created_utc":1764081322.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p66d69","name":"t3_1p66d69","subreddit":"AmItheAsshole","author":"Melodic_Ad_271","title":"WIBTA if I insisted my MIL sell her dead mom’s  house?","selftext":"Edit: \nThere are a lot of comments saying IWBTA - which is totally fair, but I just want to clarify that it would never be my intention to confront my MIL directly, I would simply bring up the issue with my partner, because until this point I have never involved myself.\n\nTo clarify further, my partner has wanted to sell the house for 15 years, and has brought it up numerous times. They have gone as far as meeting with a real estate agent, and have had offers from developers as recently as this year. My MIL has at various points been totally on board, but inevitably backs out. He feels the same way as I do, but doesn’t want to rock the boat. \n\nMy son’s relationship with his grandparents is more important to me than money, so I would never want this to get messy / involve lawyers etc. \n\n\n\nMy partner and I have been together for 8 years, and have a three year old son. \n\nWhen my partner’s grandmother died in 2003, she willed her house 50% to my partner and 50% to his mom (both only children). She was unwell for a long time before died, so hadn’t been living in the house since about 1995. Since then, it’s been completely empty / used as a storage locker by my in-laws. It’s an absolutely beautiful Victorian home, but it’s been neglected so badly that without major renovations it’s essentially a tear down at this point. \n\nMy MIL is extremely emotionally attached to the house (from what I gather, not for particularly positive reasons? It seems very complicated / traumatic for her) to the point where she flat out refuses to rent it out, let alone sell it. \n\nMy partner told me about the situation when we first started dating, and at the time I didn’t think much of it, and didn’t really feel like it was any of my business. Since my son was born I’ve started to feel differently. \n\nFor context, we live in one of the most expensive cities in North America - an average 2 bedroom condo here is $900k. We work hard and save as much as we can, but even if we came up with a minimum down payment, the mortgage would be suffocating. \n\nWe’re currently renting, which is becoming increasingly precarious/ stressful. We’ve already moved once due to the landlord selling the house, and we’re about to have to move again. \n\nMy partner’s share of the sale would give us enough for a considerable down payment and manageable mortgage. \n\nMy partner is very non confrontational and has generally avoided the issue. He’s brought it up a few times with her over the years and she’s either\n a. flat out refused (due to the fact the house would be torn down) \nb. become so emotional that he dropped it or \nc. agreed it was a good idea to sell the house and “rid herself of the burden” but never actually done anything about it \n\n* Side note, I’m an interior designer and have offered to manage the project / oversee the renovation if she wanted to go that route and avoid it being sold as a tear down. *\n\nMy son starts school next year, and I’m becoming quietly resentful that we’re struggling with housing insecurity/ might have to move him multiple times, when there is an opportunity for us to actually own a home. \n\nI’ve been totally quiet up until now, because I’ve never felt entitled to this money, but I feel like my son is. WIBTIA if I put my foot down and tell my partner that his mom needs to sell the house or pay him out for his share? Or should I shut up? \n\nEdit to add: the house in question is on the other side of the country - so sadly us living in it is not an option! ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p66d69/wibta_if_i_insisted_my_mil_sell_her_dead_moms/","permalink":"/r/AmItheAsshole/comments/1p66d69/wibta_if_i_insisted_my_mil_sell_her_dead_moms/","score":147,"num_comments":303,"over_18":false,"stickied":false,"created_utc":1764055961.0,"edited":1764092294.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6gcfu","name":"t3_1p6gcfu","subreddit":"AmItheAsshole","author":"Creative_Rip_6491","title":"AITA for making Thanksgiving plans that upset my wife","selftext":"So my wife and I both got invited to Thanksgiving dinner to both sides of the family. At the same time. Clearly someone is getting told no. That being said my wife insisted on not going to her grandparents because they have been rude in the past to her before we got together. She also refused to go to my parents because when we last went my uncle made inappropriate and embarrassing comments about our financial situation. \n\nSo since she didnt want to go to either, but not tell anybody no, she wanted to hatch this elaborate scheme where we were somehow going to leave the house (we live with her parents) under the ruse of going to mine. But in reality she wanted us to go find somewhere fast food to go and eat going to neither. \n\nproblem is nothing in our area will be open. And so we've argued about this for a month now. I said let's just go to one or the other and if someone is rude to us we just get up and leave and never eat with them again. She wouldnt even entertain that. \n\n\n\nI told my mom (that I dont like either) that we aren't coming and I explained why. And now my wife is mad at me for telling them the truth. I have a lot going on right now with money trouble, bankruptcy, supporting both of us and our child on a small shitty income, I just did it because I didnt want to have yet another thing to stress about. She's now crying in the other room. \n\nAITA and what would you have done if you were in my shoes?​","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6gcfu/aita_for_making_thanksgiving_plans_that_upset_my/","permalink":"/r/AmItheAsshole/comments/1p6gcfu/aita_for_making_thanksgiving_plans_that_upset_my/","score":119,"num_comments":79,"over_18":false,"stickied":false,"created_utc":1764086730.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nf6w","name":"t3_1p6nf6w","subreddit":"AmItheAsshole","author":"Unsure_6219","title":"AITA for telling my professor the truth","selftext":"I am in my freshman year at a college both my twin sister and I attend. Funny enough, we needed to complete some core curriculum classes and we ended up in the same Algebra class (same teacher, same time). \n\nI’ve always been good at math, so this class was easy and I was getting over 100% with extra credit. My sister is gifted in other ways, but struggles with math and was on the verge of failing the class. My parents wanted me to help tutor her which I was happy to do. That went just as well as you can expect tutoring your sibling would go. \n\nSo here’s the problem. I got a homework assignment grade back as a 5/20. Which I thought was extremely odd as I had gotten 100% on the exam in that unit. My friends told me everyone makes mistakes and it wouldn’t really affect my grades anyways. \n\nThe next day in class, my professor pulls me aside (my sister had skipped class that day) to tell me that my homework had the exact same answers and work as my sisters. I told her I had nothing to do with that and I was surprised to hear it. She told me she believed me and we can settle on that grade instead of taking it to a bigger level. So basically there was nothing I could do to change that grade and I was lucky there weren’t worse consequences. The professor ended up giving her a 0 on that assignment. \n\nI confronted my sister and she admitted to stealing my homework out of my backpack and copying the answers. I was pissed. I talked to my parents about it and they told me to let it go because “she’s drowning and pulling you down with her” and that I’m not going to fail the class because of this. They also told me that I shouldn’t have thrown my sister under the bus for this. I feel bad for her and I understand why she would do this, but I tried tutoring her and this is huge for me. Am I the asshole for being mad at my sister and telling my professor the truth?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6nf6w/aita_for_telling_my_professor_the_truth/","permalink":"/r/AmItheAsshole/comments/1p6nf6w/aita_for_telling_my_professor_the_truth/","score":106,"num_comments":46,"over_18":false,"stickied":false,"created_utc":1764102311.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63sea","name":"t3_1p63sea","subreddit":"AmItheAsshole","author":"Ok_Restaurant7516","title":"AITA my brothers wife found texts where we were talking about her.","selftext":"\nAITA... my brother and his wife may be getting a divorce and I feel horrible. His wife snooped in his phone and found messages where we were talking about her. He also said in a text that he was only still with her bc of their daughter. Backstory... my brother and I haven't been close so I told him I wasn't the best person to baptize their child. But he asked me to please do it so I gave in. Fast forward to planning it I went to their house met her brother the godfather and I was asked to pitch in for the baptism which is frustrating bc as godparents we shouldn't have to pay for anything. I scheduled a day to take their daughter to try on outfits and it bcame a big deal had to be cancelled. So I told my brother its fine you guys go ahead buy the stuff without me I'll send the money.  But in a text he said how he didnt like her brother and how she has to be in control of everything in which I responded I already knew but was giving her the benefit of the doubt but now I see it myself and also said how I didn't even want to baptize their daughter but Im doing it for him and the baby. We'll his wife read it and said she doesn't want me to baptize their child which I totally get. But also wants a divorce from my brother and cant help but feel horrible. \n\nUPDATE: She wants to do counseling with him.\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p63sea/aita_my_brothers_wife_found_texts_where_we_were/","permalink":"/r/AmItheAsshole/comments/1p63sea/aita_my_brothers_wife_found_texts_where_we_were/","score":108,"num_comments":43,"over_18":false,"stickied":false,"created_utc":1764046856.0,"edited":1764115863.0,"link_flair_text":"Everyone Sucks","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6q2h6","name":"t3_1p6q2h6","subreddit":"AmItheAsshole","author":"elladistann","title":"AITA - I told my mum to change her tone and shes threatening me now","selftext":"My mum had just left the gym and she was about to head home. Before she got in her car she called me and said ‘Go and make me a salad. Now. I’m hungry’ in a very harsh tone. She always speaks to me that way and I have been telling her since I was at least 12 years old (I’m 18 now) that I do not like the way she speaks to me and commands me to do things. Both the tone of her voice and the words she uses make me feel like I’m some sort of slave. \n\nSo I told her (in a calm tone), ‘Why do u always speak to me that way? Can you not say it a bit nicer?’. She started shouting and screaming at me that ‘At 50 years old you will not tell me what to do and you certainly won’t tell me how to speak. You are 18 and still living under my roof. I speak however I want to speak. And do not even dare make me a salad, I want nothing from you. Go lock yourself in your room, I do not want to see you. Go f*ck yourself.’ She then hung up on me while I was about to speak and called me again after a few minutes to repeat the same stuff again and hung up. I still made her the salad (because if I do not I’m gonna be called the adult who still lives at home and contributes to nothing). \n\nShe then proceeded to call my uncle (her brother), who is staying with us for the holidays (who I think understands my point of view but never dares to speak up) and she screamed at him ‘Tell her to take her f*cking dog with her and tell her to stay in her room. I don’t wanna see them again.’ My uncle didn’t say anything to me but I overheard so I just took my dog and left. She came home, slammed the door and I can hear her screaming and shouting at my uncle about me. Now shes screaming loud on purpose for me to hear her ‘She can go find someone who can feed her and stand her. She should go. I can’t stand her anymore.’ She also texted me (after coming home) and said ‘take your f*cking dog upstairs with you. if I see her downstairs again I will kick her out of the house’. \n\nI genuinely do not think I am wrong. This behaviour has been going on for years. I am very open to change and correct things if I am wrong but I genuinely cant understand how I could be causing this. I understand that maybe it wasnt the right time for me to tell her to talk to me nicely cuz she was tired from the gym but this is a discussion we have weekly that always ends in her arguing, shouting, screaming-crying and acting like she’s a victim to everyone else. Also, she always says I should move out but when I said I wanted to move out for university and live in halls, she would try to talk me out of it every single time. \n\nGuys AITA? What am I doing wrong??","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6q2h6/aita_i_told_my_mum_to_change_her_tone_and_shes/","permalink":"/r/AmItheAsshole/comments/1p6q2h6/aita_i_told_my_mum_to_change_her_tone_and_shes/","score":95,"num_comments":92,"over_18":false,"stickied":false,"created_utc":1764108403.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64dxy","name":"t3_1p64dxy","subreddit":"AmItheAsshole","author":"Imaginary-Coffee-550","title":"AITA: Wife’s best friend","selftext":"So I need to know if I am in the wrong here. My wife (32F) and I (30F) are beginning our journey to have a child. I have a child from a previous marriage, and so my wife wants to be the carrying parent. My wife also has this friend. Said friend has not liked me for a while. She has made this very clear to my wife. Imo, it’s because she has clear feelings for my wife and sees me as the “competition.” As part of my wife and I taking steps towards growing our family, we went to a fertility clinic to assess her fertility and evaluate any potential issues. My wife invited her friend, as I originally was unable to come to the appointment. I made arrangements however to be there for my wife. The friend still came along. I wasn’t pleased, but I swallowed it to allow my wife to enjoy this happy part of our lives. The second we walked into the clinic, the friend began creating distance between my wife and I. Three seats in a row, she sat in the middle seat. Putting herself between me and my wife. Asking the doctor questions and generally making the appointment about her, even going so far as refusing to be silent for the nurse to take my wife’s blood pressure. The final straw came when we stepped into the ultrasound room. My wife had asked us to step into said room and wait for her to finish having her blood taken and to do her urinalysis. When I arrived in the room, her friend was sitting in the only chair available. The one typically reserved for the other parent. I asked her to move so I could have that moment with my wife and she outright refused and got passive aggressive with me. Then my wife comes in, and suddenly she’s offering me the chair and acting like a saint. I refused because I was not giving her the satisfaction. When the ultrasound was being done, she kept exclaiming “we’re having a baby!” and generally making a huge fuss, but all the phrasing was centered around herself. When we left the clinic, I got very upset and told my wife that I would not be attending any further appointments if the friend was there. That I was happy and willing to be with her for every step of the process, unless the friend came because I simply refuse to be disrespected and put on the back burner for an event that completely revolves around my wife and myself. My wife is now angry with me and says I was overreacting. That the friend was just there to support her. I pointed out that this type of behavior is common and I am putting my foot down in regards to this friend. AITA for standing my ground and refusing to play nice?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p64dxy/aita_wifes_best_friend/","permalink":"/r/AmItheAsshole/comments/1p64dxy/aita_wifes_best_friend/","score":76,"num_comments":75,"over_18":false,"stickied":false,"created_utc":1764048822.0,"edited":0.0,"link_flair_text":"Everyone Sucks","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rv50","name":"t3_1p6rv50","subreddit":"AmItheAsshole","author":"EntertainmentPlus848","title":"AITA for not doing the exact Christmas dates my mom wanted, even though I offered a compromise?","selftext":"\nMy husband (32M) and I (30F) live in Ohio with our toddler. My parents live in New Jersey. This is the first Christmas since my grandmother passed away, so emotions are running high.\n\nOriginally, my parents expected us to come 12/24–12/27.\n\nMy husband asked that we spend Christmas Day in Ohio so he could see his grandparents. He does see them during the year, but he hasn’t spent Christmas with them in years, and this year that feels important to him. We wanted to find something balanced for everyone.\n\nI suggested a compromise:\nDrive to NJ 12/21\nStay 12/21–12/25 morning\nCelebrate Christmas Eve and Christmas morning with my parents\nDrive back midday 12/25 for his family’s Christmas that afternoon\n\nThis actually gives my parents four full days with us AND Christmas morning which is more time than the original plan.\n\nMy mom was very upset about us leaving on Christmas Day and said she did not want to compromise on dates. My dad was okay with the plan but didn’t want conflict. My brother isn’t coming this year because his wife is pregnant and can’t travel, so he stayed neutral and didn’t want to get involved.\n\nI feel torn because I’m genuinely trying to balance both families, honor my husband’s request, and still give my parents a meaningful holiday. I also have anxiety around disappointing people, which makes this harder.\n\nAITA for not agreeing to stay through 12/27 and sticking to the compromise?\n\nEDIT: for those asking- the drive is exactly 6 hours. We’d be leaving early in the AM to arrive at husbands Christmas that is late afternoon/early evening \n\nEDIT#2: Toddler has taken this trip multiple times and is a very low stress kiddo. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6rv50/aita_for_not_doing_the_exact_christmas_dates_my/","permalink":"/r/AmItheAsshole/comments/1p6rv50/aita_for_not_doing_the_exact_christmas_dates_my/","score":61,"num_comments":125,"over_18":false,"stickied":false,"created_utc":1764112833.0,"edited":1764115501.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6hwhy","name":"t3_1p6hwhy","subreddit":"AmItheAsshole","author":"Maximum-Bed3335","title":"AITA for not sacrificing more for my brothers graduation?","selftext":"\nHi Reddit, I’m in a bit of a sticky situation and I would love some outside perspective. \nI (M26) am flying to my brothers (M23) college graduation in a few weeks. I am the 2nd of 4 boys in my family, and my brother that is graduating is kid number 3. My oldest brother, kid 1 (M30), is also flying in and the whole family is going to the graduation. Now for the back story. \nMyself and 3 don’t have a good relationship. Things were said at my wedding that I have not been able to forgive him for, and he believes that he was right. He basically said that I wasn’t ready to get married and that the Holy Spirit told him so (I am a Bible school graduate so there isn’t much I know about the Holy Spirit, but I know contradictory isn’t one of its traits). Anyways, long story short I have set up boundaries with brother 3 and will not attend family functions when he is present. However, I messed up and didn’t think about his graduation. That’s my bad. \nA few months before the graduation, it seemed that everybody in the family was pushing for me to be there. I resisted at first with the reasoning being “if brother 3 wants me there I will happily go, if he doesn’t I won’t” but brother 1 told me that he believes he is right anyways and won’t acknowledge his wrongdoings, no matter how prevalent they might be. I agreed and also agreed that this moment was a huge accomplishment for him and that I should attend either way. Brother 1 and I also agreed that if I got a rental car then he would get the hotel. Now here is where things get messy. \nAbout a month ago, I was informed that the ceremony had been moved from Saturday to Sunday. This change meant that I had to change my flights. I cannot afford to miss work so I had to cancel my flights and rebook flights to fly out Sunday night on the last flight out. Brother 1 thinks that I am a “hopeless and helpless asshole” for not being willing to give brother 3 “the entire day” for his graduation. I told him that I couldn’t afford to miss work because my wife and I are basically poor, and he said that I could “try to make more sacrifices” so that I could be there all day Sunday. \nNow I understand people have different views and relationships, and I try to abide by them and not push my opinions onto others. I offered to leave him the rental and get a ride to the airport so he could stay all day. He told me he will not be getting behind the wheel of the rental, nor would he be asking anybody for a ride to the airport because “he wouldn’t want to do it so why should he ask anybody to do it for him” (the drive is about an hour away). \nI told him that my answer was no that I couldn’t stay Sunday, and that he was an asshole for getting my answer of no and proceeding to push harder to make me “try”.\nSo Reddit, I could use some help because I am starting to second guess myself now and I don’t know what to think or believe. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6hwhy/aita_for_not_sacrificing_more_for_my_brothers/","permalink":"/r/AmItheAsshole/comments/1p6hwhy/aita_for_not_sacrificing_more_for_my_brothers/","score":60,"num_comments":76,"over_18":false,"stickied":false,"created_utc":1764090177.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ord0","name":"t3_1p6ord0","subreddit":"AmItheAsshole","author":"Sad-Ant-6366","title":"AITA for refusing to invite my Aunt and Uncle to my wedding?","selftext":"AITA for refusing to invite my Aunt and Uncle to my Wedding? \n\nI 19(F), have two Aunts and Two Uncles on my dad's side of the family, I don't have contact with my mom's side of the family since I was ten so they are the only extended family I have other than my grandma and two cousins. My dad's older brother we'll call Bob is married to his wife we'll call Annie. My dad's older sister we'll call Kate is married to her husband who we'll call Jim. Jim and Kate don't have any kids but Bob and Annie have two girls around my husband's age. Both sets of my Uncles and Aunts have never really been super involved in my life. Jim and Kate have been more for sure, but still with only seeing them like 5 times a year. Bob and Annie on the other hand have been awful most of my childhood and adult life. Bringing peanuts to family functions even though my brother is deathly allergic, making snarky comments to my mom and dad, and an entire lack of speaking to me and my siblings. \n\nMy husband and I have had an unconventional relationship. We met and 6 months later got legally married so we could be with each other when my husband reenlisted into the Army. We know its crazy and people have judged us but we honestly don't care. We are planning to have a real ceremony next year so we can both have that experience since our “Big day” was just signing a paper for 10 minutes. We shared this information with the people we care about most, which is a small circle. So my grandma told a lot of people for the news to get out there. And that's how Bob and Amy found out. My husband and I saw them a couple days later when they were dropping something off to my dad before my dad, husband, and I all went to a baseball game. I got a “hi Katie” and that was it. Didn't acknowledge my new husband or anything. I didn't really care at the moment because this was a normal interaction from them. Later I was angered a bit because there could have been a “hi James” or anything to acknowledge my husband. I was later informed by my mom that Annie had texted my dad and mom in a group chat sending her and Bob's condolences about me getting married. Apologizing that they had to go through this, etc. I was absolutely p*issed. I didn't care if they disagreed but for them to send condolences was in my mind beyond disrespectful. That was the last straw for me to say they aren't invited. I originally was going to, out of respect for my grandma. Now my mom and dad are trying to tell me I'm still inviting them like I don't have a choice. They say it's going to break my grandma's heart more than Annie and Bob. I told them I'll have a private conversation with my grandma because they aren't coming. We are in the very early stages of planning a wedding but I know they aren't coming. AITA?\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6ord0/aita_for_refusing_to_invite_my_aunt_and_uncle_to/","permalink":"/r/AmItheAsshole/comments/1p6ord0/aita_for_refusing_to_invite_my_aunt_and_uncle_to/","score":38,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764105340.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6md8t","name":"t3_1p6md8t","subreddit":"AmItheAsshole","author":"Local_Yogurt9414","title":"AITA for always going home for the holidays?","selftext":"I (36M) love my family and, unfortunately, live on the opposite coast from them. My girlfriend (34F) is local to where we live. We've been together 7 years, no kids or plans for kids.\n\nI always travel out to see my family 2 times a year - Christmas and 4th of July. I work at a college, so I essentially have a school schedule for breaks. \n\nMy family is so important to me. I take the whole 2 weeks I have at Christmas to stay at the family house. Christmas is special for us, we go all out. I have a large family, it's a whole event that I really look forward to. We have traditions, big family dinners, the works. \n\n(I get around 4 weeks off for summer and spend 1 week of it with family too.)\n\nMy girlfriend has a small family and doesn't really have holiday traditions. The family she does have is not very close, and fairly dysfunctional (her words). I've invited her to my family's house for the holidays, and offered to pay the ticket when it's expensive. She's been out maybe for 3 Christmases and some summers. \n\nWhen she doesn't come along, she stays home by herself. I buy her lots of gifts so she can open them while I'm gone. \n\nI thought this was a good thing. I can see my family, she can have the option of seeing my family and go along for the trip too. \n\nBut recently she made a comment about not having any of our own traditions because I'm \"always gone for the holidays\". That hurt my feelings, because she's always invited where I am. \n\nHer dad passed away in '23 and she didn't come to family Christmas that year. She said she was too sad to celebrate. Then in 24' she had a mild health issue that made travel not super comfortable. So she hasn't been to family Christmas in a little bit. She is going this year. \n\nAm I the asshole for always going to visit my family for the holidays? \n\nWe've chatted about this some, and she says she's glad I can spend time with my family, but does feel like she gets left alone. My thought is she's not alone if she wants to come with me. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6md8t/aita_for_always_going_home_for_the_holidays/","permalink":"/r/AmItheAsshole/comments/1p6md8t/aita_for_always_going_home_for_the_holidays/","score":35,"num_comments":195,"over_18":false,"stickied":false,"created_utc":1764099949.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64pn4","name":"t3_1p64pn4","subreddit":"AmItheAsshole","author":"lurkeratheart123","title":"AITA for not visiting my in-laws even though they visit us often?","selftext":"My mother in-in-law is upset because we haven't visited her in about a year. My husband and I have a 1.5 year old and traveling with a baby is..a lot. Meanwhile, my in-laws come to visit us every other month. We always welcome them into our home, and we FaceTime with them multiple times a week so they can see our daughter. They're truly welcome anytime. They're also visiting us for Thanksgiving and we took the week off of work to spend quality time with them. \n\nThey have two homes- one is a 4 hour flight away, the other is a hour flight- and they're healthy, retired, and have plenty of disposable income. My husband and I both work full time. We also have a nanny we pay regardless of whether we're home or not, and honestly, we don't do much these days besides hang out as a family. So flying somewhere else to \"hang out\" the exact same way just isn't appealing to us right now. \n\nWe visited last Christmas and are planning to visit again this Christmas (for a week each time). When I recently tried to explain that it's hard for us to travel with a baby and apologized for not making it a priority, my MIL said, \"it's always going to be hard. It's never going to get easier,\" and told us it feels like a one-way street: she puts in the effort and we don't. \n\nFrom my perspective, we stay in touch constantly, we host them often, and we aren't refusing to visit- we're just not prioritizing multi-hour flights with a toddler when they're able and willing to come to us. \n\nAITA for letting them visit us instead of making trips to visit them?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p64pn4/aita_for_not_visiting_my_inlaws_even_though_they/","permalink":"/r/AmItheAsshole/comments/1p64pn4/aita_for_not_visiting_my_inlaws_even_though_they/","score":33,"num_comments":32,"over_18":false,"stickied":false,"created_utc":1764049947.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p68ik3","name":"t3_1p68ik3","subreddit":"AmItheAsshole","author":"Training-Square3650","title":"AITA for turning down my BIL offer to buy my car for a better deal?","selftext":"So firstly a bit of context here. My BIL's car has been off the road for some time now, and my sister has been driving him to and from work. He found out I was looking to sell my car, and he asked if I'd be willing to sell it to him. The thing is my car is a luxury car, it's not a run around. I didn't want to offend so I asked him what his budget was and it fell way below what I was looking for. I told him as much and we didn't speak much more of it. Later that day though my sister rang me up giving me a big sob story about how they needed to get my BIL back on the road with a decent motor.\n\nI slept on it and decided for my sister's sake I'd entertain the offer, because I'm not desperate for the money. I do well enough for myself that I could comfortably afford to take the hit. I told my BIL and Sister that once I get my new car I'd accept their offer. At the time I fully meant it.\n\nFast forward a couple of weeks I'm looking into new cars, I went to the BMW dealership and clapped eyes on a lovely motor, I fell in love with it instantly and knew I'd be going home with it. It was a lot more expensive than I planned for but what a beauty of a car (for context:545e M Sport ) as I was chatting to a salesman he asked what I drove currently, so I pointed to my old beamer parked outside. He told me they could give it a look over and potentially trade it in and knock a good chunk off the price of the new car.\n\nI let them look it over, and they came back offering me way more trade in value than what my BIL was offering to buy it for. I knew he wouldn't be able to come close to matching it, so I went ahead with it.\n\nWell.. that was the trigger for ww3. My sister was absolutely fuming with me, she swore at me  and told me I was a terrible brother for going back on my word. My parents were also upset with me, telling me I shouldn't have said I'd take their offer if I was still going to entertain others. Now I'm public enemy number one and whilst I haven't been officially uninvited from my parents Christmas dinner plans, I suspect my presence wouldn't be welcome.\n\nI kind of understand where they're coming from but at the same time i felt like I was being taken for a bit of a mug and guilt tripped into agreeing to the original deal. They also had more than enough budget to get a brand new decent car so I really felt like my BIL was being a bit of a chancer and using my sister to aid him.\n\nSo Reddit, AITA?\n\n\\*\\*Update: Since posting this I tried to reconcile with my Sister again, only for her to tell me to jump off a bridge. As a result I've decided I no longer care who was initially wrong or right. Her and my BIL's true colours have shown and I'm glad I did the trade in. \\*\\*\n\n  \n\\*\\*Update 2: parents seem to have come around to my side now, they think BIL was using my sister to try and con me. They're disgusted with the things BIL and Sister have said to me on the phone and in text.\\*\\*","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p68ik3/aita_for_turning_down_my_bil_offer_to_buy_my_car/","permalink":"/r/AmItheAsshole/comments/1p68ik3/aita_for_turning_down_my_bil_offer_to_buy_my_car/","score":32,"num_comments":106,"over_18":false,"stickied":false,"created_utc":1764064375.0,"edited":1764102992.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65vbo","name":"t3_1p65vbo","subreddit":"AmItheAsshole","author":"uzipiru","title":"AITAH for not playing for my friend?","selftext":"Me (21f) & my friend (24f) went out to eat at a casual sit down place. Nothing too crazy, just something quick because she said she was hungry and wanted to get out of the house. I budgeted for this meal because money has been tight and I only planned to pay for myself.\n\nEverything was fine until the check came. She starts looking around in her purse. Then she looks at me and says 'I forgot my wallet, can you spot me.' \n\nShe said it loud enough that the server glanced over, and then she looked at me like I was supposed to automatically say 'Don’t worry, I’ll cover you.' But I couldn’t. I literally only had enough for my own food. I told her gently, 'I don’t have it today.' She immediately got annoyed and whispered, 'youre going to do this to me?' \n\nShe asked the server if she could pay over the phone or Cash App someone and have them pay for her but the server said they couldn’t do that, so she got embarrassed and had to ask them if she could run to her car and come back. They made her leave her phone as collateral.\n\nOn the drive home she told me I made her 'look stupid' and that a real friend would’ve stepped in so she didn’t have to deal with all that. I reminded her I literally told her earlier in the day that I was on a strict budget, and she’s the one who convinced me to go out.\n\nNow she’s being passive aggressive saying stuff like, 'I know who I can count on now.' I can say that as of right now we're still friends, she's just acting kind of iffy. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p65vbo/aitah_for_not_playing_for_my_friend/","permalink":"/r/AmItheAsshole/comments/1p65vbo/aitah_for_not_playing_for_my_friend/","score":29,"num_comments":49,"over_18":false,"stickied":false,"created_utc":1764054074.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i2si","name":"t3_1p6i2si","subreddit":"AmItheAsshole","author":"Imlonely2222","title":"AITA for not providing more activities and gifts for my upcoming wedding?","selftext":"Edited to add little more info: Due to my move to Canada and me being able to get my visa, as well as focusing on some health issues that have come up for me this year, we decided it would be better to elope first then have our wedding reception. We originally were planning for the reception to be in October 2025 (with the ceremony) but had to push things back. Everyone is aware that we would be married already and this is also explained on my wedding website.\n\nThrowaway account. Background: I, 28F, got into a fight with my cousin, 30F, who I am close with. I have an upcoming wedding, June 2026 in Ontario, Canada. I currently live there but am originally from San Diego, California. Most of my family and friends live in San Diego and others live in various places in the states, including Hawaii, NYC, and Seattle. My fiance's family lives in Ontario, Canada. We just moved to Ontario early this year (hence why the wedding will be there) and bought a house recently. This is our first time living together, so we've spent a bit furnishing the space as well as extra costs since I'm a US citizen and immigrated. I also have not been able to find a job after moving so we're working with a tighter budget for daily life. All in all, a lot of big expenses within a 2 year timeframe.\n\nFor the wedding itself, it'll be a hotel rooftop and restaurant with a tea ceremony followed by reception with sit-down dinner, no wedding ceremony since we don't like the attention and will have eloped by then. Basically a wedding vibe but no ceremony.  There will be a welcome/housewarming party at our house two days before. The housewarming will be super lowkey and basically just a gathering at our place to we have a chance to hang out with everyone. No gifts expected for the housewarming. We're also buying out-of-town guests tickets to the museum in the area as our wedding favor to them and providing uber vouchers for them to get around. In general I provided recommended activities for the week (most of my guests are staying 3 days before and 2 days after the wedding) and have some casual plans with different groups of guests: attending the museum with my family, coffee with friends, jousting tournament with guests that are interested, etc. Besides the museum, I wouldn't pay for the activity.\n\nMy cousin was visiting the other day and asked about the wedding planning and after hearing some of the details, started complaining about the cost of the wedding for her and that theres no return. The flight, hotel, dress, and overall spending to travel to Toronto from San Diego for a simple dinner and low-key welcome party. I asked her what type of party she wanted and she explained how there should be a huge welcome party the day before, a breakfast for all guests the morning after and at least one fully paid activity for everyone (a trip to Niagara for example). I reminded her that the museum was something I was paying for and that I was trying to plan an outing for my girlfriends and girl cousins but that I thought this was enough, especially with the expenses my fiance and I already had. She expressed that all of this wasn't enough and that even my wedding venue was too casual for her liking (there have been plenty of weddings at this venue btw). She said it was disrespectful to my guests. I really only said, \"I'm sorry you feel that way but I don't think we can do much about it at this point\" and did my best to change the subject. Needless to say it was kind of an awkward visit afterwards.\n\nShe hasn't responded to my texts since she went home a few days ago and I know its my wedding so I should do what I want, but honestly, am I asking too much of my friends and family to fly out for this? Is it the norm to provide the extra events? My other cousin got married last year in Spain and did have a welcome party and breakfast, but I feel like that was a higher expense for everybody to fly out to Spain. Anyway, thoughts?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6i2si/aita_for_not_providing_more_activities_and_gifts/","permalink":"/r/AmItheAsshole/comments/1p6i2si/aita_for_not_providing_more_activities_and_gifts/","score":29,"num_comments":66,"over_18":false,"stickied":false,"created_utc":1764090557.0,"edited":1764104889.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6s8u1","name":"t3_1p6s8u1","subreddit":"AmItheAsshole","author":"musty_ranch","title":"AITA for buying a homeless guy some clothes even though my friend felt unsafe?","selftext":"I went thrifting with my friend. (She is 16 and I am 17, and we went alone). I want to start this off by saying I think my friend was racial profiling, she thinks she was being safe for two minors who were alone. Take a read. \n\nBefore she got there, outside the thrift store, a guy asked for some warm clothes. Not anything more than some warm clothes. He seemed like a decent guy and I was talking with him for a while about his situation and we vibed and I decided pretty much right away I was going to buy him some clothes. \n\nMy friend then gets dropped off by her mom and sees who I’m talking to. She immediately becomes afraid and texts her mom about what she said the “ unsafe situation” was. I don’t see a situation more than getting a dude I talked to for like 15 minutes some clothes. When we were in the thrift store and the guy had gone to look for some jeans, she said that her “great intuition” told her he was unsafe. I said that getting that kind of gauge about how safe he was without even talking to him or knowing him was kind of profiling (he was black, she’s white.) \n\nWhen me and him were making some basic conversation in line, he turned to her and asked her a question (If she goes to the high school he used to go to). She said she feels unsafe answering that question. He respected that and didn’t talk to her afterward, I thought she was so rude for saying that to his face. \n\nThen, when I was checking out for him and put the card in the slot, she starts covering my card with her hands so he couldn’t see any numbers, and started saying after he left that “he could’ve gotten my whole address, social security #, etc.) I was like girl wtf are you on about. She wouldn’t let it go the whole time and said she’d “clock him in the face if he was still following us”. He had left the store like 10 minutes ago mind you. Then, about 20 minutes after he left, she nearly collapsed of a ‘headache’, saying she could still smell the weed on him and weed makes her head hurt. \n\nWhat made me the most mad is she said her parents raised her right for doing what she did, implying mine didn’t. She was taking about stranger danger the whole time, which I get but I also had an actual conversation with him and know his intentions were honest and harmless. She didn’t say a word, just started frantically texting her mom. I didn’t want to get much other than a couple cheap necklaces after I spent some money on the guy, and she told me ‘I get why you would want to spend your money on him, but what about your situation?’ I have a roof over my head, food, and enough clothes. He doesn’t. \n\nI can see where she’s coming from that we were alone and it could be unsafe, but honestly in a situation like that I can’t relate to her much at all. \n\nI think she was acting like scum. What do you think? \n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6s8u1/aita_for_buying_a_homeless_guy_some_clothes_even/","permalink":"/r/AmItheAsshole/comments/1p6s8u1/aita_for_buying_a_homeless_guy_some_clothes_even/","score":20,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764113820.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6oz0z","name":"t3_1p6oz0z","subreddit":"AmItheAsshole","author":"Ok_Watch_2333","title":"WIBTA for un-inviting myself from thanksgiving","selftext":"So I live with a few roommates. I don’t talk to my family and therefore the holidays are always harder for me. Earlier in November I asked my roommate if we wanted to do thanksgiving together since she had no plans at that time. We agreed to split the cost and kinda went on about our ways. My birthday is before thanksgiving but after our initial conversation. \n\nI didn’t get anything other than a text on my birthday. I’m not a materialistic person but I’d be lying if I said I didn’t sting that my roommates that call themselves my friends didn’t even try to do anything. 1 text that’s it. I at least got them something for their birthday and asked if they wanted to do something. Anyways fast forward to last Thursday the conversation about Thanksgiving came back up. Apparently in the mean time my roommate decided to move the dinner to someone else’s house with more people most of whom I don’t know. \n\nI have anxiety and at the very least need to be involved in the change of plans for me to not have a panic attack. My roommate knows this. I then said it’s okay and I was just going to stay home. My roommate assumed I was going to be okay with simply being picked up for dinner and to be stuck there until whatever time we’d end up going back home. \n\nI simply said I’ll just do my own thing because I don’t want to deal with panic attacks when staying home would keep my peace. \n\nAITA for not going and no longer paying half for dinner I’m not part of nor do I expect to receive a plate etc?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6oz0z/wibta_for_uninviting_myself_from_thanksgiving/","permalink":"/r/AmItheAsshole/comments/1p6oz0z/wibta_for_uninviting_myself_from_thanksgiving/","score":19,"num_comments":41,"over_18":false,"stickied":false,"created_utc":1764105829.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ddf0","name":"t3_1p6ddf0","subreddit":"AmItheAsshole","author":"FulmineGialla","title":"AITA for refusing my BIL to drive my new motorcycle over 80 kilometers one way.","selftext":"I,25m, have a wife 27f. We currently live with her family. My MIL needs to go to a family gathering 2 days before the rest of the household goes. So my SILs and wife want my BIL to bring her there. I acquired a new motorcycle (Aerox SP) 3 days ago. I haven't even driven the motorcycle for a single drive over 50 kilometers. They want to use my motorcycle to bring her to the family gathering about 80 kilometers one way and have the motorcycle back after a few hours. Since motorcycle is new, I wanted to test the motorcycle's capabilities by bringing my MIL to the gathering. The road to the gathering is going up a mountain, meaning you have ups and downs on the road. Their reason was because my BIL has a bit more experience getting there and I am a heavier driver than my BIL. I have had the same experience getting to the same place before on a different motorcycle. My wife says, it might be better for my BIL to drive it that far since the motorcycle is heavier than my first one. To me, that doesn't really matter. What's important to me is the sentiment of having the first long ride of the motorcycle to driven by me, the owner, and not anybody else. AITA?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6ddf0/aita_for_refusing_my_bil_to_drive_my_new/","permalink":"/r/AmItheAsshole/comments/1p6ddf0/aita_for_refusing_my_bil_to_drive_my_new/","score":17,"num_comments":61,"over_18":false,"stickied":false,"created_utc":1764079767.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qajv","name":"t3_1p6qajv","subreddit":"AmItheAsshole","author":"Nervous_System_6996","title":"AITA for wanting to moving out and take my death benefit back?","selftext":"Sorry for any mistakes, english is not my first language. I, 19F, am having a lot of problems with my mother,41F, lately. My mother and I never had the best relationship due to her losing my custody when i was eight, afther my grandma died (she had my custody back then) because of substances. I lived with my godmother, who discovered i had a death benefit in my grandma's name (5500, monthly).\n\n I came to live with my mother when i was almost 14, and we fought almost every day because of how bad the house was. She was a manipulative person and was also in a abusive relationship, so bad that she used all of the money with her boyfriend and his kids. Now, i live with her and my boyfriend, and we are considering moving out soon because of how bad she treats me. She thinks that she has a right to use my credit card, my money and my things anf almost every month she asks me to borrow money and thinks that she is entitled to it. Mind you, she still keeps the money for the benefit  (even though i should already have control over it)  and has a good job. \n\nWe talked last month about the money and she agreed to give me 700 from the benefit, after saying to me that she would never forgive me if i took the money from her and moved out, but i am really tired of this. I talked about the situation to some friends and family and they all say that money is not everything, but i dont think its about the money anymore, i just wished she was a mother to me and I just really want someone to say that im not crazy for wanting to move out and never talk to her again, even though i really love her, and am the only person that she has.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6qajv/aita_for_wanting_to_moving_out_and_take_my_death/","permalink":"/r/AmItheAsshole/comments/1p6qajv/aita_for_wanting_to_moving_out_and_take_my_death/","score":16,"num_comments":41,"over_18":false,"stickied":false,"created_utc":1764108930.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61ami","name":"t3_1p61ami","subreddit":"AmItheAsshole","author":"Dazzling_Sky_165","title":"WIBTAH for removing belongings from the swimming cubicle?","selftext":"I go with my mum and sister to her swimming lessons every week.\nWhen the classes finish the kids usually wash up and then get changed in the cubicles however whenever I try to look for one alot of them are taken by people leaving their things in the stalls and ‘reserving their spot’.\nWIBTA if I just took my sister into one of their stalls and removed their stuff because we and up having to wait for a long while in the cold?\nAs classes are usually staggered by 15 minutes  if parents from the later classes ‘reserve their spots’, people from earlier classes can’t change until they become free.\nI’ve spoken to the staff but a lot of them are from overseas so don’t want to risk complains by brings it up so can’t do much , whereas my job isn’t at risk so I’d happily remove their belongings?\nWould I be wrong for doing this?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p61ami/wibtah_for_removing_belongings_from_the_swimming/","permalink":"/r/AmItheAsshole/comments/1p61ami/wibtah_for_removing_belongings_from_the_swimming/","score":17,"num_comments":24,"over_18":false,"stickied":false,"created_utc":1764039252.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6q8kz","name":"t3_1p6q8kz","subreddit":"AmItheAsshole","author":"Special_Drive_871","title":"AITA for not picking up a package for my sister?","selftext":"So last weekend I attended a Friendsgiving potluck that took place about an hour away from where I live. I brought an appetizer so I left my place early which would give me enough time to finish off my dish at my friend’s place before everybody else got there. My sister, who was going to the same event, called me saying her pet’s food got sent to her old address and she asked if I could pick it up on my way to the party. It’s important to note that she moved an hour away from her old apartment and doesn’t get to that area very often anymore. Her old place was right off the freeway and I was going to drive right past it, so I told her I could swing by and grab the food.\n\nThe problem came when I got onto the highway. I hit really heavy traffic and I was going to be later than I had planned. I get really anxious when I’m late to things and was worried about being too late if I ended up stopping. I called my sister and told her that I wouldn’t be able to stop because traffic was already making me late. She got really annoyed with me and repeatedly said “Are you fucking kidding me”. I told her I was sorry and that I wanted to be there early then she hung up. I got to the potluck and finished my dish 10 minutes before everyone got there and we all had a great time. \n\nToday, I called her about our family thanksgiving plans and we got into an argument over the pet food. She’s upset that I didn’t pick it up because her old landlord left it out all night. She also said that I could have offered to get it on my way home from the potluck. I was also upset and told her that I feel as though she’s entitled to my time. (I might be the asshole here). I had a certain time that I wanted to be to the potluck and, because of traffic, I was already gonna be late. The way I see it is, yes I could have picked it up afterward but it honestly didn’t cross my mind. I told her that she could have asked me to and I would have. This also upset her because, from her point of view, if the roles were reversed, she would have offered to get it on her way home without me even asking. Ultimately, she’s upset because I’m not being apologetic and now she has to stop to pick up the food on a 4 hour drive to our mom’s for thanksgiving. Sooo AITA?\n\nTLDR; I didn’t pick up a box of pet food from my sisters old place even though it was on my way to our friend’s house; she’s really upset because I haven’t apologized and now she’s inconvenienced","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6q8kz/aita_for_not_picking_up_a_package_for_my_sister/","permalink":"/r/AmItheAsshole/comments/1p6q8kz/aita_for_not_picking_up_a_package_for_my_sister/","score":11,"num_comments":20,"over_18":false,"stickied":false,"created_utc":1764108803.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tldp","name":"t3_1p6tldp","subreddit":"AmItheAsshole","author":"EchidnaOdd1881","title":"AITAH for now waiting to see my family this thanksgiving","selftext":"I 18m don’t want to go down to Tennessee to visit my family this thanksgiving. There are multiple reasons for my extreme disinterest of seeing my family. For one the drive it the fastest it would take five hours of driving to just reach Tennessee and then another hour to reach there city not even in including traffic. Unfortunately for the past six months I’ve been having car issue so I’d be forced to ride with my aunt and uncle and her three kids already a bad sign for me. Then the day before thanksgiving giving the socializing, the children, the cleaning, the cooking, to me it’s exhausting to repeat the same dialogue over and over to people I hardly know. I want to make some things clear I do love my family and miss them I haven’t seen them since I’ve graduated this may, but overall I’m not interested in the shenanigans. Now this part maybe the most selfish but I want to stay here and spend time with my friends who I also haven’t seen since the semester started. And I’d also like to spend time with family up here especially since we just lost so many relatives on this side of my family this year. Plus I feel more at easy with them. Overall I just need strangers on the internets opinions on an issue I’m overthinking in my head. Sorry if there are any grammatical errors. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6tldp/aitah_for_now_waiting_to_see_my_family_this/","permalink":"/r/AmItheAsshole/comments/1p6tldp/aitah_for_now_waiting_to_see_my_family_this/","score":10,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764117394.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lcd7","name":"t3_1p6lcd7","subreddit":"AmItheAsshole","author":"Clean_Trouble4098","title":"AITA for telling my friend i can't help them?","selftext":"a really close friend of mine lost a lot of weight over the course of a few months and has been actively going to the gym, all of which i am very proud of considering how quickly they made progress. as of recently though they seem to be dealing with a lot of body dysmorphia and they are struggling with controlling their eating habits, both of which are issues they have come to me about, seeking advice. at first i tried my best to help them and show support in any way i could but then they told me they had been abusing laxatives, and at that point i just gave up on trying to offer any help because i don't have any experience with eating disorders, and i'm not qualified to guide someone through that or tell someone what they should do or what would help because i'm not a medical professional. i expressed these things to them in our last conversation and told them that i just can't help them, and that if they believe they have an ED or other problems with body image/health, they should consult a psychiatrist or a medical professional.\n\nafter i told them this, they seemed disheartened and now we haven't talked for a little while and im worried that what i said came off the wrong way. aita?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6lcd7/aita_for_telling_my_friend_i_cant_help_them/","permalink":"/r/AmItheAsshole/comments/1p6lcd7/aita_for_telling_my_friend_i_cant_help_them/","score":7,"num_comments":19,"over_18":false,"stickied":false,"created_utc":1764097671.0,"edited":1764098076.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6s4vn","name":"t3_1p6s4vn","subreddit":"AmItheAsshole","author":"No_Ring2914","title":"AITA for walking away from a group hang because I felt too awkward to join in?","selftext":"Well it goes like this, my name is Jessica (25F) and i don’t really have a real friend group, I’m shy and not great at starting conversations, and I get in my own head a lot when I’m around new people, i have been trying to put myself out there more, A coworker, he’s name is jay, invited me to a small get together at his place, He said some of the team would be there and it would be a great party, I stressed about it all week but decided I wanted to try, When I got there, the door was open, people were laughing, music was playing normal stuff happening But everyone already seemed deep into their conversations, I stood near the entrance for a minute trying to figure out where I was supposed to go or who to talk to, still in my own head again, A few people glanced at me but didn’t say anything. Jay saw me, waved and went back to talking to some guys. I told myself to just join someone but every time I tried to approach one, I panicked and felt like i would be interrupting something, After about ten minutes of hovering like a confused houseplant, I started feeling embarrassed and really out of place, So… I left Quietly. I didn’t say goodbye because everyone looked busy and I didn’t want to make it weird. An hour later, Jay texted asking where I went. I told him I felt awkward and didn’t want to intrude. He replied with Dude what?? You should have just jumped in lol. Then today at work, another friend joked that I ghosted the party and told me I should have at least tried talking instead of acting like a scared kid. Now I feel stupid like maybe I should have pushed through the discomfort. I didn’t want to be rude, but I also didn’t want to force myself into conversations where I clearly didn’t fit, So AITA for leaving instead of trying harder to socialize?  ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6s4vn/aita_for_walking_away_from_a_group_hang_because_i/","permalink":"/r/AmItheAsshole/comments/1p6s4vn/aita_for_walking_away_from_a_group_hang_because_i/","score":8,"num_comments":11,"over_18":true,"stickied":false,"created_utc":1764113528.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rr35","name":"t3_1p6rr35","subreddit":"AmItheAsshole","author":"Junior_Swing3644","title":"AITA for not wanting to invite my family to Thanksgiving?","selftext":"I (25M) was invited to my girlfriend’s (24F) family Thanksgiving a few weeks back. Normally I spend Thanksgiving with my family, but because my sister is sensitive to being around alcohol, I didn’t immediately ask if they could/wanted to come.\n\nA few days later, my dad asked if he and my sister could come. I told him I’d ask my gf but warned them there would be alcohol and it might not be the best environment for my sister. He said it shouldn’t be a problem, because they could drive separate and leave early if it was too much. My gf shared the same concerns, but she still checked with her relatives and got the okay after her and I talked about it. I relayed everything to my dad, and he seemed excited. He even planned to bring desserts and appetizers for everyone.\n\nLater, my gf found out the gathering would be a lot smaller than last year and probably less hectic/less alcohol, so I relayed that to my family. My dad and sister said that made them more comfortable and were still excited to join.\n\nTwo days later (11/19), I came home from work and shared my excitement for the event. My dad proceeded to tell me he and my sister were going to a family friend’s Thanksgiving instead, saying he “forgot to tell me“ and smirked. I was speechless and crushed. I ended up going for a drive to cool off because I really didn’t know what to say to him. I texted my sister how I felt about what our dad said. She replied that she didn’t feel comfortable around alcohol and that our dad made the decision two days earlier… the same day I told him it would be a small gathering.\n\nI didn’t talk to them for a couple days bc I was pissed. I invited my gf to hangout (11/21) and we were talking downstairs about work, finances, plans to live on our own, and a little about Thanksgiving. Then out of nowhere, my dad stormed downstairs and started yelling that I was “talking shit” about him and my sister. Our conversation had nothing to do with them. The yelling and accusations continued, and I asked to go outside because I didn’t appreciate all the yelling in front of my gf. For context, my dad is usually very calm and this was the angriest I’d ever seen him. When I asked what I supposedly said, he couldn’t name anything and eventually admitted I was right about what transpired. \n\nWe talked it through the next day, and I explained my issue wasn’t them choosing another Thanksgiving, but the lack of communication and agreeing to plans they didn’t intend to keep. \n\nI also told my dad that he owed my gf an apology for yelling in front of her and for cancelling on us when her family was nice enough to include mine for Thanksgiving.\n\nNow, today (11/25), my dad texted me asking if he’s “re-invited” to my gf’s family Thanksgiving. But my gf and I already told her family they weren’t coming, and honestly, I feel weird about inviting them again after all this.\n\nAITA for not wanting to re-invite them?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6rr35/aita_for_not_wanting_to_invite_my_family_to/","permalink":"/r/AmItheAsshole/comments/1p6rr35/aita_for_not_wanting_to_invite_my_family_to/","score":7,"num_comments":35,"over_18":false,"stickied":false,"created_utc":1764112549.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kha0","name":"t3_1p6kha0","subreddit":"AmItheAsshole","author":"Ardilla_sovietica","title":"AITA for tellings a guy's brother that the guy hasn't pay me yet?","selftext":"I'm a chef, currently I'm studying another career, in a final test we have to do an exhibition of our art and the teacher asked us if we can give some snacks. I said I could do them of the rest of the group pay me on time, they say yes, I did the costing two weeks ago (the day is on this Friday) and some people hasn't pay me yet (4 dollars). I know the brother of this guy because he is friend  of a friend and we were hanging out, I told him as a gossip \"hey your brother hasn't pay me yet\" but he actually told him 🥲.  Now he pay me, but told me he was mad at me and the group too, but I've been telling for two weeks for the money because it needs more time, now I'm stressed because I need to arrive home really early to cook while they hate me.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6kha0/aita_for_tellings_a_guys_brother_that_the_guy/","permalink":"/r/AmItheAsshole/comments/1p6kha0/aita_for_tellings_a_guys_brother_that_the_guy/","score":8,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764095806.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6id0r","name":"t3_1p6id0r","subreddit":"AmItheAsshole","author":"dontatme939393","title":"AITA for bailing on plans because my friends are always late","selftext":"I have a good group of friends but 2 of them are late like 80% of the time. The 20% they’re not is when I complained about them being late.\n\nRecently we had plans to grab beers. They said they were gonna be late at the time we were suppose to meet so I just said something came up. I think they know I bailed cause they’re late and one might be mad, which I think is ridiculous. AITA for bailing cause they’re late?\n\nTLDR: friends are always late, now I cancel completely last minute when they’re late. AITA\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6id0r/aita_for_bailing_on_plans_because_my_friends_are/","permalink":"/r/AmItheAsshole/comments/1p6id0r/aita_for_bailing_on_plans_because_my_friends_are/","score":6,"num_comments":20,"over_18":false,"stickied":false,"created_utc":1764091179.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t68p","name":"t3_1p6t68p","subreddit":"AmItheAsshole","author":"faery_taxidermy","title":"AITA for walking out on my boyfriend after waiting an hour at the arcade","selftext":"I work part-time at a mall, after my shifts I usually meet up with my boyfriend at the adjacent arcade. He likes the arcade alot, being a frequent visitor/player. I have to leave at a certain time, so tell him I have an hour til I'm going. He stays at the arcade the entire hour despite him saying that we'll go back to his house. I'm tired so really wanted to go back to his house to cuddle in bed - which we don't. I inform him of the time periodically whilst he's playing rhythm and token games til the end of an hour rolls around and I say goodbye. By then I'm frustrated, having watched him mess around at the arcade for an hour half-asleep, and walk off. He's busy playing a token game so I don't ask for a hug or kiss, I just leave. He's sad about this. I apologized to him and I don't expect an apology from. I feel like I shouldn't have walked away so suddenly, I think I ought to have been clearer to him and I feel like the asshole for making him upset and worrying him by my leaving.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6t68p/aita_for_walking_out_on_my_boyfriend_after/","permalink":"/r/AmItheAsshole/comments/1p6t68p/aita_for_walking_out_on_my_boyfriend_after/","score":7,"num_comments":15,"over_18":false,"stickied":false,"created_utc":1764116262.0,"edited":1764116892.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6k8u8","name":"t3_1p6k8u8","subreddit":"AmItheAsshole","author":"Little_Web_3659","title":"WIBTA if i bought myself a phone case and used my new phone despite being told i'm not allowed?","selftext":"i actually can't believe i'm even making this post the situation is so ridiculous but here i am\n\ni (22f) am living back at home after graduating college. not ideal but at least i'm saving money. recently my iphone xr that i've had since 2019 hasn't been loading well and crashes for 15-20 minutes at a time when i want to open an app. my mom noticed this and agreed i needed a new phone. she decided to get her and my brother (20m) new phones too and just do another family plan. i contribute my portion, my mom takes care of hers and my brothers since he's autistic and can't get a job. the phones were ordered 2 days ago and delivered today. at first i was told that if i wanted to use my new phone i have to buy myself a case. cool totally fine, normal reasonable. a few hours later i got told that i'm not allowed to buy myself a case cause i \"don't have money\" when i do have money and can in fact afford a $15 dollar case, i'm just in between jobs about to start my new one in two weeks. i was then also told that i have to wait for my brother to open his phone next week as that's his birthday present before i can set my new phone up. since my phone hasn't been working properly and i will be out of the house with friends multiple times before my brother gets his phone, would i be the asshole if i just went ahead and ordered my own case despite being told i'm not allowed?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6k8u8/wibta_if_i_bought_myself_a_phone_case_and_used_my/","permalink":"/r/AmItheAsshole/comments/1p6k8u8/wibta_if_i_bought_myself_a_phone_case_and_used_my/","score":6,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764095289.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6gysy","name":"t3_1p6gysy","subreddit":"AmItheAsshole","author":"honeymeadowss","title":"AITA for parking .. on the street?","selftext":"Right so… one of my neighbours has just called me a twat for parking on the side of the road on our street.\n\nEverybody parks on one side of the road on our street. I usually park on the side of the road directly opposite my house, and he usually parks on the side of the road (infront of me) directly outside his house. Like, my car behind his, if this makes sense?\n\nI’ve parked in that general section since I got my car. My partner and a family member used to park behind us (like one house worth of space back, to avoid parking infront of a driveway), but now no one uses that area because a huge tree overhangs it and the cars get covered in sap and bird poo. So I’ve just kept parking where I do out of habit and not wanting to have a pooey sappy car.\n\nI’ve maybe parked in ‘his’ spot once every couple of weeks if my space is taken. He has never hinted that he had an issue with it… no funny comments, no notes left, no sighs, nothing. We’ve even been outside at the same time loads of times while he’s fixing his car and he’s never said a word.\n\nBut today, right after I parked, he pulled up and immediately shouted to his wife ‘that tw*t has f***ing parked there again’. When i said what’s the problem, he pulled the whole “I’ve lived here for however long” speech🙄 He also said he needs the space because he cares for his disabled dad and is in and out pretty often. Which, yeah, fine. If he’d told me that nicely at any point, I would’ve happily kept the space clear. But instead he went straight to insults.\n\nHe also started moaning about my family having three cars, even though one is on our driveway and the other parks around the corner (where those neighbours moaned about the car being around the corner so we literally cannot win!!).\n\nAnd the funniest part? He actually has a driveway himself but doesn’t use it. There’s something small ish covered in plastic sitting in it. But surely if he’s so bothered about being so close to his car he’d move whatever this is to eg his back garden and use his driveway?\n\nI’ve left my car there out of pure annoyance, but I’m not actually the kind of person who can be petty for long. I just don’t get why it went from zero issue to name calling out of nowhere.\n\nAITA?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6gysy/aita_for_parking_on_the_street/","permalink":"/r/AmItheAsshole/comments/1p6gysy/aita_for_parking_on_the_street/","score":7,"num_comments":40,"over_18":false,"stickied":false,"created_utc":1764088113.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p689j1","name":"t3_1p689j1","subreddit":"AmItheAsshole","author":"Standard-Use-506","title":"AITA for asking why my new flatmate hadn't done his chores","selftext":"To set the scene, new flatmate (m) moved in 3 weeks ago, myself (f) and the other flatmate (f) have been living together for 2 years at this point.\n\nWe have a weekly chores rotation, Mon-Sun. Last week new flatmate was on Bathroom, on Sun he said he would do it on Mon. I was ok with that, one days difference isnt a big deal. Mon night I went to spend the night at my sisters, told them I would be back Tue afternoon. I left Monday 7:30pm and the bathroom hadnt been done. Came home today around 5pm and bathroom sill wasn5 cleaned. I put this message in the group chat - \n\nUmmm, just got home and noticed the bathroom still hasn't been cleaned from last week?\n\nThis is the message he sent back a few hours later -\n\nBathroom is now done. Bath tub skipped as instructed by the next person on the roster for the area and toilet exterior done to a standard apparently far exceeding it has been done in the recent past judging by the excessive dust buildup on it.\n\nFYI I would strongly recommend that if anyone doesn't fancy looking to find a new flatmate and a half anytime soon you rethink your coexistance communication style to be far less accusatory and disrespectful. For the sake of flat harmony I will overlook your rudeness this time as you can't have known I had a death in the family yesterday so didn't get it all done yesterday so wasn't really in the mood all day to be working on chores so did them admittedly later than planned (but still DID them as I always intended).\n\n\n\nToliet is next to a window and next to the dryer. Its always dusty, you can clean it and within 2-3 days it is  dusty again. Cause he's new he isn't aware of that.\n\nI get that he's fresh in his grieving so being unable to do his chores is understandable. Where I'm having an issue is that he is defensive and went to attack mode.\n\nTaking into account the bathroom should have been done last week, he works from home, that I was at the time of the message unaware that someone in his family had died.\n\n It feels a little like he is using the death in the family as both a reason and a justification for the elevation.\n\nFurther context-I have CPTSD and my first instinct was to attack back and second was to people pleaser and apologise. When something triggers me, I take a step back and give myself time to think through why I feel the way I do, if it is justified.\n\nI have not responded and think it's best to let things settle before confronting the situation. I have therapy on Thur so I want a chance to talk it through with my therapist and then come back to it on Fri. I get that 4 days isn't long when it comes to grief but I also feel like this kind of behaviour cannot go unaddressed for long.\n\nI get it may seem like I don't think I'm the ahole, I kinda don't, but i get that my CPTSD may be colouring how I see the situation and that i may be the ahole so need some outsider perspective.\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p689j1/aita_for_asking_why_my_new_flatmate_hadnt_done/","permalink":"/r/AmItheAsshole/comments/1p689j1/aita_for_asking_why_my_new_flatmate_hadnt_done/","score":3,"num_comments":31,"over_18":false,"stickied":false,"created_utc":1764063406.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tgqx","name":"t3_1p6tgqx","subreddit":"AmItheAsshole","author":"Earth877OK","title":"AITA for expecting to be added to husband’s(36m) account?","selftext":"My husband (m36) I’ve been with for 6 years joked about me having adds on YouTube and I said well why don’t you get me access to your YouTube premium account then and he thought that I should pay for my own (neither of us are sure that I can be added for free or not) but I said if it’s free that’d be nice if you could just add me and he brought up how it seems like I think marriage means I just have a ticket/ access to stuff like that he pays for and this lead to a fight between us where I brought up he can do more of the household work if he thinks like this way. Am I being the asshole or him? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6tgqx/aita_for_expecting_to_be_added_to_husbands36m/","permalink":"/r/AmItheAsshole/comments/1p6tgqx/aita_for_expecting_to_be_added_to_husbands36m/","score":4,"num_comments":37,"over_18":false,"stickied":false,"created_utc":1764117047.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p616ls","name":"t3_1p616ls","subreddit":"AmItheAsshole","author":"LuminousLapis1122","title":"AITA (21M) at fault for asking my neighbor to grab my packages?","selftext":"One of my first ever posts here goes.\n\nSo I have been living on my own for about half a year now, renting the basement of an apartment. I have an upstairs senior neighbor who rents the apartment above me. I've interacted with him a few times since moving in, and he seems to be a decent guy. We've gotten along fine, and I've even borrowed and returned several tools to repair things in my apartment since this is my first time renting a place.\n\nThe first incident happened when I Doordashed some Taco Bell after work. I was playing some games on my pc when I got the notification that it was delivered and couldn't grab it immediately. So I hurried and finished up my game and went outside to grab it, and it wasn't on either of our doorsteps. So I go back inside and message him, \"Hey, did you pick up my food?\" No response till a minute later, and I hear movement upstairs, so I open my door, and he drops my order down about five feet onto my steps. Before I could say anything, he went back inside, and I set my order down on the floor inside, and a few minutes later, I realized my Baja Blast had seeped into my tile floor. It was sticky for a few months after that.\n\nThe second incident was a few days ago. One of my partners sent me their old GPU for my PC, and shipped it. It arrived, and he did the same thing, opened the door, and tossed it on my doorstep, same as before. Thankfully, the GPU wasn't damaged, so no harm there.\n\nSo those were the first two. The newest incident was just today. I ordered a body pillow from Amazon to try and help with my sleep since I sleep on my side. It gets delivered while I'm at work. So I get home and message him, \"Hey, did you get a package with my name on it?\" I walked outside, saw the package, and walked back inside and messaged him, \"Never mind, I got it, thank you.\" He responds with, \"I'm not touching anything with your name on it.\" Fair enough, I can't blame him for that, so I reply, \"Thank you, I'll know it'll be on your doorstep.\" He lastly responded with, \"Just because you have something delivered to our address doesn't mean it's my responsibility. I won't try to help you again.\"\n\nSo I'm sitting here now just thinking about it. Is it really that much to ask for him to grab a package that's already on his doorstep and just hand it off to me, and not throw/toss it on my doorstep?\n\n  \nEdit: I have never asked him to hand-deliver my packages. I have merely asked him if A: He got my package by mistake, B: If he did then could he put it on his doorstep, and C: to hold onto it till I could knock on his door. I'm not asking him to deliver it on a silver platter. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p616ls/aita_21m_at_fault_for_asking_my_neighbor_to_grab/","permalink":"/r/AmItheAsshole/comments/1p616ls/aita_21m_at_fault_for_asking_my_neighbor_to_grab/","score":4,"num_comments":34,"over_18":false,"stickied":false,"created_utc":1764038938.0,"edited":1764040328.0,"link_flair_text":"Asshole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i1qe","name":"t3_1p6i1qe","subreddit":"AmItheAsshole","author":"Alert_Holiday_5848","title":"AITAH for accepting about 15% of the total prize for a competition i participated in ?","selftext":"so  i was in a random group for one of the courses in uni  and we got to work on creating apps and stuff , so in the second sem we found that there is a competition open for us to join , so me and one of the group members participated in it with our idea (the others did not want to join ) and we had online sessions explaining stuff about it and everything , i joined those sessions but my team member did not , and generally he did not respond to my inquiries about what to do so i naturally assumed that he did not wish to continue in which i respected and forgot about the whole thing , only to be surprised with getting a notification that we have a presentation about our idea, so i went and asked him about it and he mentioned that he has been working on it this whole time without telling me , i did ask him if he needs any help or if i could do anything but he also did not respond to that  but we did present  and we won the first place and he got about 84% of the prize (we got 50% each and i gave him the rest from me as he did work on it  ) now he is all mad and is saying that it is injustice and that he did everything and wants all the money  , so am i the ah for taking 16% ?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6i1qe/aitah_for_accepting_about_15_of_the_total_prize/","permalink":"/r/AmItheAsshole/comments/1p6i1qe/aitah_for_accepting_about_15_of_the_total_prize/","score":4,"num_comments":27,"over_18":false,"stickied":false,"created_utc":1764090492.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pq54","name":"t3_1p6pq54","subreddit":"AmItheAsshole","author":"Longjumping_Stay5625","title":"AITAH for seeking help for a 5yr old special needs?","selftext":"Hello, i don’t wanna seem desperate but I really need help. (English is not my first language so don’t mind my grammar) I’m a teacher helper in a special needs school, we work with kids with a lot of different type of disabilities from the ages of 2 all the way to 23. We are trained to handle a kid in crisis, as well as for the safety of the kids there’s cameras with a clear view of the whole classroom in the entire school. Now to what’s happening. I have a sweet but very explosive 5 year old in my class, a very smart kid for his age in my opinion. I love my job with a passion when it comes to working with kids, but to be in a special needs school it requires a LOT of patience. Kevin (fake name) is a really sweet kid, but it’s his way or no way. Whenever we ask him a question of any type when it comes to school work or even participating, he would avoid it by asking other questions. It’s not that bad right? No but there’s a lot more. We have other kids that are either verbal or nonverbal, usually we help a lot more the kids that needs a guide right beside them and most of them do things by themselves. Kevin knows his first and secondary colors, shapes, writing by himself, tie his shoes, tells you when he’s mad etc. I’m not a professional to state what he has, but most definitely has the intelligence to be in kindergarten or even 1st grade. Kevin likes everything being done his way like, not wanting to take a nap in nap time, tracing his name, wanting to play with other kids but wants the toys to himself, not wanting to get his dipper changed, constantly wants other kids to share their food with him after already having school and home lunch. I love Kevin and I’m always with him, but now his behavior is getting worse to the point behavior professionals and therapist can’t help. We have tried rewards with snacks but wants the whole bag to himself, toys but teases others for not getting the same treatment, tried reverse psychology, tried time out, nothing has been working. Kevin takes off his shoes and throws them to the other kids even though he’s not angry at them, hits the teachers, pinches, throw chairs, tries to break classroom decor, screams from the top of his lungs and all of that because he couldn’t have a crayon stand straight on the table. He throws fits for the smallest things and quickly goes for harming others. I have kids that have sensitive hearing when it comes to high pitched screams or even crying, sometimes we have to protect Kevin from the other kids before Kevin gets bit or even having a hand shoved in his mouth to shut him up. We were trained that after a hit we do a one arm wrap and after they calmed down for 2-3 minutes we let them go and give them space to calm down. With Kevin I’ve gotten up to a whole hour of holding down with the one arm wrap and eventually switch with another teacher after using force for so long. AITAH for seeking ways to help him outside of school?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6pq54/aitah_for_seeking_help_for_a_5yr_old_special_needs/","permalink":"/r/AmItheAsshole/comments/1p6pq54/aitah_for_seeking_help_for_a_5yr_old_special_needs/","score":2,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764107611.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nvbg","name":"t3_1p6nvbg","subreddit":"AmItheAsshole","author":"WesternOk405","title":"AITA for asking our neighbor to take their barking dog in so ours can go out too","selftext":"We have rented our home for the last 6 years and had several neighbors move in on either side. Some with dogs others without. We also have dogs, hounds, so they’re loud barkers/howlers. The barking of any dog, ours or theirs, is not an issue.. obviously.\n\nThe issue is our newest neighbor has a dog that literally charges our shared wood fence to initiate a reaction and/or antagonize our dogs. Barks incessantly and scratches at the fence. And is literally out 90% of the time and the neighbors have not once come out to correct him or bring him in. Until today… roughly 6-8 months and only because my husband yelled at the dog.. cause frankly this is exhausting.\n\nAs we have done for the last 6 years, to share the space and to not cause any grief between other neighbors who maybe don’t want to listen to dogs bark all day, my husband and I will bring ours in if they have been out for awhile or stand outside to minimize the chaos and correct our dogs. All other neighbors, past and present, extend the same courtesy… just not this one.\n\nI work from home and assume someone next door does as well since the dog is out nearly all day. I know because we have cameras and I hear him outside barking incessantly.\n\nWhy I feel this is an issue.. firstly, seems like common neighborly courtesy and secondly, no one’s dog is doing its business when they’re trying to attack each other through the fence.\n\nAITA for asking the neighbor to extend the same courtesy of sharing the space and asking that once or twice a day she acknowledge her dog is obnoxious and bring him in?\n\nWe did have an exchange and asked if she would bring her dog in on occasion if she hears him attacking the fence and barking so our dogs too could be outside for a minute… to which she responded “should we set up time slots?” And proceeded to explain “they’re dogs. They bark”… \n\nOur dogs also aren’t always out very long, only on occasion when hers isn’t. Their choice, not ours.\n\nTLDR: fence sharing neighbor leaves their dog out all day, barking incessantly and antagonizing our dogs making it difficult to use our own yard. Asked neighbor to bring their dog in on occasion if they aren’t going to correct him as we bring ours in so hers can be out.. AITA for this?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6nvbg/aita_for_asking_our_neighbor_to_take_their/","permalink":"/r/AmItheAsshole/comments/1p6nvbg/aita_for_asking_our_neighbor_to_take_their/","score":1,"num_comments":24,"over_18":false,"stickied":false,"created_utc":1764103334.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6iv3o","name":"t3_1p6iv3o","subreddit":"AmItheAsshole","author":"Godsfavoritebabe","title":"AITA for defending my feelings when my family called me selfish?","selftext":"My birthday is on December. Last year, I was in a long-distance relationship with my now-ex, and the relationship had already become stressful. He would go silent after every argument, even though I told him many times how much that hurt me. I was usually the one who came back and tried to fix things.\nHis birthday his before mine and We weren’t talking, i can’t remember why ( honestly it was a pain to stay peaceful, we fought so much) but i managed to call him,sing for him, just to make him feel special. i even managed to make him a long distance gift . After that, he suddenly talked to me like nothing ever happened.\n2 days before my birthday, there was another argument, and he stopped talking to me just like always. My birthday is one of the happy and sad day of my life because it always remind me of my grandma who liked to celebrate it more than anyone, he knew it and since she passed away it always has been difficult for me to had a good day on my birthday. \nOn my birthday i waited all the day to see if he’ll call or text or post me , i had great wishes even from people i didn’t know, even his family but i was just waiting and waiting. After that i took the firm decision to broke with him because  i needed him for once and he wasn’t there. \n5 days after my birthday his mom called me to ask me why her son didn’t post me she didn’t like that and she was wondering what was going on. I politely told her she should ask him because I didn’t know either. Later that day i received a call from him, crying, begging for forgiveness, he said that he didn’t reached out because he thought i wouldn’t answer (something I had literally never done to him)i said i’ll try to forgive him because ngl i really believed that he was the one. \nTwo months later, things still didn’t feel right, and I ended the relationship for good.\nHis mom called me after that, she told me I was selfish and I did not care about the family bonds(…?)and she said I was not “made for marriage” because I couldn’t forgive something “so small”, some of my family agreed with her( it hurt me a lot). But my sister supported me, she saw me crying and understood why I couldn’t keep doing this. \nNow I’m wondering..\n","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6iv3o/aita_for_defending_my_feelings_when_my_family/","permalink":"/r/AmItheAsshole/comments/1p6iv3o/aita_for_defending_my_feelings_when_my_family/","score":0,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764092289.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t8c6","name":"t3_1p6t8c6","subreddit":"AmItheAsshole","author":"throwawayosproj","title":"AITA for rejecting my group project partner's redesign of the project after we already agreed differently?","selftext":"I (m24) am in a graduate level operating systems class. Our final project is to build a small teaching kernel with our own process scheduler, memory manager, inter process communication mechanism, and some basic user space tools.\n\nMy partner (f22) and I split the work early. I would handle the process scheduler and the low level CPU context switching, and she would implement the inter process communication subsystem. We agreed on it at the start. I built a Multi Level Feedback Queue scheduler because it was listed as a recommended baseline in the assignment sheet.\n\nLast week she told me she was getting unpredictable message latency in her inter process communication layer because the wakeup rules in my scheduler caused threads to drop into lower priority queues under some load patterns. She explained, really confidently, that the issue was not in her code but in how Multi Level Feedback Queue works as a design. She said we should switch to a proportional share scheduler, specifically a stride based proportional share scheduler, so message passing threads wouldnt get stuck with weird priority changes that made her throughput analysis kind of meaningless.\n\nI honestly thought she was over thinking it. This is a teaching kernel, not production. I told her that switching the entire scheduling algorithm this late could break invariants I had already built around, especially the context switch routine and the accounting stuff. She pushed back and said proportional share scheduling is actually simpler in a bunch of cases, and that my code was \"artificially constraining\" the rest of the system.\n\nShe went and built her scheduler anyway over a weekend and sent a pull request. She included benchmarks, some diagrams of expected fairness behavior, and notes comparing our current latency graphs with the stride ones. I didnt fully read everything, I just skimmed and saw it touching almost every scheduling structure.\n\nI rejected the pull request. Then, because her changes altered structures my code depended on, I force pushed my branch to the main repository to \"reset things\". She messaged me right away saying that force pushing to main in a group project is not ok and that I had basically wiped two days of her work.\n\nI told her that if she wanted to \"experiment\" she should have done it in a feature branch and not replaced the scheduling subsystem without any agreement. She replied that she did use a feature branch... and that submitting a pull request is literally how you open a discussion, but I shut it down without answering the technical parts at all.\n\nNow she is barely talking to me and only sends short little updates. Some classmates told me she is one of the strongest systems programmers in the cohort and that her stride scheduler was actually a good call for inter process communication predictability, and yeah that made me feel a bit weird. But I still feel like rewriting a kernel subsystem right near the deadline is kind of reckless.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6t8c6/aita_for_rejecting_my_group_project_partners/","permalink":"/r/AmItheAsshole/comments/1p6t8c6/aita_for_rejecting_my_group_project_partners/","score":1,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764116418.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m3ns","name":"t3_1p6m3ns","subreddit":"AmItheAsshole","author":"Cool-Cup3703","title":"AITA for not wanting to apologise to my mother?","selftext":"Hey Reddit. I’ll be A (author), my mother is M (mother)  and my father is K . Our arguing basically started years ago. M always acted like she knew exactly what she was doing and never let anyone question her. I was part of that. No meds, no vaccines since birth, even though I was born early, had lung problems, and spent time in the NICU. She lived in this ultra-healthy almond-mom bubble while I was just a kid who didn’t want kale smoothies or fasting weekends. I remember being jealous of my cousin’s normal family. \n\nK used to drink a lot, which definitely made everything worse. Around age eight or nine, M started spreading rumours about my cousins and even called a nine-year-old “fat,” which wasn’t true at all. That’s when she began arguing with me about literally everything. I wasn’t a rebel, but I wasn’t silent either. If she mocked twelve-year-old me for taking extra pasta and called me a hippo, I wasn’t going to sit and smile. It got to the point where I texted random people pretending they worked with EDs just to hear someone say her behaviour wasn’t normal. I even recorded some of her comments because she’d twist things later and call me a liar.\n\nK wasn’t on my side but not hers either. Alone, he admitted he noticed how strange she was about food and lying, but he didn’t want to risk her threatening divorce or saying she’d take my sisters away, leaving him “with his alcoholic ass and a monster child.” That one stuck with me.\nFast forward to today. I’m still underage, living with them,im a pro athlete, waking at 4:30, studying (yet im the lazy one). Me and my sisters were chatting while my phone was on the table. M joined; I poured her tea, and she immediately slipped into that mocking tone. She commented on my eating habits, studying,etc. I’ve been interested in History and Geo, and she didn’t even know India was in Asia until I told her, but she still argues like she’s an expert.\nWe somehow got to Japan invading China. I said it was Japan–China; she insisted it was the opposite and suddenly accused me of wearing a crown and treating everyone like trash. My sisters and K were confused because nothing was even heated yet. I tried to speak, but she kept talking over me about my ego.\n\n\nWhen it finally died down, I stayed quiet, scrolled my phone, angry but trying not to push it. She didn’t drop it. She started loudly complaining about me for K to hear. That’s when he snapped and yelled at her, saying he’d had enough of her treating me like trash over nothing and asked why she kept yapping.\nShe ran to the bathroom, cried loudly on purpose, said how terrible I was and that I was the biggest mistake of her life. Classic routine.\nNow K says I should apologise because the tension is destroying him and M, and causing endless arguments. But I genuinely don’t think I did anything wrong. We talked before about boundaries, especially food topics, because I spent years being mocked and was even hospitalised at thirteen. She ignores all of that and then says I’m the one crossing lines.\n\n\nSo, AITA for not wanting to apologise at all?\n\nEDIT: thanks yall for the comments! Here are some corrections and add ups: the whole fasting thing was her way of thinking since my early childhood , got to the point where i at the age of 13 got hospitalised malnourished and dropped lots of weight , so thats her common way of thinking. About that- she was scolding me even after for taking antibiotics and \"spending her money on nonsense\" -called nutridrinks my father insisted on. (Just to make things clear about the weight comment which i feel is really out of place) . \nSome people mentioned moving out- i considered it an option, my school got really nice dorms i can use from next year, but suddenly she doesn't want me to leave. Before, my mother was also threatening me she will throw me outside at -5°c in late October, slavic reality 🤷🏼‍♀️. Tried making it fun for me-sent her a few links to apartments, asking if she will pay for me if she wants me out, which led to another argument.\n\nGladly its not all so bad, i have really good support from my Aunt and Cousins from fathers side, and money that was saved for my education and later housing, so if my mother will go nuts-it's possible to move out .","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6m3ns/aita_for_not_wanting_to_apologise_to_my_mother/","permalink":"/r/AmItheAsshole/comments/1p6m3ns/aita_for_not_wanting_to_apologise_to_my_mother/","score":1,"num_comments":40,"over_18":false,"stickied":false,"created_utc":1764099356.0,"edited":1764102899.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61652","name":"t3_1p61652","subreddit":"AmItheAsshole","author":"GayAnimeGurll","title":"AITA for being jealous over my 'best' friend spending more time with another one of our mutual, close friends?","selftext":"First post, not sure what all the Reddit specifics are, however, I wanted some advice from outsider viewers. \n\n  \nFor some context, I'm a very indifferent teenager and never really give a shit about much, so me being jealous worries me, to be honest. Me and my friends are the alternative group in our small school, there's about 10 of us. I joined this group at about the end of 2024, leaving my old one because of the toxic area, and all around creepy vibe it ended up having, none of the people there was actually in my grade, either.I would only sit with them at lunch due to that.  \nI became friends with 2 of the members of my current group back in grade 8, but got closer with another group member (let's call her K) cause we both played Volleyball. She and I both liked anime and spent time together. We almost ended up dating, but decided we rushed into it too quick (we're both girls btw). After that, we somewhat drifted apart and only really talked in class since we had basically every class together. After I finally worked up the nerve to leave my old friends, I became closer with - who I thought was - my current best friend, E. She and I bonded pretty quickly and hung out a lot. Looking back now, it always took extra reminding to hang out with her outside of school, but we texted and called very often. We we're basically best friends for almost 2 years (late grade 8 to mid grade 10). Then, after term 2 or term 3 of school, she, out of the blue, became so close with K. Now, don't get me wrong, I really like K. We have good conversations and we have similar interests and she's glad I escaped my old friend group. But lately, it feels like E has been really rude to me. One time in class, K was playing some Beatles song on the piano and both her and E are obsessed with the Beatles. I, however, don't. Well, I don't care nor listen to them, anyway. So, I made the comment that I don't listen to the Beatles, since I didn't know the song, and E has an outburst. \"FUCK YOU! YOU HAVE THE MUSIC TASTE OF A THREEE YEAR OLD.\"   \nI was shocked and laughed it off since it was in the middle of class, but it honestly really hurt. There's been a few other things since then where I feel like she's juts been ruder to me than usual. I am slightly jealous over her current relationship with K, since it was random and she's now being rude. E was also the only person who made an attempt to get to know me after I left my old group. So, now her being rude to me really, really hurts. I'm the type of person who always goes over to the person and tries to talk through issues. However, due to the current, teenager turmoil in my friend group, I don't feel comfortable talking to her or K about it, since K is sort of the 'leader' of the group, and I don't want to be next on the chopping block. I was considering texting her and asking if we were 'good'. But I really don't know. But am I the asshole for being jealous??","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p61652/aita_for_being_jealous_over_my_best_friend/","permalink":"/r/AmItheAsshole/comments/1p61652/aita_for_being_jealous_over_my_best_friend/","score":1,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764038903.0,"edited":1764039936.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5znzj","name":"t3_1p5znzj","subreddit":"AmItheAsshole","author":"SyndicateSystem","title":"AITA For Getting Into An Argument With My Manager","selftext":"I (26F) got into an argument with my manager (\"M\" for short). And while I have received feedback from friends that I'm not in the wrong, I figured I would get advise from complete strangers who don't know anyone in the story.\n\nI work at a tiny mom-and-pop-shop restaurant in a small town. A few months back we all learned that we were closing down - it's not because we're not getting business, but *it is* because of bad business practices. Either way, I've been really upset and scrambling to apply for other jobs. Due to the fact that we're closing, the majority of the employees have a \"don't care\" attitude - the exceptions to this are myself and M. And while, yes, part of me doesn't care anymore since I'm more focused on finding new employment, I still care about this job for the sake of M.\n\nSo onto the real problem; Last week I was cleaning the fryers and doing a bank run to do the deposits (not necessarily my job but I'm trying to make things less stressful for M), and when M came in, she said hello and asked how I was. I had a lot on my mind, so I nonchalantly greeted her back and said I was \"fine.\" It's typically a lie, but it's the most common one I tell, so I can get away with people believing it.\n\nFast forward to a few days later, when we're working together on opening shift. I don't remember exactly what prompted the conversation to happen, but at some point during the conversation, M brought up how she enlisted my coworker/friend - (nicknaming her \"V\" after my favorite fictional character IYKYK) - to get information about why I \"hate\" M. Here's kind of how the conversation went (to the best of my memory):\n\nM: \"If that's true, then you wouldn't be ignorant, rude, and disrespectful to me.\"\n\nMe: \"How am I being rude to you?\"\n\nM: \"You don't care about this place like I do. You speak to me with ignorance. You're very rude in your responses and how you talk to me.\"\n\nMe: \"I don't understand how I'm being ignorant.\"\n\nM: \"It's just disrespectful to not care when I've bent over backwards and 'cut my own throat', and denied receiving raises so that the rest of you guys could get those raises. And it's very ignorant that everyone here does not treat me with respect for that.\"\n\nMind you, readers, this is the first time M has ever admitted refusing money to make sure the rest of us could receive raises instead. She's told us she's refused her raises, but never for THAT reason. This new information made me angry, and I raised my voice at M.\n\nI yelled, \"None of us asked you to deny your raises!\"\n\nM: \"I know, but I still think it's not fair that you don't care about this place even though we're closing. And I think you should just leave if you're not going to care.\"\n\nI then yelled back that I wasn't leaving until the end because I made her a promise. From there, we went our separate ways for the rest of the day. I know I shouldn't have raised my voice, but AITA?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p5znzj/aita_for_getting_into_an_argument_with_my_manager/","permalink":"/r/AmItheAsshole/comments/1p5znzj/aita_for_getting_into_an_argument_with_my_manager/","score":2,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764034632.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sy6y","name":"t3_1p6sy6y","subreddit":"AmItheAsshole","author":"TBRose729","title":"AITA for Potentially Ripping Off an eBay Seller?","selftext":"I (27M) have been looking for the Nightwish live album \"Showtime, Storytime\" on vinyl for literal years. The album is the first release with their current (and IMO best) vocalist, Floor Jansen, and it is mixed brilliantly; the album sounds phenomenal. Given how fantastic vinyl sounds compared to other audio formats, I've wanted to add my favourite album to my collection for quite some time now. \n\nUnfortunately, the album was released in 2013 and Nuclear Blast (label) only pressed 500 copies of the album on vinyl. As a result, and for the reasons above, it has become an incredibly rare and highly sought-after item, both to play and as a collector's item. On the rare occasions a new copy pops up for sale online somewhere, it goes for at least $400-$500 (AUD). At time of writing, Discogs have eight copies for sale and the cheapest is just under $750 AUD. \n\nThis brings me to my conundrum. After years of fruitless searching in vinyl groups, Nightwish groups, and second-hand vinyl retailers, I finally got extremely lucky. I did another periodic search online expecting to find nothing and to my surprise, a listing came up on eBay for a sealed, new copy. To my IMMENSE surprise, it was only listed for $150 AUD. \n\nI honestly assumed I had made a mistake and was looking at the wrong listing, but nope, it was clear. \n\n\"**Nightwish - Showtime, Storytime - 2 Disc Vinyl \\*SEALED\\***\"[](https://www.ebay.com.au/sch/shamrok_collectables/m.html?item=389211560336&rt=nc&_trksid=p4429486.m3561.l161210) \n\nThe photos matched, the shrinkwrap was still intact, and Nuclear Blast's sticker was on the front. The seller had a 100% rating and had \"collectibles\" in their name, so I was pretty confident I'd found a live one!\n\nI was freaking out in sheer delight and, being aware of how popular it was, immediately bought it using Afterpay (PSA: Use Afterpay responsibly!) Once it arrived, I was ecstatic to find it was indeed the real deal, and the only damage noticeable was a split in the shrinkwrap.\n\nHere's where my dilemma comes in - when I told my friend Adrian (28M) the story, he half-jokingly said \"oh, so you ripped them off.\" I originally laughed it off but I've been thinking about it ever since. There's no question the seller under-listed the album; only selling for $150 when they could have asked for at least triple that amount. On one hand, the onus is on them to do their due diligence and make sure they know how much their item can sell for, but on the other, I feel like I inadvertently ripped off somebody who didn't know what they had. \n\nI suppose I could have sent them a message telling them about the value of the album, but they might have even already known the value and just wanted to make a quick sale. \n\nI've been wrestling with the question for a couple of days so now I leave my judgement up to the anuses of Reddit - AITA?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6sy6y/aita_for_potentially_ripping_off_an_ebay_seller/","permalink":"/r/AmItheAsshole/comments/1p6sy6y/aita_for_potentially_ripping_off_an_ebay_seller/","score":0,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764115669.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6r61w","name":"t3_1p6r61w","subreddit":"AmItheAsshole","author":"the_lirio","title":"AITA for telling my mom I preferred she left the bar we were in?","selftext":"So, yesterday I (25NB) had a dance presentation. My mom (52F) traveled from other state to see a friend on Friday, so I convinced her to stay a few more days to watch my presentation. We met Friday, Saturday and Sunday. \nMonday comes and I present at night, my girlfriend, my best friend and his boyfriend also came to watch me and I invited them to get some drinks with me and the other dancers. My mom invited herself, even though it meant she wouldn't have a place to sleep. She would crash at my aunt's place, but she's pretty strict with the time my mom would come home. Also, mom has close to no money on her.\nWe walked to the bar in the rain, since none of us had a car and it was a pretty small distance. It's Monday, so everyone is pretty tired from work and we're not talking much, except for mom, which I guess made her feel unwelcome.\nWhen we arrive, she tells me something along the lines of \"look, I promise I won't be mad, but if my presence is not that important to you, you can tell me. Because you know I'm creating a problem to myself just to be here\". I don't want her being unable to find a place to sleep, so I reply that, if this is the case, I think it's best for her to go home. She gets very mad.\nShe goes to a table far from us to charge her phone (my girlfriend offered to call her an Uber but she refused) and barely said goodbye when she left. Later, I received a message saying I could have told her that earlier, as well as that she stayed longer just to see me and was very upset that her presence was unwanted by me.\nI think I might be an asshole because I didn't thought of telling her to go home before we got to the bar all wet from the rain. My friend and girlfriend are saying I wasn't in the wrong, but I rather have some unbiased opinions too.\nSo, Reddit, AITA for telling my mom it was best if she left?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6r61w/aita_for_telling_my_mom_i_preferred_she_left_the/","permalink":"/r/AmItheAsshole/comments/1p6r61w/aita_for_telling_my_mom_i_preferred_she_left_the/","score":0,"num_comments":15,"over_18":false,"stickied":false,"created_utc":1764111069.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6owv8","name":"t3_1p6owv8","subreddit":"AmItheAsshole","author":"Smart-Response9881","title":"AITA For parking in the handicap spot of a closed parking lot.","selftext":"I was working for my city's Parks department and I was closing one of our parks for the night. We gated off the entrance to the parking lot as we pulled in, and I parked in the nearest spot to the building we needed to clean, since we would have to haul all the trash into the back of the truck.  That spot was a handicap spot, and the person who I was riding with got mad at me, saying that you can never park in a handicap parking spot unless you have the decal. I argued that the parking lot was closed and no one could park there anyway until tomorrow. They countered, saying if there was an emergency and we had to leave the truck there over night for some reason, then it would still be there to block the spot for the morning. I countered that by saying that parking in a handicap space during an emergency would be acceptable, but they disagreed. What does reddit think, AITA? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6owv8/aita_for_parking_in_the_handicap_spot_of_a_closed/","permalink":"/r/AmItheAsshole/comments/1p6owv8/aita_for_parking_in_the_handicap_spot_of_a_closed/","score":0,"num_comments":47,"over_18":false,"stickied":false,"created_utc":1764105687.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6r8oa","name":"t3_1p6r8oa","subreddit":"AmItheAsshole","author":"barca_vibes","title":"WIBTA IF I DONT WANT TO PAY MY FRIEND FOR A DRIVING TICKET","selftext":"Hi everyone. So on the weekend we were going to another city to go out with my friends. My friend H was driving back. Me and my friend P needed a ride back. H said she wasn’t sure as she already had 4 people in her 5 seater car so we said that if she got a ticket for having too many people in the car we would pay it. Before we started our ride back H wanted to drive 5 mins from where she had parked but as soon as we left the car park there were police standing outside and stopped us. H wasn’t wearing her seatbelts so they gave her a ticket saying it’s for not wearing a seatbelt plus she had too many people in the car. I don’t think it’s fair for me to have to pay the whole thing now given that part (or whole) of the ticket was bc she wasn’t wearing her seatbelt. Thank you and would appreciate any constructive criticism. \nWIBTAH if I say it’s not fair for me to have to pay the whole thing? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6r8oa/wibta_if_i_dont_want_to_pay_my_friend_for_a/","permalink":"/r/AmItheAsshole/comments/1p6r8oa/wibta_if_i_dont_want_to_pay_my_friend_for_a/","score":0,"num_comments":49,"over_18":false,"stickied":false,"created_utc":1764111255.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6gfad","name":"t3_1p6gfad","subreddit":"AmItheAsshole","author":"Comfortable_Tree5383","title":"AITA for bring resentful towards my mom?","selftext":"Ok so in August my mom found proof of my dad chæting on her. She always suspected him. But now she found pictures and chat and stuff. (I found the proof in her phone but she doesn't know that I know). \nHe isn't the best husband and I won't say he was the best father. I'll just say that he tried very hard but just when I let down my guard he would have an \"episode\" where he would get soooo angry. He'll either fight us or my mother (never hit us just verbal abuse and threats). It's so bad that we get anxious every time his mood would be off or his voice would get loud. \nAlso a very nightmarish husband. Like constantly call her when she is outside, bad mouthing her side of the family, very picky about the food, awful inlaws too.\n So now my sister will get married in December. She literally just told me that she's just waiting for the event to happen and then she'll have a big fight with him and leave. \nI'm not saying that she shouldn't leave him. I WANT HER TO LEAVE. But it feels like she just wants to get my sister settled and then she doesn't care about what happens to us. (I have a younger brother too). \nI know this is tough on her but am I a terrible person for feeling resentful? Like she doesn't care about what would happen to us. (I am afraid that he might sh00t us if she leaves) \nShe told me that she would come live with me after I get a job but I always thought that she would wait for me to finish my education and then we'll run away together (It's just 3yrs until I can complete my education). I didn't think that she was planning to leave me behind.\nSo I don't even know what to do or feel. My older sister doesn't know about anything and I don't know I'd I should tell her or not.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6gfad/aita_for_bring_resentful_towards_my_mom/","permalink":"/r/AmItheAsshole/comments/1p6gfad/aita_for_bring_resentful_towards_my_mom/","score":0,"num_comments":29,"over_18":false,"stickied":false,"created_utc":1764086909.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67rxg","name":"t3_1p67rxg","subreddit":"AmItheAsshole","author":"RecentRelationship96","title":"AITA if I don’t spend my birthday with my bestfriend","selftext":"Me[29 female] Best Friend [26 male] I live with my best friend. We’ve been friends for almost 2 years now. We spend every day together. On his birthday, I surprised him with the whole trendy morning birthday surprise. I set up balloons, a cake, a card and a gift in an esthetic way for him to wake up to. I surprised him with a day trip up north to go do a few hikes he’s said he’s wanted to do. I paid for everything and even drove. Fed him all day and blew out candles with him at the end of the night. He didn’t ask me to do any of it. He would’ve been fine without it, but he did express how grateful he was and that it was his favorite birthday. Well….My birthday is in 5 days. I know he hasn’t bought any presents yet. He doesn’t plan ahead. Any time we go out to eat or hangout I’m constantly picking where we go bc he wants me to. Even when I tell him it’s his big day and he should decide, he will still have me pick. He will typically pay, but I always try to pay for myself. Occasionally, he’ll let me pay. He says it’s embarrassing if I’m the one to pay when he is the male. Kinda weird about that. It’s caused some fights, so I just let him now. He also has a lot of food restrictions, so it makes it hard on me to have to pick. I also hate to always be the one to plan every single thing we do. I’m afraid when my birthday comes I will wake up to nothing. I will still have to pick everything we do and he won’t get me a cake. Am I an AH for expecting him to do any of this without asking him specifically to? I’ve told him in the past what I expect and hint at things I would want as a gift. He’s asked me for a birthday present list, but I want him to put some effort into it. I would like him to try to remember what I’ve said I’ve needed/wanted. I feel like it takes the fun out of being surprised if I just ask for exactly what I want and I get exactly what I want. Maybe I’m the weird one about that. I bought myself my own birthday present which was a new pair of sneakers. I showed them to him and told him they were my birthday present to myself… he kinda “acted” like “ahh man huh okay” as IF he got me the same pair or something similar. I know he didn’t though. He’s a very good actor and it felt a little more like he forgot my birthday was this week and was trying to cover up with him “possibly” having got the same/similar thing for me. I’m afraid none of it will happen and I will be very sad on my birthday. I have other great friends who want to take me out and would I be the even bigger AH if he doesn’t plan or get me anything to just not do anything with him then and just go out with my friends who did plan something for me?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p67rxg/aita_if_i_dont_spend_my_birthday_with_my/","permalink":"/r/AmItheAsshole/comments/1p67rxg/aita_if_i_dont_spend_my_birthday_with_my/","score":1,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764061450.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p647a7","name":"t3_1p647a7","subreddit":"AmItheAsshole","author":"theredxpanda","title":"AITA for not telling my friend about a trip?","selftext":"To set the scene: I’m apart of a trio (all female, 26 yrs old). We have been best friends for over 10 years. We have gone through thick & thin & a lot of personal life changes. We know basically everything about each other.\n\nAs of the past year or so, two of us (including myself) have been feeling a bit off with our third friend. She has always been sort of the “salty” or passive aggressive one, but we put up with her & still love her dearly. Us two moved about an hour away from our third friend (in our own individual apartments). So we go a while without seeing each other. We’re always the only two making the effort to make plans to hang out. Our third friend never seems to make the same effort. She spends almost 100% of her free time with her boyfriend. She never plans activities with us. She’ll bring something up, but that’ll be the end of it & never initiates to actually put it to action. We’re always driving to her, as she refuses to drive to us because her car “isn’t reliable” (yet she drives 40 mins each way to work). She won’t get on a plane, or a bus, or a train, or even a boat. However, she’ll do activities we want to do with her boyfriend or plan trips with him. We’ve always wanted to do a girls trip but never got to.\n\nRegardless, we take her into consideration and usually always drive down to her. Recently, us two were invited by a high school friend (whom we all know, but only us two are close to) to come visit them in another state. So us two went & had a lil getaway for a weekend. One of us posted it on social media. Ever since then, our third friend has been ignoring us. Ghosting even. Hasn’t answered our texts, leaving us on read. Until today one of us called her repeatedly to force her hand.\n\nShe finally cracked that she felt a way when she saw our social media posts & wasn’t sure how to go about it. And that made us even more annoyed & frustrated than we were already with her. She’s always planning trips or doing something with her boyfriend without ever telling us & she “felt a way” about this? About a trip that she wasn’t invited to because she doesn’t know the other friend as well as we do? Why would we even mention it to her when she wasn’t apart of any of the planning, and she wasn’t even invited either?\n\nShe ended up going off on us & being extremely childish about the whole situation, saying we coordinated a whole long trip together without saying anything. I can’t even tell you how she felt because she didn’t answer that when we asked. I’m not sure she even knows how she herself feels about this because it’s really all just immature. I’m sure there’s some FOMO but she could have just said she wants to do something like that too? But once again, she never has made the effort to.\n\nAITA for not telling her about this short trip?\n\nEdit: To add context, there wasn’t anything “hush hush” about this trip either. We weren’t purposely excluding her or being secretive. The other friend simply didn’t really know her well & hadn’t spoken since high school. It honestly never occurred to us to even say anything because she never was part of it.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p647a7/aita_for_not_telling_my_friend_about_a_trip/","permalink":"/r/AmItheAsshole/comments/1p647a7/aita_for_not_telling_my_friend_about_a_trip/","score":0,"num_comments":16,"over_18":false,"stickied":false,"created_utc":1764048186.0,"edited":1764049078.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mk3x","name":"t3_1p6mk3x","subreddit":"AmItheAsshole","author":"minionamonguspiss","title":"WIBTA if I don't spend Christmas with my family?","selftext":"Hey all! My (19F) girlfriend and my parents are dramatically opposed on their stances on this so I need a fully non-biased moral opinion on whether I would be an awful family member if I did this.\n\nFor some very brief context, my grandmother has dementia and has been on a steady decline for the past seven-ish years. Every Christmas my whole family leaves the city and goes to spend Christmas with my grandmother and the rest of my extended family around 5 hours away. For the past several years, it has been made imperative that I am there at Christmas because \"this is probably her last one\".\n\nSpending Christmas with my family absolutely wrecks my mental health every year. My parents are both on such high guard around what I say, what I wear, do, drink, everything. Every word that leaves my mouth has to be very carefully curated and filtered to ensure I am giving the best possible impression to our extended family.\n\nI have spent Christmas with my family for as long as I can remember, and I genuinely do not remember having a Christmas I genuinely enjoyed in the way it seems I'm supposed to.\n\nMy girlfriend and I have been together for two years and this will be our third Christmas spent together. We have several commitments with friends and her family for Christmas that would either have to be postponed or cancelled due to my absence. She has expressed to me that it feels unfair that she is forced to either spend Christmas on the other side of the country to me or experience the same intense anxiety and discomfort that I do in order to spend Christmas with me. We live together and are trying to build a life and network in our home city. She thinks it's unfair that every year I am guilted into a week of misery because my family is holding my grandmother's health above my head, but if this *did* happen to be her last Christmas neither me or my parents would ever forgive me.\n  \nEvery time I have tried to express that I want to stay home with my partner, there are paragraphs upon paragraphs from my parents on how selfish I'm being, but I can't help but feel that I've spent every single Christmas being selfless and the idea of not having a Christmas that actually feels like a holiday until my thirties honestly just makes me feel really sad and defeated.\n\nBoth my girlfriend and parents are opposed to the idea of me spending Christmas apart from them. I know *legally* they can't force me but morally, would I be a selfish asshole if I chose to stay? I spend the months leading up to Christmas every year in absolute dread and it's definitely been more intense the past two years because I have another set of people expecting me to send Christmas with them. Would offering to do one year on/one year off be acceptable? Everyone in my life is intensely and angrily fighting for a different side of this issue and I feel so overwhelmed by this decision that, no matter what I pick, will disappoint somebody?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6mk3x/wibta_if_i_dont_spend_christmas_with_my_family/","permalink":"/r/AmItheAsshole/comments/1p6mk3x/wibta_if_i_dont_spend_christmas_with_my_family/","score":0,"num_comments":38,"over_18":false,"stickied":false,"created_utc":1764100359.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6j7v1","name":"t3_1p6j7v1","subreddit":"AmItheAsshole","author":"TriangulatedOne","title":"AITA?? Domestic responsibilities, and domestics.  About that Laundry....","selftext":"Ever since I left the loving care of my mother (many years ago) I always used a laundry service.   \n  \nI recognize the importance of laundry, and value clean clothes, sheets, towels, etc..  BUT, it's not what I do.  DOING laundry is not an emotional priority for me.  That is exactly why I have always had a service. For more than twenty years as a single adult man. Even after I married, I  always made sure a housekeeper who did the laundry.   \n  \nNow, we are retired. My wife wanted to save a little money so she let the housekeeper go.  She does the laundry. It is an emotional priority for her. Except when she has something else she wants to do. When that happens she delegates laundry to me.  I have other things to do. Really, I know how to solve the laundry problem. I get nagged, scolded at for being neglectful, but that's just more of a disincentive and negative. I just don't get around to laundry. I'd rather work, play, cook, do other domestic stuff.  Or enjoy my quiet time.    \n  \nReally, I \\*always\\*, before, and so far during marriage knew how to deal with the laundry, and my method \\*always\\* got it done. She let the housekeeper go, not me. Housekeeper's responsibility included laundry.  I \\*do\\* do other things, have even trained housekeepers to press a starched shirt, press pair of pants with a nice sharp crease.  It's not that I can't do laundry it's just not on the list of things I'm likely to do on a day to day basis.  AITA?? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6j7v1/aita_domestic_responsibilities_and_domestics/","permalink":"/r/AmItheAsshole/comments/1p6j7v1/aita_domestic_responsibilities_and_domestics/","score":0,"num_comments":68,"over_18":false,"stickied":false,"created_utc":1764093079.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ob1c","name":"t3_1p6ob1c","subreddit":"AmItheAsshole","author":"ThenContribution6531","title":"AITA; An opinion I have was shared with someone it shouldn't have been","selftext":"Sorry in advance if this is messy. No names or ages and trusted friend has already been cut off for causing drama.\nSo I have shared a personal opinion with a trusted friend in regards to how I feel about the way a child is being treated in my family. Not abusive, just a bit harsh of a parenting style and seemingly using family members that are close to the child as forms of punishments such as: Oh, so and so is coming over, since you're grounded you have to go to your room and not get to see them. Oh, so and so made plans to take you and your sibling out but we are grounding you, so you can't go but sibling can (Not saying the sibling is less loved or time is less enjoyed with them). Don't get me wrong, I understand the fundamentals of being grounded and consequences but literally cutting the child off from supportive family members that would definitely have the parents back when it comes to enforcing the lessons they are trying to teach just feels counter productive and too harsh and like punishing the family member too.\nSo that's the opinion I shared with the trusted friend and mentioned that it makes me not want to visit more because I don't want to voice that opinion to the parents because I'm well aware that I don't know everything pertaining the situations and issues involving the child and I don't have kids of my own so I don't know that I'd do different or if I would even have a better solution to offer if they ever asked for advice or I encountered the same challenges with my own future kids.\nThe friend let it slip to the child on an outing when they asked why I'm not around as much and although it is technically the truth, the way it was put made it sound like I don't like the parents or how they treat their kids and that's why I don't go over. \nI've recently been trying to get closer to that part of the family because I don't dislike them and I feel I have a better understanding of things and can therefore not get upset about their tactics with their kids.\nThe reaction they had to hearing this from their kid who repeated it to them, was to call the person who told the child so as to verify (child tells lies often). Friend verifies and said to reach out to me to talk about things because it was something they shouldn't have said and so it's not my fault that's it's caused an issue in their family. They refused and said I should be the one who reaches out because I should have said something during all the times I had been recently talking with them. However I wouldn't even know there's an issue if the friend hadn't told me this was happening. \nSo am I the A-hole for not sharing this opinion with the parents and telling my friend instead? And should I reach out first or wait for them to contact me? If I do reach out, any advice on how to word things? I should add, dealing with the issues surrounding the child have been very hard and now they've been undermined by that opinion being shared with the child. (At least that's how I'd feel). ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6ob1c/aita_an_opinion_i_have_was_shared_with_someone_it/","permalink":"/r/AmItheAsshole/comments/1p6ob1c/aita_an_opinion_i_have_was_shared_with_someone_it/","score":0,"num_comments":25,"over_18":false,"stickied":false,"created_utc":1764104321.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zm8e","name":"t3_1p5zm8e","subreddit":"AmItheAsshole","author":"JACCDH","title":"AITA for remembering the boobs first from my brother's game?","selftext":"For context, my brother (24M) has been invested in the video game series of Hyperdimension Neptunia since late high school/early college. As far as I understand, the series is about this group of anime girl goddesses that rule over different parts of a world called \"Gamindustri.\" It's a huge parady from the console wars of the late 2000s/early 2010s specifically.\nI (22M) wrote it off, as most of the time I watching him play the games, they seemed to be the same, but the spin-offs with different game styles are pretty cool. One spin off game in particular came up in conversation recently, where the goddesses are ninjas, and play in a action/hack & slash gameplay, as opposed to classic JRPG gameplay. I did watch him play the game a couple years ago, though I don't recall much of the game, aside for the jiggle physics. When the characters moved, they moved even faster, and the characters might've been a bit more serious than the main games.\nWhen it came up tonight, I didn't remmeber what it was called, but I remembered the jiggle physics. He didn't like that that was the first thing I thought of, and hasn't talked to me since. \nWe're both autistic, so it could be a hyperfixation of his, or I might be a perv, but he generally doesn't like when I point out or joke about anything about anything he likes, even if I'm a fan as well.\n\nTL;DR AITA for remembering the boobs first from his game? ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p5zm8e/aita_for_remembering_the_boobs_first_from_my/","permalink":"/r/AmItheAsshole/comments/1p5zm8e/aita_for_remembering_the_boobs_first_from_my/","score":0,"num_comments":13,"over_18":true,"stickied":false,"created_utc":1764034498.0,"edited":0.0,"link_flair_text":"Not the A-hole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ll97","name":"t3_1p6ll97","subreddit":"AmItheAsshole","author":"Pretend-League-6834","title":"AITA for throwing a loud Friday night party when my roommate wanted to sleep at 8pm despite giving 36 hours notice","selftext":"Last Friday I threw a party at my dorm which lasted from approximately 7:30pm-12:30am. I planned this party for about 4 days and gave out notices to my 3 other roommates \\~36 hours in advance (Thursday morning). My other 2 roommates were chill with it, and the 3rd roommate (Anthony and the subject of this post) was ok with it. In fact, he definitely knew I was throwing this party as he asked me to ask my friend to buy alcohol for him.\n\n**Some additional background information:**\n\nAnthony for the past week was sleep deprived, but by choice. Before Friday, he pulled 1 all-nighter, and stayed up until 2am repeated for \\~3 nights. Even though he stayed up super late, he had absolutely no reason to -- no tests, no exams, no upcoming assignments. He just wanted to watch some Netflix late at night I suppose. On Thursday morning when I gave everyone the notice, he definitely had a choice to make knowing he slept at 3am that morning. Even knowing this, he still chose to stay up very late on Thursday. \n\nFriday afternoon (5 hours before party) Anthony told me that he was going to take melatonin and sleep at 8pm, telling us to keep quiet. I explained that I couldn't exactly do that, since I had a party planned. \n\n**Why was I inconsiderate?**\n\nOn top of just not wanting to deal with Anthony's last minute BS, there were other reasons:\n\n\\- didn't clean his stinky fridge for 5 days\n\n\\- sometimes doesn't flush the toilet\n\n\\- spends an unreasonable amount of time in the toilet (over 45 min in some cases, everyday)\n\n\\- tells everyone to keep quiet at super early times bc he wants to sleep, then scrolls in bed past 12am\n\n\\- stole my alc\n\n\\- took 2 months to pay me back for alc\n\n\\- used my PC without asking\n\n\\- does everything in his power not to clean up his OWN HAIR in the washroom\n\n\\- wanted me to stop drinking milk bc he was convinced I was causing our rooms to stink up (it was his fridge)\n\n\\- never closes the front door\n\n**The party:**\n\nIt was loud, and we left my room's door open since it was 8 people crammed in a fairly small space so it got very steamy. Since people were drunk and we were playing cards, it was loud. At 9:30pm, he spam calls me 3x and tells me to keep the noise down. I reply \"I'll see what I can do\" but told my friend in another language \"the show must go on\". The party goes until 11:30pm where he calls me again, and threatened to complain to the dorm admin about my noise levels. After that I decided to tell everyone to quiet since my hand was forced.\n\n**Next day and he's pissed**\n\nNext morning Anthony tells me \"we need to have a chat when you're free\". I didn't feel like doing it because there was nothing to chat about, so I stalled for the next 2 days. He told my other 2 roommates (who are chill with me and secretly don't like him) that he's been pissed at me since Friday. \n\nIf Anthony really wanted to talk this badly, then he'd take the initiative instead of waiting for me -- because there is NOTHING to discuss about.","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6ll97/aita_for_throwing_a_loud_friday_night_party_when/","permalink":"/r/AmItheAsshole/comments/1p6ll97/aita_for_throwing_a_loud_friday_night_party_when/","score":0,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764098214.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jrbk","name":"t3_1p6jrbk","subreddit":"AmItheAsshole","author":"Lifeschilled","title":"AITA for taking my child’s grandmother to court?","selftext":"\nI (22F) had a kid (3 male) with a guy that I knew back in high school. Now I wasn’t one to have a kid, but once I saw him I knew I wanted to be a mom. \n    The pregnancy wasn’t the best, the relationship between me and the dad got turbulent. Once I had my kid CFS took him from me with the clause of me being too emotional. \n    I had spent over a year after, working to get him back from CFS, once we did baby dad and myself decided to try again for the sake of the child, everything was going okay with the father and I before the landlord  had kicked us out of the apartment because she didn’t like baby dad, resulting to him and I being homeless in a motorhome. \n     Prior to this happening CFS, dad, both grandmas (His mom (let’s call her S) ( and my mother) had a meeting in which the grandmas were to gain guardianship temporarily until dad and I got back on our feet. \n    That didn’t happen. Instead  S went ahead and got the guardianship with her and her boyfriend, and didn’t serve me to go to court, so it got granted and ran with it.\n     Fast forward a year later, I left my child’s father, and started to get my life back on track, I found the papers that had were supposed to be served to me but never did, so went to court and took the next steps to change everything, and to reunite with my son. S has been keeping him like her own son, doesn’t talk to me about school or medical issues. She believes I am the same person I was when I was pregnant, emotional and crazy. She isn’t willing to work with me, so I can be reunited with my kiddo. \n\nAm I the asshole for taking her to court over it?\n\n\n(Edit 1: I’ll get into more detail about everything after our meeting tomorrow morning, and not on my phone so it can be formatted better. Any questions feel free to put out there and I can answer them/ fill in more details as this situation has been “unique” and not a “cookie cutter” situation as I have been told by both the courts, CFS and the multiple services I have reach out to around my area.) ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6jrbk/aita_for_taking_my_childs_grandmother_to_court/","permalink":"/r/AmItheAsshole/comments/1p6jrbk/aita_for_taking_my_childs_grandmother_to_court/","score":0,"num_comments":62,"over_18":false,"stickied":false,"created_utc":1764094246.0,"edited":1764095484.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6k6js","name":"t3_1p6k6js","subreddit":"AmItheAsshole","author":"True_Bluejay_9684","title":"AITA for my reaction to my brother's pregnancy","selftext":"AITA for being upset with my brother about getting pregnant with his girlfriend? For context, my fiancè of 12 years and I have been preparing for IVF for months and were planning to start IVF and get married in spring/summer 2026. My brother has been with his girlfriend for a matter of weeks and she is now 7 weeks pregnant, due in the summer. My Mum told me the news and all I have heard from my brother since then is asking my fiancè directly for our cooker we have in the garage as theirs broke which I was wanting to save incase our next rental doesn't have one like our last but my fiancè gave the impression we were getting rid of it to clear the garage so my brother wants it for free. Due to this, there was some confusion and confilct in which my brother fairly enough wanted clarity on whether they could have the cooker or not but also told me he is upset I didn't contact him to congratulate him on the pregnancy to which I told him I am hurting because of the timing of their news hitting me in a raw place but he doesn't think them having a baby first is a reason to be upset with him for having a child. I just don't know if my reaction to their news is justified or if I am being an asshole for not congrarulating them. So what do you think? AITA? TIA. ","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6k6js/aita_for_my_reaction_to_my_brothers_pregnancy/","permalink":"/r/AmItheAsshole/comments/1p6k6js/aita_for_my_reaction_to_my_brothers_pregnancy/","score":0,"num_comments":96,"over_18":false,"stickied":false,"created_utc":1764095146.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rbie","name":"t3_1p6rbie","subreddit":"AmItheAsshole","author":"Emotional-Trick-2252","title":"AITA for using AI to write a college assignment?","selftext":"Hey there! I (22F) am a second-year student currently for what many would consider a 'fake degree' (Religious studies and the like.. (I love my degree dw)). There is one class where the professor is extremely difficult.\n\nThis professor said at the beginning of the course that instead of an exam at the end, he will assign a 500-word essay every week based on the reading. The assignments have 5 days to be done and the reading is LONG (I also work almost full time and take 7 other classes). He also said multiple times that we cannot use AI for our assignments. Here's the doozy, me (and my friends in the insta poll I just did on my private story) agreed that this means do not use AI to write any version of the essay, even bullet point form.\n\nI made the mistake of using AI to summarise the 45-page essay he gave us so that I can read it better in order to write only about what's relevant. I then made the far stupider mistake of writing one of the quotes ChatGPT presented to me as factually included in the article. I looked in the article for the words used in the quote, as it felt too good to be true and I found it. Turns out AI can somehow mess with PDFs, putting quotes between pages (if someone can explain that would be great). \n\nHe found this quote in my essay and then promptly did the following - kicked me off the course and failed me for the whole semester. I feel like it's a complete misunderstanding of his rules. He explained it to be that I've been actively trying to gaslight to him.\n\nAITA for using AI for summaries if he said don't use AI? Do you guys think I deserve a second chance?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p6rbie/aita_for_using_ai_to_write_a_college_assignment/","permalink":"/r/AmItheAsshole/comments/1p6rbie/aita_for_using_ai_to_write_a_college_assignment/","score":0,"num_comments":63,"over_18":false,"stickied":false,"created_utc":1764111450.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63mxz","name":"t3_1p63mxz","subreddit":"AmItheAsshole","author":"RoundCatLoaf","title":"AITA for being angry that my husband blew the candle out in the living room?","selftext":"I have a scented candle in the living room and when I blow it out I usually muffle it with a cover, and take it outside to let the smoke/soot air out before I take it back inside.\n\nI know the smoke/soot is toxic so taking it outside to blow it out is an easy step to enjoy a (also toxic) scented candle, while still being more proactive about what I’m breathing. It makes me feel better about it at least.\n\nI asked my husband to muffle it and take it outside to air it out. He kept asking “why?” And I explain the above. He hesitates and questions my request over and over. Eventually he opens the muffled candle container so the smoke/soot escapes into the room.\n\nI’m freaking out now and angry at him because I specifically asked him to do it outside. He still claims “I’m not going to take a candle outside to blow it out.” It feels like he deliberately chose not to care about my feelings or concerns. AITA for overreacting and getting really angry at him?","url":"https://www.reddit.com/r/AmItheAsshole/comments/1p63mxz/aita_for_being_angry_that_my_husband_blew_the/","permalink":"/r/AmItheAsshole/comments/1p63mxz/aita_for_being_angry_that_my_husband_blew_the/","score":0,"num_comments":63,"over_18":false,"stickied":false,"created_utc":1764046370.0,"edited":0.0,"link_flair_text":"Asshole","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
