{"id":"1p5zuyz","name":"t3_1p5zuyz","subreddit":"badroommates","author":"def_not_mrbrightside","title":"Roommate took the knobs/grill out of the barbecue","selftext":"I live with 6 people! I have lived in this house for 3 years with roommates that come and go. This grill has been here since I moved in and is considered a communal grill. There’s one roommate, B, that uses the grill fairly often and initially cleaned it last year when it was pretty gross. I have never used it but decided to use it to make chicken with one of my other roommates  a few days ago. We bought our own propane, (94$ worth) and I let B know that we were moving his propane so we could use the bbq (that we weren’t using his propane pretty much) he messaged back normally and we made some delicious jerk chicken. Today I come home to find out from a completely uninvolved roommate that B was so upset that we used the grill, that he took all the knobs off and the actual grill part and took it to his GFs place. He apparently thinks that because he cleaned the grill once last year, that he now owns it or something? The grill was pretty dirty before we used it, like we had to scrape stuff off, so it wasn’t that we made it super gross or anything. I’m unsure why he’s so angry that we used the grill tbh. Overall pretty pissed off considering he didn’t talk to me about it and ITS NOT HIS GRILL. I also bought a bunch of propane that I’m now unable to use, which is great.","url":"https://i.redd.it/67m62zb96b3g1.jpeg","permalink":"/r/badroommates/comments/1p5zuyz/roommate_took_the_knobsgrill_out_of_the_barbecue/","score":376,"num_comments":197,"over_18":false,"stickied":false,"created_utc":1764035175.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62nle","name":"t3_1p62nle","subreddit":"badroommates","author":"bobthe2ndbuilder","title":"Roommate stole weed from other Roommate","selftext":"One of my roommates stole half on ounce of weed from another one of my roommates that was out of province. When we found out he said \"I can't necessarily control my impulses\".... \n\nDuring the week when he was doing that he dropped a nug on the floor and left it by our cats food bowl. Weed is toxic to cats.\n\nThis is just one of the many things this childish man had done, I have so much more😭😭😭\n\nSorry if this is very poorly worded. I am beyond angry.","url":"https://i.redd.it/czn8euq9ub3g1.png","permalink":"/r/badroommates/comments/1p62nle/roommate_stole_weed_from_other_roommate/","score":135,"num_comments":55,"over_18":false,"stickied":false,"created_utc":1764043251.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lio4","name":"t3_1p6lio4","subreddit":"badroommates","author":"Feeling-Extreme-7555","title":"My roommate is the dirtiest man I have ever met","selftext":"I asked him to move out because he is so dirty. He doesn’t clean and leaves his trash all over the place and I’ve lived with him for 2 years and I cannot put up with him anymore. I found a bug infestation in his designated kitchen cabinet the other day and was appalled.\n\nFor context he uses that cabinet for his daily cooking and always sees it and is either blind to the bugs or doesn’t care. This caused me to reach out to our landlord for pest control and to ask he does not renew his lease. \n\nCuriosity got the better of me and I went to check out the state of his room and took these pics. I can’t believe it.\n\nThe most disgusting man ever. It’s my life mission to get rid of this man. \n\nPray for me. Also yeah not cool I went in there but Look at this shit. He’s 50 years old, and I’ve been cleaning up after him for years now and asking him to pitch in and he never does.","url":"https://www.reddit.com/gallery/1p6lio4","permalink":"/r/badroommates/comments/1p6lio4/my_roommate_is_the_dirtiest_man_i_have_ever_met/","score":35,"num_comments":33,"over_18":true,"stickied":false,"created_utc":1764098054.0,"edited":0.0,"link_flair_text":"WARNING - Gross","is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p651vi","name":"t3_1p651vi","subreddit":"badroommates","author":"Odd_Definition6929","title":"Roommates girlfriend over took cabinet","selftext":"She isn’t even supposed to live here…","url":"https://i.redd.it/ee4bibqphc3g1.jpeg","permalink":"/r/badroommates/comments/1p651vi/roommates_girlfriend_over_took_cabinet/","score":27,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764051134.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6obyf","name":"t3_1p6obyf","subreddit":"badroommates","author":"LilacDream98","title":"My psycho housemate threatened me for moving a dirty pan","selftext":"I’ve (29F) been living in a house share for 3 years with 3 other young professionals (one guy, two girls, all late 20s / early 30s). We all moved in at different points and didn’t know each other prior, and we have separate tenancy agreements (UK).\n\nOne of my housemates, let’s call her Amy (28F) who moved in 3 years before me (and the longest tenant) is possibly the worst person I have ever met in my life. And it’s been nothing but problems since the start.\n\n1. She’s a hoarder and treats the house like she owns it, leaving dirty plates, leftover food, dirty laundry and her other junk throughout the common areas. She uses having the smallest bedroom as the justification for this (which is BS). And this has created a culture in the house where no one wants to spend time in the common areas and goes straight up to their rooms, because of all her shit.\n\n2. Whenever she’s in a relationship, her boyfriend moves in without notice. With her last bf, they were mutually toxic and we had to listen to them argue, and a situation of him getting drunk and trying to break down the door led to the police being called. She has new boyfriend now and it’s the same thing over and over.\n\n3. She is immune to any form of accountability or criticism. We have raised issues with her multiple times over the years, including how often her boyfriend is over, and every time she gets defensive and hostile and nothing ever changes. It’s now at the point where we can’t say much anymore bc if we do, she will retaliate. One example of this is leaving a used pad in the shared bathroom (I have an ensuite) and trying to gaslight me and my other female housemate that it was ours. Truly insane behaviour. \n\nMy other two housemates are sound and also cannot stand her or her behaviour. So we’ve had a separate group chat for the past two years mostly to have a space to vent about her. Because she loves to kick off for no reason and play the victim.\n\nBy this summer, we’d had enough and collected evidence and decided to report her to the agent for breaking the clause around other people living in the property. Sadly, despite the proof we have, they aren’t willing to push it up to the landlord at this point. He could easily jack up her rent and get her to leave that way. We’re still fighting it, but it’s in the landlord’s interest to enforce the tenancy agreement. Our other option is for all 3 of us to threaten to move out, so they act, but the others aren’t as keen on this, which is their right.\n\nThe agent sent round an email to everyone reiterating house rules after we reported her. And Amy then realised what we had done and since then, she’s giving us the silent treatment, but when she does talk to us, it’s with extreme hostility. We also tried to organise a house meeting before we sent this report but she refused to attend.\n\nThis has come to a head now because the other day, I was cooking in the kitchen and moved one of her dirty pans off the hob (which she always leaves for days) to use it. She comes down and starts yelling at me not to touch her stuff. When I try to calmly reason with her, she starts getting in my face and threatening me. After that, I stopped talking to her and went upstairs and cried. She’s been the worst for years and I’m good at standing up for myself. But this crossed the line because now I feel unsafe in my own house.\n\nI raised this with the other housemates and she’s telling him privately that I’m exaggerating (of course they believe me), which is typical behaviour from her. But I know what happened and I genuinely thought she was about to hit me.\n\nShe is a truly irredeemable person and now I don’t think I can take it anymore. The reason I haven’t moved yet is I love the area, have a really big ensuite room for the price, and my rent hasn’t gone up for years. I don’t want to let her “win” but I feel like my safety is at risk at this point.\n\nWhat’s even more mad is she’s a NURSE. If she’s like this at home, imagine what she’s doing to her patients 💀 \n\nAnyway, I’ve started to look at other places but any ideas for petty revenge that don’t affect the other housemates (bc they’re sound and on my side) would be great!","url":"https://www.reddit.com/r/badroommates/comments/1p6obyf/my_psycho_housemate_threatened_me_for_moving_a/","permalink":"/r/badroommates/comments/1p6obyf/my_psycho_housemate_threatened_me_for_moving_a/","score":24,"num_comments":21,"over_18":false,"stickied":false,"created_utc":1764104376.0,"edited":1764105466.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67uxf","name":"t3_1p67uxf","subreddit":"badroommates","author":"No-Particular2886","title":"My ex-best friend/roommates is getting married Saturday, and I’m not going… because that friendship nearly broke me.","selftext":"I (26F) cut off two girls who used to be my closest friends and roommates during my foundation year. On the outside we looked like a normal trio, laughing, studying, doing everything together. But behind closed doors, the friendship was honestly draining me to the point I didn’t even recognise myself anymore.\n\nThese girls were the type who made everything a competition. If I looked good, they had something to say. If I bought something new, they wanted to know how much it cost. When I went back to my hometown, they would literally go through my things while I wasn’t around..digging through my makeup, my skincare, my clothes. Not to steal… but to inspect. To see whether mine was more expensive than theirs. To check what brand I was using. To silently judge.\n\n2.5 years of this.\n2.5 years of feeling like I wasn’t allowed to shine too brightly or be too happy around them.\n2.5 years of walking on eggshells in my own shared space.\n\nEventually, I snapped. I distanced myself, and the peace I felt was unreal. I finally had room to breathe without comparing, apologising, or shrinking myself to make them comfortable.\n\nThen out of nowhere, one of them messaged me on Instagram to invite me to her wedding this Saturday. And the moment I saw her name, I felt that old heaviness in my chest. That same suffocating energy I worked so hard to escape.\nI don’t look like how I used to back then, and honestly, I don’t owe anyone an appearance or an explanation. I’ve rebuilt myself quietly, and walking into a room full of people who once picked apart every detail of me feels like stepping right back into a cage.\n\nSo no, I don’t want to go. Not because I’m bitter or jealous. But because I finally learned how to choose myself..and returning to that environment feels like betraying everything I’ve healed from.\n\nIs it wrong that I feel relieved at the thought of not attending? Is it rude to just ghost them? ","url":"https://www.reddit.com/r/badroommates/comments/1p67uxf/my_exbest_friendroommates_is_getting_married/","permalink":"/r/badroommates/comments/1p67uxf/my_exbest_friendroommates_is_getting_married/","score":24,"num_comments":20,"over_18":false,"stickied":false,"created_utc":1764061785.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6oxhu","name":"t3_1p6oxhu","subreddit":"badroommates","author":"Chicken-ARMY","title":"Just venting - my roommates are loud like banshees and the house reeks","selftext":"I usually lurk on AITAH and stuff, but I’m so irritated with my roommates right now, I figured I’d post and maybe get some funny commentary. \n\nI (F) am pretty particular about cleanliness. I have an autoimmune disease, so I clean often, partly by nature and partly to try and minimize my chances of sickness. My three male roommates (one is my brother), could not care less about cleanliness.\n\nThere is constantly food rotting. One of them left a chicken in a crock pot for a week because he forgot it there. When he went to open it, the smell was unbearable (at least to me). I begged him to take it out so that I could finish cooking my meal and get away from the smell, but he said it wasn’t that bad and left it open on the counter to clean later. None of them are able to aim when they throw food in the compost, so it’s always on the side of the bin or on the floor. Bags of beer bottles pile up, so in addition to the rot, it smells like stale beer. Today I opened the fridge to get my milk and was hit with a foul odour. I decided to investigate, and lo and behold, there’s some unknown behemoth of mold in the veggie drawer, along with expired roast. \n\nIf the smell situation wasn’t bad enough, the noise is ridiculous. They play basketball at midnight, IN THE HOUSE! I live in the basement, and it genuinely sounds like gunshots. We’re uni students with full access to a gym and amenities, and I’ve suggested that they get together and play there, especially since I’m worried about them making more holes in the wall (which I’ve already had to patch because none of them know how to do that). They host poker nights on weekdays, and the guys scream and bang the chairs against the floor whenever someone wins. In addition to that, one decided to rent a violin, which is lovely, except he’s never played in his life and he practices exclusively at 2:00-3:00am. I had an 8:00am midterm on a Saturday, so I asked that they try to keep it down so that I could rest. I woke up at 3:00am to a group of guys screaming and drunkenly asking where the spare mattress was so they could sleep (just outside my bedroom door). Mind you, half these guys weren’t my roommates. I of course wouldn’t want anyone to be unsafe if they’re drunk, but I had warned the guys that I needed peace and quiet for my exam, so I was pretty pissed to wake up to that. \n\nTo be clear, I’m a very forward person and I have told them how I feel about the living situation. I’m not mean (at least I hope not), but at this point there’s clearly an incompatibility. I wanted to live with my brother to cut down on rent costs, but I’m thinking I’ll bite the bullet and pay rent on my own next year so I can finish university on a good note.\n\nI’ve tried to be mindful that not everyone is a clean freak. I don’t love the piled dishes, but I can tolerate the messy living spaces. The odours and constant noise are what drive me mad. \n\nAnyways thanks for listening to the vent. Feel free to lmk if I’m being a prick, or if you have advice on finding cheap apartment, that would be lovely.\n\n","url":"https://www.reddit.com/r/badroommates/comments/1p6oxhu/just_venting_my_roommates_are_loud_like_banshees/","permalink":"/r/badroommates/comments/1p6oxhu/just_venting_my_roommates_are_loud_like_banshees/","score":9,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764105726.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6609t","name":"t3_1p6609t","subreddit":"badroommates","author":"Ok_Willingness1725","title":"Black mould in shower?","selftext":"Can someone tell me if this is black mould? I JUST noticed this after moving in here 2 months ago. This black stuff all around the base of the shower. What even is it? ","url":"https://www.reddit.com/gallery/1p6609t","permalink":"/r/badroommates/comments/1p6609t/black_mould_in_shower/","score":8,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764054594.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62aj4","name":"t3_1p62aj4","subreddit":"badroommates","author":"Ok_Willingness1725","title":"Is this a good message to send them?","selftext":"Context: I moved in a couple months ago and I’m just not feeling comfortable here. These are things that COULD change but I’m also on the fence of moving out. \n\n\nMessage: \n\nHey, there are a couple things on my mind and I think it’s only fair that I voice them. You’re free to send this to the others. \n\nI’m not trying to accuse or attack anyone at all because I hate confrontation or “drama”, I just need to get things off my chest and see how it goes. \n\nThe main thing that is bugging me is that I’ve realised we have very different ways of living, and I’m struggling to feel relaxed in the flat. I’ve tried really hard to but my body is just constantly tense here and it’s due to multiple things. \n\nI think a big one is feeling like the kitchen area is pretty much never free, and it is nearly always really messy. I will clean it one afternoon and by that night it’s just been trashed. \n\nThe shared spaces are often messy to the point where I wouldnt be comfortable just chilling in the lounge area because it doesn’t feel welcoming to be surrounded by other people’s food and belongings. \n\nThe weed smoking is not something I thought would be every day, or indoors. I have often opened the laundry to breathe in smoke often which isn’t great as I’ve got asthma. \n\nDuring really late hours (12am-3am) at night I’m constantly getting woken up to loud sounds of opening and closing doors, and someone stomping up the stairs extremely loudly. I also sometimes need to pee at night but i will intentionally creep up the stairs and open the doors as quiet as possible. I also got kept up until around 12am hearing talking next door last night. I feel like talking or making loud noise past 11pm on a weeknight is truly disrespectful and it’s really rubbed me the wrong way because it happened again after I mentioned it the first time. \n\nThere is also a bad smell upstairs which I tried to get rid of by cleaning out both the bathrooms, but it’s also kept me up at night from how genuinely strong it is. I don’t know what it could be, but it’s not pleasant and it’s all through the hallway. \n\nI just don’t feel comfortable here the way I have wanted to. I feel like if I’m paying rent to live somewhere I wanna feel like the shared spaces are cleaned respectfully and not treated like a bedroom, and things|food aren’t just left around all the time.\n\n\nDo you feel like these things can be worked on or change? I understand we all have different ways of living. I’m also open to hearing anything you feel I could improve on as a flatmate if there’s anything you want to say. \n\nI feel like our personalities are just very different, quite a bit more than I expected, and I am wondering if it’s worth it. If you don’t feel like this is reasonable then I understand and respect that because once again we all have different lifestyles, I’ll just have to find somewhere else. ","url":"https://www.reddit.com/r/badroommates/comments/1p62aj4/is_this_a_good_message_to_send_them/","permalink":"/r/badroommates/comments/1p62aj4/is_this_a_good_message_to_send_them/","score":9,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764042165.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6brow","name":"t3_1p6brow","subreddit":"badroommates","author":"Formal-Influence-222","title":"My roommate is Disgusting inside and out","selftext":"","url":"/r/roommateproblems/comments/1p6bn67/my_roommate_is_disgusting_inside_and_out/","permalink":"/r/badroommates/comments/1p6brow/my_roommate_is_disgusting_inside_and_out/","score":4,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764075464.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6uiol","name":"t3_1p6uiol","subreddit":"badroommates","author":"scorpioncandy","title":"Roommate leaves food in sink","selftext":"First off I’m so lucky to have a roommate who washes her dishes. \nHOWEVER she refuses to empty the sink drain catcher of food, and it’s NASTY. She’ll only do it when she feels like it which is once a month ish. Mind you, we have a garbage disposal so I’m not sure where the issue is. \nOnce she cooked fish and there were chunks of smelly fish rotting in there for over a week. Sometimes it’s scrambled eggs. The drain catcher thing always has a little pile of brown mushy stuff and it really grosses me out. On the rare occasion she cleans it, it’s full the next day. \nShe has been asked multiple times to clean it. Today I was told if I don’t like looking at it, I should be the one to clean it daily. ?!?!? girl what \n\nI tend to utilize the garbage disposal, I don’t add anything to that drain, it’s always only her food. \n","url":"https://www.reddit.com/r/badroommates/comments/1p6uiol/roommate_leaves_food_in_sink/","permalink":"/r/badroommates/comments/1p6uiol/roommate_leaves_food_in_sink/","score":3,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764119945.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m4cy","name":"t3_1p6m4cy","subreddit":"badroommates","author":"Massive-Cookie174","title":"Roommate would grind coffee at 3 am","selftext":"And wondered why I wanted to move out 😒😒","url":"https://www.reddit.com/r/badroommates/comments/1p6m4cy/roommate_would_grind_coffee_at_3_am/","permalink":"/r/badroommates/comments/1p6m4cy/roommate_would_grind_coffee_at_3_am/","score":3,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764099400.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sbuc","name":"t3_1p6sbuc","subreddit":"badroommates","author":"SouthernService147","title":"Porky loves to do this shit, and do monkey noises while playing fortune","selftext":"","url":"https://www.reddit.com/gallery/1p6sbuc","permalink":"/r/badroommates/comments/1p6sbuc/porky_loves_to_do_this_shit_and_do_monkey_noises/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764114037.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lyuw","name":"t3_1p6lyuw","subreddit":"badroommates","author":"MeanRestaurant8742","title":"Loud roommate who always talks a lot, keeps loud music","selftext":"Hi guys, so I am in a situation where I currently stay in the living room with my roommate/friend. She is so loud all the time, leaves to work at early in the morning, keeps loud volume in her phone and laptop all the time, doesn’t buy earphones because she doesn’t have the budget for it, and moans all the time due to her period cramps. \n\nSince staying in the living room my sleep cycle is already messed up with getting only 3-4 hours sleep per day. She refuses to watch reels at a decent volume, is up until 2am watching videos on her laptop in speaker. \n\nYesterday she kept moaning all night due to period cramps I already feel bad for being so insensitive but I am not able to feel bad for her. She keeps making noises and I hardly have any sleep any night. I feel so light-headed all the time, I feel on-edge, and my head hurts so much. I am not in a financial position to move somewhere else but I am so done. I try to be polite in asking her to reduce the volume but I need to ask her EVERY NIGHT. It’s so irritating and I feel like I am going crazy.\n\nEdit- I would like to add that I have a box fan facing my face to reduce the sound, I have the silicone earplugs and I also started taking melatonin gummies to help me fall asleep in the noise.","url":"https://www.reddit.com/r/badroommates/comments/1p6lyuw/loud_roommate_who_always_talks_a_lot_keeps_loud/","permalink":"/r/badroommates/comments/1p6lyuw/loud_roommate_who_always_talks_a_lot_keeps_loud/","score":2,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764099059.0,"edited":1764106894.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64itm","name":"t3_1p64itm","subreddit":"badroommates","author":"yaLiekJazzz","title":"Someones slamming shit and stomping in our complex at night. Idk which room its coming from. What can i do?","selftext":"","url":"https://www.reddit.com/r/badroommates/comments/1p64itm/someones_slamming_shit_and_stomping_in_our/","permalink":"/r/badroommates/comments/1p64itm/someones_slamming_shit_and_stomping_in_our/","score":1,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764049290.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pvct","name":"t3_1p6pvct","subreddit":"badroommates","author":"Elegant-Page-1359","title":"Splitting rent equally, but one has a personal bathroom?","selftext":"Simple question.\n\nMy roommate and I are renting a two bedroom apartment. One of them has a bathroom connected directly to the room. The other bedroom doesn't, but the common area bathroom is right next door to it. It's just not connected. My roommate insisted we split the rent equally because its only us two and we're not going to have guests over due to it being an apartment with horrible almost non-existent parking for guests. I agreed because it made sense and the rooms are pretty much the same size.. But then I saw another post on Reddit here that had the same issue. A lot of people seem to agree that an ensuite bathroom pays more regardless of square footage.\n\nI already agreed with my roommate so I don't plan on going against our agreement. BUT for future reference if I were to be in a similar renting situation, how should I go about this?","url":"https://i.redd.it/8e4qj6xm6h3g1.jpeg","permalink":"/r/badroommates/comments/1p6pvct/splitting_rent_equally_but_one_has_a_personal/","score":0,"num_comments":55,"over_18":false,"stickied":false,"created_utc":1764107944.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t8gd","name":"t3_1p6t8gd","subreddit":"badroommates","author":"Slight-Baby-7091","title":"if you think its okay to poison your roommate or coworker for eating your food, you're a sick, demented, passive-agressive POS with no conscience.","selftext":"","url":"/r/Rants/comments/1p6rzsk/if_you_think_its_okay_to_poison_your_roommate_or/","permalink":"/r/badroommates/comments/1p6t8gd/if_you_think_its_okay_to_poison_your_roommate_or/","score":0,"num_comments":21,"over_18":false,"stickied":false,"created_utc":1764116427.0,"edited":0.0,"link_flair_text":null,"is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
