{"id":"1p6ggzw","name":"t3_1p6ggzw","subreddit":"personalfinance","author":"compound-interest","title":"Employer has been pocketing my 401k contributions and wants to make it right","selftext":"Edit: Sorry guys, I guess the mod bots got us. I am no longer able to reply to you guys and provide information on my lunch break. I will finish off the work day and reply to any questions you guys have if the mods permit. \n\n\\-------------------\n\nI will try to keep this efficient.\n\nI have worked for this company for 11 years, and contributing to my Roth 401k for 10 of those. Recently, I have realized that my employer has not been making my deposit into the account for about 2 years. I confronted him about it, and he admitted to it. He said he would make it right and put the money in my account by the end of the year. This is a small \\~10 employee and 1.5mill/year business. I read Bogle books in my early 20s. I check my investments about once a year, but missed the deposit last year due to good performance masking it. Completely my fault for not noticing but I tend to leave it alone and forget about it with my funds. I knew the match was \"pausing\" in like 2020 or so, but I didn't realize in 2023 that my funds stopped being deposited at ALL.\n\nI have asked that he deposit not only the value, but the growth that I would have had if he had deposited on time.\n\nI have a lot of power at this company, because I generate about half of the yearly revenue by myself. He has agreed to switch 401k providers as well, because I identified the fees are very uncompetitive. The fee is about 1.5% per year of the total value in your 401k fund! It's ridiculous.\n\nThe point of this post is to identify my points of recourse if he doesn't deposit into the account by the end of the year as promised. I will obviously be leaving if that doesn't happen, but I need to know what legal recourse I have for this. I do not plan on pursuing anything if this is made whole, as I am the only one affected due to everyone else just not caring to contribute to retirement. I like my boss as a person, but obviously he has really screwed me here. Not trying to make excuses for him. I am livid but at least when confronted he folded and I may be able to make this into a win for myself by getting a better fund and being made whole. The company went through some major financial issues, but we have worked through them together.\n\nAlso, please recommend me where to start on moving our 401k plan. I need to shop around providers by the end of the year. I would really love to hear everyone's recommendations. We don't currently use our HR company for 401k, so I will ping them about their options first I think.","url":"https://www.reddit.com/r/personalfinance/comments/1p6ggzw/employer_has_been_pocketing_my_401k_contributions/","permalink":"/r/personalfinance/comments/1p6ggzw/employer_has_been_pocketing_my_401k_contributions/","score":1163,"num_comments":530,"over_18":false,"stickied":false,"created_utc":1764087016.0,"edited":1764090756.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nzsy","name":"t3_1p6nzsy","subreddit":"personalfinance","author":"Ok_Survey_4753","title":"Cosingner stopped making payments, won't return the car, and wants to take it to Mexico.","selftext":"Hello, I am looking for advice. My Ex and I got a car in 2021, and we still owe 14k. In October, she took over the car but hasn't made any payments. She has threatened to take the vehicle to Mexico so the bank doesn't repo it (Westlake Financial). Registration is under my name, but doesn't expire until March 2026. I don't know what to do since the loan is under both of our names; I can't technically report it as stolen. I already called the bank, and the girl who answered said she hasn't dealt with anything like this before, and the supervisor was supposed to call me, but nothing yet. Has anyone gone through something similar before? ","url":"https://www.reddit.com/r/personalfinance/comments/1p6nzsy/cosingner_stopped_making_payments_wont_return_the/","permalink":"/r/personalfinance/comments/1p6nzsy/cosingner_stopped_making_payments_wont_return_the/","score":186,"num_comments":219,"over_18":false,"stickied":false,"created_utc":1764103610.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jvdg","name":"t3_1p6jvdg","subreddit":"personalfinance","author":"Ok_Cauliflower1431","title":"Hospital billed me and sent me to collections after insurance says they legally cannot do that","selftext":"UPDATE: Got back in touch with insurance who got ahold of my hospitals billing department. Insurance says they will be reprocessing the claim and hospital is recalling the bill from the collection agency. She said I will have an updated EOB within 30 days. Honestly don’t know what different outcome will happen because it seems like they’re just reprocessing a claim they denied due to the missing information, but I saved myself 30 more days of being in collections I guess🤷🏻‍♀️\n\nHad my baby in August of 2024, all of my bills but one ($3,000+) were covered by insurance right away. My EOB said I owe no payment and the hospital cannot bill me for this service as they say medical records were never sent on the hospital’s end. I called the hospital and they said they also saw that so they tried to rebill insurance and the claim was denied again…missing medical information/records again. I called insurance to make sure all of my information was up to date (thought maybe my last name had something to do with it since I was recently married but everything was fine and again all my other bills from giving birth were covered). Called the hospital yet again to let them know insurance says something is wrong on the hospital’s end once more, but instead of fixing their issue, they decided to just send me to collections…\n\nI called the hospital AGAIN, and they say because insurance keeps denying it and they’re past a certain filing point, it becomes patient responsibility and I have to pay. So I call insurance again and they say that the hospital legally cannot bill me for this service, let alone send me to collections over it. Call the hospital again…same BS and “insurance doesn’t know what they’re talking about, it’s completely legal” yada yada. I’ve been talking with HR (company insurance BCBS)) and they agree with insurance company that since insurance keeps denying it over a fault of the hospitals, they cannot bill me. \n\nI guess I’m just at a loss of what to do at this point. It’s been over a year of battling this and it’s getting nowhere (well besides collections apparently). Is the hospital right and it’s my responsibility or is my insurance right and the hospital legally could not do this?","url":"https://www.reddit.com/r/personalfinance/comments/1p6jvdg/hospital_billed_me_and_sent_me_to_collections/","permalink":"/r/personalfinance/comments/1p6jvdg/hospital_billed_me_and_sent_me_to_collections/","score":108,"num_comments":37,"over_18":false,"stickied":false,"created_utc":1764094489.0,"edited":1764109045.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fj59","name":"t3_1p6fj59","subreddit":"personalfinance","author":"mlurve","title":"Am I being too cautious with an overly large emergency fund?","selftext":"Hi there! I'm 36 years old, recently went through a divorce (amicable, we split everything roughly 50/50), sold the apartment we co-owned, and am trying to figure out how to best set myself up for success for my future. I currently make \\~$180K per year before taxes in a HCOL area but am quite burnt out at my job. I don't work crazy long hours necessarily, but have been struggling to find a sense of purpose (my therapist thinks I should quit, a career coach and internal mentor have both suggested I take a sabbatical of some type but my company doesn't seem to offer that?) but given the economy, don't feel that I can just rage quit and easily find something new. So I'm continuing along for now, but even though my job and company seem stable, I feel a sense of unease that it can be taken away at any moment. I also had some big unexpected expenses this year, a surprise surgery, my cat needing dental work, a several thousand dollar tax bill. But at the same time, I'm feeling like I may be overindexing on my emergency fund and should actually be putting more of that money into the market. I gave myself roughly $500 \"fun money\" investing to play around with but mostly have been putting extra cash into VOO/VTI/VXUS sorts of things.\n\nI max out my 401K with company match and have roughly 9 months of current spending in savings in an emergency fund (assuming I don't try to lower my expenses which I would do if I lost my job, of course). I also have a separate savings account with roughly $9K to invest in a creative hobby that has the potential to become a little side hustle.\n\nHere's the breakdown:\n\nEmergency Savings: $90K  \nFun Money Savings: $9K  \nChecking: \\~$1K  \nHSA Savings: $1K  \nHSA Investments: \\~$400  \nEmployee Stock Plan: $32.5K  \nOld company 401K: \\~$35K  \nRoth IRA: $13.8K  \nTaxable Brokerage: \\~$5K  \nRollover IRA: \\~$100K  \n401K: \\~$348K\n\nI don't plan to buy real estate anytime soon, am I being too cautious having so much in savings? I'm also feeling a bit insecure as I have some friends who have gotten stock options and things where they've worked and have amassed seven figures or more in net worth at this point because they've had more in the market. \n\nOr is it okay in case I get excessively burnt out and end up unemployed for a while? I don't know I guess I'm just looking for some feedback. Thanks in advance!","url":"https://www.reddit.com/r/personalfinance/comments/1p6fj59/am_i_being_too_cautious_with_an_overly_large/","permalink":"/r/personalfinance/comments/1p6fj59/am_i_being_too_cautious_with_an_overly_large/","score":90,"num_comments":90,"over_18":false,"stickied":false,"created_utc":1764084913.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lj2e","name":"t3_1p6lj2e","subreddit":"personalfinance","author":"Top-Kale-3363","title":"At fault insurance sent me a letter saying they disclaiming any coverage","selftext":"So on Sept 25th I was driving down a main road(with 4 lanes: 2 in each direction ) and a car comes out of a parking lot failing to yield before pulling onto the main road (attempting to make a left turn across two lanes of traffic. He damaged the rear passenger door on the right and it was clearly his fault. The officers cited him and he did have a hearing where he plead no contest and paid about a $200 fine. On Nov18th… the at fault drivers wife texted me saying that they learned their insurance is not covering the damages and was wondering if my insurance could cover it and they can help pay the deductible… his wife explained wanting to resolve the matter. I didn’t reply. \n\nI got mail from the at fault insurance company today (dated Nov 17th) that they are indeed disclaiming the claim. What happens next… also I did speak to his insurance company as well because they had a difficult time contacting the other driver… and I gave them the police report, pictures, and the facts… my insurance company said it was ok and probably help the process faster. Is my insurance company going to keep fighting? My car had $6k worth of damages…1.2k for rentals… I came out of pocket with a 2k deductible and another 400 dollars because the repairs took longer than the 30 days my insurance was covering.","url":"https://www.reddit.com/r/personalfinance/comments/1p6lj2e/at_fault_insurance_sent_me_a_letter_saying_they/","permalink":"/r/personalfinance/comments/1p6lj2e/at_fault_insurance_sent_me_a_letter_saying_they/","score":42,"num_comments":53,"over_18":false,"stickied":false,"created_utc":1764098080.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p60i13","name":"t3_1p60i13","subreddit":"personalfinance","author":"rando2992","title":"Retirement planning as we get older","selftext":"I'd like some honest feedback about my financial situation. Any thoughts on our next steps.  49m, married with 5 kids. 1 is married and fully independent . 1 graduated college, living with us while he figures out a good roommate situation, working full time, has no debt. Next one is living with us, finishing college online and working part time. 4th is sophomore in college, home on breaks. All of them are basically independent, though we do provide housing and food for those at home, minimal rent for the full time worker, no rent for the students. 5th just turned 7, so he's still a wee bit dependent! Wife doesn't work, I am a teacher, salary after taxes, ins, and retirement is about $4200/mo. I have a side job that brings in around $1500/mo. House will be paid off in about 4 years, planning to downsize once we get a few kids launched. I can retire in 5 more years, will get about $4900/mo pension. Then have another 7-10 years to work and save, as other than about 10k emergency fund, we don't have much for investments. \nSo Reddit, are we doing ok? What should we be doing differently? What should we focus on once our income grows with no house payment or second income? We won't have many years for investments to grow at that point. Hoping to encourage my kids to plan ahead for retirement more than I did!","url":"https://www.reddit.com/r/personalfinance/comments/1p60i13/retirement_planning_as_we_get_older/","permalink":"/r/personalfinance/comments/1p60i13/retirement_planning_as_we_get_older/","score":25,"num_comments":19,"over_18":false,"stickied":false,"created_utc":1764037000.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63ft2","name":"t3_1p63ft2","subreddit":"personalfinance","author":"Melodic_Branch_1404","title":"What should I do with my savings if it's not enough to buy a house but too much to sit on?","selftext":"I'm 24 with a steady job, I have no debt. After college, I spent 2 years living with my parents and managed to save $55k. I'm living on my own now. With house prices growing faster than I can save with rent due, I am not sure what to do with my savings. \n\nI adopted a hybrid approach - 40% in an S&P 500 index fund, 40% in a 6 month CD, and 20% accessible at all times. (I have 10% of my income with 4.5% matching automatically going into a Roth 401(k), it's not a part of the above percentage, I pretend it's not there)\n\nI see guidance online for 0-5 years and 10+ years. I am looking for guidance in that 5-10 year range. Is what I am doing crazy or should I stay the course?","url":"https://www.reddit.com/r/personalfinance/comments/1p63ft2/what_should_i_do_with_my_savings_if_its_not/","permalink":"/r/personalfinance/comments/1p63ft2/what_should_i_do_with_my_savings_if_its_not/","score":20,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764045738.0,"edited":0.0,"link_flair_text":"Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6cgt6","name":"t3_1p6cgt6","subreddit":"personalfinance","author":"MISTAH_BOOMBA","title":"When getting bought off a mortgage from co-owner, will pay out be taxable?","selftext":"Bought a house with my (now ex) girlfriend in 2018. Never married, no kids. We are both on the mortgage and title, 50/50. She wants to buy out my half of the home. This home has been my primary residence since we bought it. \n\nShe got approved a HELOC to pay off the current mortgage. She plans on using a combination of her parent’s cash and her savings to pay me out. \n\nWith this structure: Is this considered a sale? Will the payout be taxed?","url":"https://www.reddit.com/r/personalfinance/comments/1p6cgt6/when_getting_bought_off_a_mortgage_from_coowner/","permalink":"/r/personalfinance/comments/1p6cgt6/when_getting_bought_off_a_mortgage_from_coowner/","score":16,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1764077405.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61wx2","name":"t3_1p61wx2","subreddit":"personalfinance","author":"TopSympathy9740","title":"How can i afford to go to college?","selftext":"Sorry if this is the wrong sub Reddit for this, but everyone ive asked for advice has no suggestions for me. \n\nIm 26, ive been a dog groomer since i was 19. It pays good enough to afford my bills rn, i make between 3,400$-4,000$ a month. i dont want to be a dog groomer forever. I want to go to college to get my library science diploma so i can be a highschool librarian, but the diploma is very versatile you can get alot of different jobs with it and its a stepping stone to alot of other fields too, like historical literature restoration, archivist, ect. If i finish the course in 2 years (six classes a semester) it'll only cost about 15k-20k depending on supplies cost. \n\nI come from a poor family, and have no family that lives in the city with me. Student loans and grants won't cover my living expenses, i can't move in with family, i don't have a partner/family member who can pay the bills while i go to school, i have 3 cats so i can't do dorms, if i go to school full time then i cant work, if i work full time then ill never have time for school. If i just take one or two classes a semester then i end up paying more tuition over time, putting me in more debt long term. \n\nI dont know how to make this work, but theres gotta be a way right? My monthly expenses are about 1800$ not including food, so like 2k a month. Any advice? ","url":"https://www.reddit.com/r/personalfinance/comments/1p61wx2/how_can_i_afford_to_go_to_college/","permalink":"/r/personalfinance/comments/1p61wx2/how_can_i_afford_to_go_to_college/","score":12,"num_comments":45,"over_18":false,"stickied":false,"created_utc":1764041043.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sg77","name":"t3_1p6sg77","subreddit":"personalfinance","author":"Newton-tootin75","title":"It’s becoming clear I’ve made bad decisions and I don’t know what to do with my savings","selftext":"I always wanted to buy a home, so I saved very aggressively with that in mind for 13 years of working. The problem was I left all of it in the bank, so it never really grew.\n\nUnfortunately with all that’s happened in the last few years, it’s pretty clear I’ll never afford a mortgage on my $60-65k per year salary when a decent house can cost anywhere from $250k to 300k here. And, I’m never getting married.\n\nThis year I was finally able to start a 401K and I started a Roth IRA last year, which I’ve maxed out. The Roth has not grown much, I’ve put $14k in two years and it’s currently at $15k. It’s in a 2055 target date fund.\n\nThe 401K I’m currently contributing as much as I can because my expenses are low, but between that and my IRA I’ve only got about $27k, which at 36 is not that good. Even if I could afford a house at some point, my contributions would have to be much lower than they are now.\n\nI have the rest of my life savings between HYSA and jumbo share certificate. I know I probably need to invest some of it in a brokerage fund, but I prefer not  taking the risk with the money because it’s taken me 13 years of working to acquire it, and most of it was because I lived with my parents and had practically no housing expenses. \n\nIt makes about $10k per year between the accounts. But I know if I just leave it sitting that it’s going to keep losing money to inflation.\n\nI know I have a spending problem and know that I don’t make much money. I am neurodivergent, so jobs that require conflict and supervisory roles don’t work for me. I know that being the case, there likely isn’t much I can do to earn an income that will pay a mortgage as well as living expenses and still be able to save sufficiently for retirement.\n\nSo I probably will never fulfill my desire to own a home, which of course is only exacerbated by the fact that I will likely never have a partner. I just don’t see any path to it as I’ve only become even more secluded and socially anxious as I’ve gotten older.\n\nSo yes, I’m not sure what to do. I know I can spend less on buying food and such but my costs are already cut about as low as I can.\n\nI can probably invest more money but I just don’t see that getting me enough income to afford a mortgage, and property tax and homeowners insurance and  health insurance and auto insurance, and and and.\n\nI just don’t see a fix to the low income problem because saving money only helps so much, and it’s not like I go on vacations or buy expensive things or go to eat at restaurants or anything. It’s just that my income is too low to afford a home.\n\nIt would have maybe been possible to buy a home on my salary before 2020 but instead I made the choice to replace a car that had lots of problems instead.","url":"https://www.reddit.com/r/personalfinance/comments/1p6sg77/its_becoming_clear_ive_made_bad_decisions_and_i/","permalink":"/r/personalfinance/comments/1p6sg77/its_becoming_clear_ive_made_bad_decisions_and_i/","score":13,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764114356.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ico5","name":"t3_1p6ico5","subreddit":"personalfinance","author":"nomnomnompizza","title":"End of year 401k catchup","selftext":"I max my 401k. Wife is only on track to be at $13,100. We can afford to do 100%. She pays for our insurance, but I can't tell if we can do 100% or we need to do like 80% to leave money leftover for insurance and any other post-tax deductions.","url":"https://www.reddit.com/r/personalfinance/comments/1p6ico5/end_of_year_401k_catchup/","permalink":"/r/personalfinance/comments/1p6ico5/end_of_year_401k_catchup/","score":10,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764091158.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fbec","name":"t3_1p6fbec","subreddit":"personalfinance","author":"Erika_Arb","title":"Santander withheld my $933.44 overpayment for 503 days - filed CFPB complaint","selftext":"I paid off my Santander auto loan on July 3, 2024, overpaying by $933.44. Despite 20+ calls and certified letters, they have withheld this refund for 503 days.\n\n\n\n\\*\\*Timeline:\\*\\*\n\n\\- July 3, 2024: Paid off loan, overpayment of $933.44\n\n\\- July-Nov 2024: I called 10+ times, sent chats. They claimed checks were \"mailed\" twice but NEVER provided tracking numbers. Checks never arrived.\n\n\\- Key fact: Santander NEVER contacted me proactively in 1.5 years. Their first call came only AFTER I sent the demand letter.\n\n\\- Nov 18, 2025: Sent certified demand letter requesting $12,000 ($933.44 refund + $11,066.56 damages)\n\n\\- Nov 25, 2025: Filed CFPB complaint #251125-26220217\n\n\n\n\\*\\*Actions taken:\\*\\*\n\n\\- BBB complaint filed\n\n\\- NJ Banking Department complaint filed\n\n\\- ConsumerAffairs review posted\n\n\\- CFPB complaint filed (15-day response period)\n\n\n\n\\*\\*Question:\\*\\* Has anyone dealt with Santander Consumer USA withholding refunds? What additional steps should I take?\n\n\n\nI have documentation of all contact attempts, certified mail receipts, and regulatory complaint confirmations. The loan was sold to Exeter Finance, but Santander received the payoff and owes the refund.\n\n\n\nAny advice appreciated.","url":"https://www.reddit.com/r/personalfinance/comments/1p6fbec/santander_withheld_my_93344_overpayment_for_503/","permalink":"/r/personalfinance/comments/1p6fbec/santander_withheld_my_93344_overpayment_for_503/","score":9,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764084425.0,"edited":0.0,"link_flair_text":"Taxes","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fdfk","name":"t3_1p6fdfk","subreddit":"personalfinance","author":"PopKoRnGenius","title":"Should I keep my HELOC open or close it out now that it's paid off?","selftext":"I have pretty good credit (somewhere in the 700's last time I checked) and we just paid off a 25k HELOC loan. The interest is 11% so I would only use this if I absolutely needed it. Would it hurt me at all to keep it open credit wise? Would it benefit me in any way to close it or would it hurt to keep it open?","url":"https://www.reddit.com/r/personalfinance/comments/1p6fdfk/should_i_keep_my_heloc_open_or_close_it_out_now/","permalink":"/r/personalfinance/comments/1p6fdfk/should_i_keep_my_heloc_open_or_close_it_out_now/","score":8,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764084554.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6eopo","name":"t3_1p6eopo","subreddit":"personalfinance","author":"MelodicMark4860","title":"How Do I Get Old Paystubs From Redbox/Chicken Soup for the Soul After Bankruptcy?","selftext":"Hi everyone,  \nI used to work for Redbox / Chicken Soup for the Soul, which went bankrupt last year. I received my W-2 from UKG, but I still need copies of my paystubs for tax purposes.\n\nDoes anyone know how I can get access to my old paystubs now that the company is no longer operating? Any guidance would be appreciated.","url":"https://www.reddit.com/r/personalfinance/comments/1p6eopo/how_do_i_get_old_paystubs_from_redboxchicken_soup/","permalink":"/r/personalfinance/comments/1p6eopo/how_do_i_get_old_paystubs_from_redboxchicken_soup/","score":4,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1764082960.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kulk","name":"t3_1p6kulk","subreddit":"personalfinance","author":"Unable_Connection490","title":"I’ve been given the option between a base salary and an hourly rate, and I’m struggling to choose","selftext":"I’m in America btw. \n\nSo I currently work 2 jobs; I’m a data analyst and I’m also a graduate TA. I’m in school for a masters degree rn(23M). In order to graduate I need to get an internship and I have one lined up(with the same place where I work as a data analyst for). \n\nSo currently, I’m paid a base salary in my TA position and hourly as a data analyst(I chose this, cuz I get 1.5x pay overtime and they require a decent bit of overtime). For the TA position, I don’t get to choose. \n\nBut with the internship they gave me the choice between hourly or base, but there’s no overtime here. But they’re letting me choose hourly or base. \n\nAny tips? Should I just choose the bigger number? I did the calculations and hourly will allow me to net more every month(not by any significant margin), but if I get sick I can’t use a sick day cuz that’s just for my job as a data analyst(my internship is at a different branch of the same org). But technically with the base pay I don’t have to opt in and out of a clocking system, so you could say it’s more pay for less hours? Idk. I’m confused. \n\nMy pops tells me to go base pay just cuz it’s more “official” but that feels stupid. \n\nEdit: I will still be working as a data analyst while this internship is going on, but I won’t be a TA anymore ","url":"https://www.reddit.com/r/personalfinance/comments/1p6kulk/ive_been_given_the_option_between_a_base_salary/","permalink":"/r/personalfinance/comments/1p6kulk/ive_been_given_the_option_between_a_base_salary/","score":5,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764096620.0,"edited":0.0,"link_flair_text":"Employment","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lqs5","name":"t3_1p6lqs5","subreddit":"personalfinance","author":"rags_to_worse_rags","title":"How am I looking on retirement?","selftext":"40m in U.S. LCOL area. 95k salary. I put around $13,000 in 401k yearly, employer matches 100% up to 4%. 401k is currently around $125,000. I have $13,000 in a 457b account from an old job as well. Have around $20,000 in the bank at the moment. My company 401k is through a Nationwide plan. Their projection for me is $1.2 million based on \"my projected retirement\" age (whenever that is). I'm not married, but in a domestic partnership and will hopefully remain in it until I'm dead. She makes around 25k and contributes very little to her retirement, but she should also receive a small monthly pension. I'm also not even worried about her stuff, hopefully it will just be \"extra\" money for us. We have 1 adult offspring in college, but they will be graduating in a couple of years. So far college has cost us nothing aside from rent and utilities. Monthly spending is as follows: \n\n$850 mortgage (+ $3k in property taxes annually), about 20 more years on paying that off. \n\n$900 on groceries/goods/restaurants. \n\n$800 on combined utilities. \n\nNo car payments at the moment.\n\nMonthly income is about $4400. \n\nI'm basing all of this solely on my income because hers has always been so little, and since I pay all of the mortgage and bills. Will we have enough to retire reasonably based on my income and 401k?","url":"https://www.reddit.com/r/personalfinance/comments/1p6lqs5/how_am_i_looking_on_retirement/","permalink":"/r/personalfinance/comments/1p6lqs5/how_am_i_looking_on_retirement/","score":5,"num_comments":23,"over_18":false,"stickied":false,"created_utc":1764098555.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61kwn","name":"t3_1p61kwn","subreddit":"personalfinance","author":"mwohio","title":"401k Contribution - Abnormal Company Match?","selftext":"Hello, I am looking for some help double checking if I have my head in the right place as my company benefits are a bit abnormal I believe. \n\nMy company matches 2x up to 4% and then an additional 10% of your total salary + bonus at the end of the year.\n\nSo if contribute 4% they match it with 8% and then the additional 10% means I put away 22% of my income (roughly) into my 401k annually.\n\nWith this extra income I contribute $50/week to a HSA and have maxed my Roth the last 3 years. Anything additional on top of that I put either in a HYSA or my taxable brokerage account.\n\nAre there any smarter routes I might be missing or not know about? Should I increase my 401k contributions above the base 4% or continue to let it ride with the minimum and use the extra elsewhere? Does it make sense to start any accounts for future kids this early?\n\nFor reference:\n\n•\t⁠25 yrs old Engineer (Civil Consulting)\n•\t⁠90k salary, 16-20k bonus expected (2025)\n•\t⁠No debt other than mortgage\n•\t⁠Homeowner in Ohio, house is financed w/ VA loan.\n•\t⁠Getting married next year to another engineer and we would plan for kids within 2-3 years. \n\nThanks in advance for the time! ","url":"https://www.reddit.com/r/personalfinance/comments/1p61kwn/401k_contribution_abnormal_company_match/","permalink":"/r/personalfinance/comments/1p61kwn/401k_contribution_abnormal_company_match/","score":4,"num_comments":28,"over_18":false,"stickied":false,"created_utc":1764040059.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t3zz","name":"t3_1p6t3zz","subreddit":"personalfinance","author":"FrogandToadTown","title":"Advice needed - Permanent life insurance scenario, hoping to get out!","selftext":"I'm asking this for a friend in her mid 30s, and has been putting in $610 a month to a permanent life insurance plan since mid 2020. So in total about 5.5 years. At this point she's about $42,000 deep in it and if she were to pull it all out now and cancel the plan, she'd only get roughly $25,000 back. \n\nMy question: Is she already so deep in at this point that she might as well stick with it? I don't know what her break even point is but her insurance broker at NW Mutual (I realize they suck!) is to keep it for at least 7 years, for whatever reason. Oh and she ALSO has a term life insurance plan with NW Mutual, which on its own seems cheap enough that she might as well keep (+ she's about to have a kid).\n\nMy instinct is to tell her to just pull the 25k out of the permanent plan, consider it a loss, and redirect energies to investing. But I feel ill informed here since all I know about perm life insurance is to run away from it (I don't even know the tax implications of pulling the 25k). Any advice or opinions would be extremely welcome! ","url":"https://www.reddit.com/r/personalfinance/comments/1p6t3zz/advice_needed_permanent_life_insurance_scenario/","permalink":"/r/personalfinance/comments/1p6t3zz/advice_needed_permanent_life_insurance_scenario/","score":3,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764116095.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sus9","name":"t3_1p6sus9","subreddit":"personalfinance","author":"Inner_Ad2429","title":"Backdoor Roth question - pro-rata","selftext":"I am in the processing of moving my rollover IRA account (Capital Group) into a self employed 401K (Fidelity). \n\nMy goal is to avoid pro-rata rules so I can contribute to a backdoor Roth in 2025 and 2026. \n\nThe first account (rollover IRA at Capital Group) should transfer to the 401K by end of year no problem. But I have a second small pension account that is also in process of being moved to a Fidelity IRA. It's taking forever. This also must be moved to the self-employed 401K.\n\nWhat happens if it's not completed by 12/31/25? I understand that I can contribute to a 2025 Roth until 4/15/26 but if there is still an IRA balance at the end of the year will I be taxed per pro-rata rules? ","url":"https://www.reddit.com/r/personalfinance/comments/1p6sus9/backdoor_roth_question_prorata/","permalink":"/r/personalfinance/comments/1p6sus9/backdoor_roth_question_prorata/","score":3,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764115419.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6sfb8","name":"t3_1p6sfb8","subreddit":"personalfinance","author":"SufficientAd2514","title":"What to do with my investments while I’m in anesthesia school?","selftext":"In May I am starting anesthesia school and will be unemployed for 3 years. I want to limit my exposure to volatility while in school in the event that I have to draw the funds out to cover education or cost of living expenses (this is a last resort). I’m mainly looking for a plan for my IRAs, but am open to all other advice also. \n\nCurrently: \n\n$30,400 in a Fidelity Roth 403b target retirement fund;\n$6,400 in a Vanguard Roth IRA;\n$18,500 in a HYSA;\n$21,100 in a CD;\nI have another $32,000 to work with soon that I’m planning to also put in a CD. \n\nWhat should I do with the IRAs to keep growing as much as possible but also reduce the hit of a market downturn in the event I need these funds within the next 3 years? \n\n\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6sfb8/what_to_do_with_my_investments_while_im_in/","permalink":"/r/personalfinance/comments/1p6sfb8/what_to_do_with_my_investments_while_im_in/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764114294.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qwqb","name":"t3_1p6qwqb","subreddit":"personalfinance","author":"jord4n04","title":"Stressed about the car!","selftext":"About five years ago, as a younger man, I made a bad decision and hire purchase financed a car until this coming January. The payments are fairly low (£125 p/month), however the car itself was a bad pick. Paired with high milage for work and I landed myself in negative equity for some time there. Now I’m only a couple months away from paying the car off, it’s got a serious fault and is likely to fail any day now. I need my car for work (public transportation isn’t an option due to location unfortunately).\n\nA bit more background. I am 21 and have a mortgage with my partner on a small flat. She is in university at the moment, so I take on most of the bills. For this reason I’ve had limited ability to save money, and have around £900 spare.\n\nI now face two options as I see it:\n\nOption 1 - Agree to another finance agreement, this time PCP and likely around £200 per month. This would leave me with around £400 disposable per month. An amount which I’ve found hard to save from over the past few years.\n\nOption 2 - Take my £900 and buy a very cheap run around car that I hope will last me at least a year. Conceding that taking this option would eliminate my emergency savings, but leave me with a greater £600 per month and more ability to save.\n\nTo add to the context, within the next year my girlfriend will be finishing her studies and hopefully begin working full time. This should lift some of the financial burden, and along with my pay bump at work, allow me an additional £300 per month disposable.\n\nTo summarise, I’ve been scarred by my last experience with car finance and am apprehensive over making the same mistake again. I lean toward the idea of a cheap runaround car, but this of course comes with the depleted safety net for a while. And I would of course be vulnerable to the car failing and leaving me right up sh*t creek!\n\nThe whole situation has really been stressing me out and caused a bit of tension between me and the broad. Could really use some advice from an outsider! Thanks","url":"https://www.reddit.com/r/personalfinance/comments/1p6qwqb/stressed_about_the_car/","permalink":"/r/personalfinance/comments/1p6qwqb/stressed_about_the_car/","score":3,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764110418.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6o5kj","name":"t3_1p6o5kj","subreddit":"personalfinance","author":"Huck68finn","title":"Financial advisor -- where to start","selftext":"I am the sole earner in my two-person household (just me and my husband). I'm in my late 50s; he's in his mid 70s. I've managed to save some money (not a lot by most people's estimation) by working full-time and taking on pt contract work. I'd like to do something with my money rather than just let it languish in checking/savings in the bank. But I'm clueless regarding where to start. I have a retirement fund w/ my employer (matching). \n\nI want some financial advice/plan from a professional. I did some preliminary digging and found out that I probably need a Fee-Only Fiduciary Financial Planner (CFP), ideally offering hourly or project-based planning. **Am I going in the right direction?** Anything else I need to look for? Any national companies with good reps?","url":"https://www.reddit.com/r/personalfinance/comments/1p6o5kj/financial_advisor_where_to_start/","permalink":"/r/personalfinance/comments/1p6o5kj/financial_advisor_where_to_start/","score":3,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764103985.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kv8d","name":"t3_1p6kv8d","subreddit":"personalfinance","author":"Salty_Nature_1489","title":"honestly just overwhelmed and feel like im drowning in info, where do i actually start if i have nothing?","selftext":"i’ve been lurking here for a few weeks trying to make sense of the flowchart and honestly it just makes me want to cry. i see everyone talking about hysa and roths and maxing out 401ks and i’m sitting here with like $1400 in a regular checking account and no idea what im doing.\n\ni’m 24 and make about $42k a year (gross not net) and i have no debt besides a small car loan (about 4k left on it) but i feel like im falling behind everyone else my age. i tried reading the wiki but its like reading a different language sometimes. do i just throw the extra $200 i have at the end of the month into a savings account at my bank (chase) or is that stupid? i keep hearing inflation is eating my money but investing feels like gambling to me right now because i don’t understand it.\n\nsorry if this is a dumb question i just genuinely want to fix my life before i wake up and im 40 with nothing. just need someone to talk to me like im 5 years old for a second.","url":"https://www.reddit.com/r/personalfinance/comments/1p6kv8d/honestly_just_overwhelmed_and_feel_like_im/","permalink":"/r/personalfinance/comments/1p6kv8d/honestly_just_overwhelmed_and_feel_like_im/","score":5,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764096657.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fj5w","name":"t3_1p6fj5w","subreddit":"personalfinance","author":"Existing_Mongoose_95","title":"Credit union with joint account recommendations?","selftext":"Hi everyone! I’m looking for a credit union with:\n\neasy to use app\n\nsome way of organizing savings (I love sofi vaults, but they dont allow you to have a joint account and individual account)\n\nhigh yield savings account\n\nI thought alliant would work, but they limit joint account holders\n\nanyone have any options you would recommend? Thank you","url":"https://www.reddit.com/r/personalfinance/comments/1p6fj5w/credit_union_with_joint_account_recommendations/","permalink":"/r/personalfinance/comments/1p6fj5w/credit_union_with_joint_account_recommendations/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764084915.0,"edited":1764085786.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6eht3","name":"t3_1p6eht3","subreddit":"personalfinance","author":"messiteamo2","title":"21, recently graduated and unsure whether I should move back home or keep living on my own. What would you do?","selftext":"21, recently graduated.\n\nI’ve been living in a city about 2 hours away from my hometown because I studied here, and I rent an apartment. My dad has been helping me with most of the expenses. Now that I’ve graduated, I’m trying to figure out my next steps. I’ve been sending out my résumé for weeks looking for my first full-time job, but the job market here is tough and I haven’t gotten any concrete replies.\n\nThat’s why I’m seriously considering moving back to my hometown for a while. It would mean giving up my apartment and moving out, but financially it would help a lot. I’d save on rent, utilities, food, and everything else while continuing to job hunt. And if I find a job there, I wouldn’t have the pressure of supporting myself alone right from the start.\n\nThe thing is, I really enjoy the independence and lifestyle I have in this city, but I’m not sure it’s realistic right now without stable income. My cost of living here is around 1500 usd per month, so moving back home would save me roughly 18000 usd per year (approximately). \n\nMy goal isn’t to “live off my parents,” but to make a smart decision so I don’t start my adult life already stressed or in debt.\n\nHas anyone been in a similar situation?  \nIs it better to prioritize financial stability at the beginning, even if it means moving back home?  \nWhat worked best for you when you were starting out?\n\nAny advice or experience is appreciated.","url":"https://www.reddit.com/r/personalfinance/comments/1p6eht3/21_recently_graduated_and_unsure_whether_i_should/","permalink":"/r/personalfinance/comments/1p6eht3/21_recently_graduated_and_unsure_whether_i_should/","score":4,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764082518.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m32b","name":"t3_1p6m32b","subreddit":"personalfinance","author":"altcntrl","title":"Consolidation Loan advice","selftext":"I’ve mainly used my CCs over the years for emergencies for medical or auto repairs with the occasional purchase on vacation. They’ve added up and paying the minimum is not making a dent. I’ll have more money available once my car loan is finished off but I’d like to start getting them down sooner than later. \n\nI recently got Credit Karma and have seen that I can get a loan/card at a lower rate with a longer time to pay it off interest free. I have a hard time trusting anything telling me there’s something that will help improve my life. I’ve got $5200 to get down between a couple cards which I know I manageable to most but currently it’s a bit much for my income. \n\nMy credit is great compared to where it was when I initially got these cards.  \n\nAre there any negative sides to debt consolidation or things to watch?\n\nEdit: I meant to title this “Debt Consolidation” not loan. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6m32b/consolidation_loan_advice/","permalink":"/r/personalfinance/comments/1p6m32b/consolidation_loan_advice/","score":2,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764099320.0,"edited":1764100855.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6irhj","name":"t3_1p6irhj","subreddit":"personalfinance","author":"MechAegis","title":"Quick Questions about withdrawing from HSA account.","selftext":"Hello\n\nI have had my HSA account for about 5 years now. I have not taken any funds out. I am pretty good about using my Credit Card first. Though I have been careless and lost some of the receipts for the services over the years.\n\n1. How do I know what qualifies as a medical expense? We've only been to the pediatricians for my son, obgyn (check-up and ultrasounds) for my wife or a local clinic for quick fixes (Patient First).\n\n2. To withdraw: Write myself a check from HSA account and cash it? Do I just add up my bill amounts and save them with the payment confirmations? If I get questioned about it. \n\n3. Will I ever get questioned why am I withdrawing funds now instead of say 3 years ago when the service was provided?\n\nComes tax season just fill out IRS Form 8889 when filling Form 1040.\n\nThank You\n\n----------------------------------------------------------------------------------------------------------------------------\nWaaay off topic. I have a Traditional IRA account with Fidelity just sitting there in the account. I am I allowed to invested into stocks and what not? Like buying and selling throughout the year. Or should I just throw it into some ~~EFT~~ ETF.","url":"https://www.reddit.com/r/personalfinance/comments/1p6irhj/quick_questions_about_withdrawing_from_hsa_account/","permalink":"/r/personalfinance/comments/1p6irhj/quick_questions_about_withdrawing_from_hsa_account/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764092071.0,"edited":1764096539.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6f1om","name":"t3_1p6f1om","subreddit":"personalfinance","author":"SilverBitter","title":"Should i refinance right after buying the car","selftext":"Hi, I just bought a brand new car couple days ago and has 24000$ for the loan. They gave me 10% on APR. I think its too high. Should i refinance with credit union bank right away within 14 days window to avoid the credit score hit twice or just wait. Thank you.","url":"https://www.reddit.com/r/personalfinance/comments/1p6f1om/should_i_refinance_right_after_buying_the_car/","permalink":"/r/personalfinance/comments/1p6f1om/should_i_refinance_right_after_buying_the_car/","score":2,"num_comments":29,"over_18":false,"stickied":false,"created_utc":1764083803.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6b72w","name":"t3_1p6b72w","subreddit":"personalfinance","author":"Acceptable_Quail_376","title":"Looking for advice on what I can be doing better to set myself up for retirement.","selftext":" I am 28m just started my career in a MCOL area. I make about 2900 biweekly after taxes and other deductions. Recently started contributing 7% into my 401k (has about $900) that has a 3% match. I recently opened up a Roth IRA and put in $7000 to put in VTI and just forget. I’m planning on contributing the max amount yearly as a lump sum.\n\nI have no credit card debt, car is paid off, and after my monthly expenses I’m able to save around $1000-$1200. I have $45,000 in savings at the moment and am saving up for an engagement ring/ a house eventually.\n\nWhat could I be doing better? Do I have too much in my savings? Should I just keep doing what I’m doing? Looking for advice. Thank you.","url":"https://www.reddit.com/r/personalfinance/comments/1p6b72w/looking_for_advice_on_what_i_can_be_doing_better/","permalink":"/r/personalfinance/comments/1p6b72w/looking_for_advice_on_what_i_can_be_doing_better/","score":2,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764073759.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p67x1x","name":"t3_1p67x1x","subreddit":"personalfinance","author":"Nollatron","title":"Debt repayment question.","selftext":"Hi all.  \n\nI’m hoping this question is allowed.  In after some advice or just to get a few opinions on things.   \n\nI have a small amount of debt. It’s only about £450 on a credit card.   However due to my salary it’s quite hard to find the money to pay this.  I have no savings either.  \n\nI’m about to get a back dated pay rise which would be enough to clear this however all of the back dated money would be gone.   The other option is I put the lot in to savings for a real emergency and continue to chip away where I can with the debt.  \n\nThanks in advance of any views or opinions.  ","url":"https://www.reddit.com/r/personalfinance/comments/1p67x1x/debt_repayment_question/","permalink":"/r/personalfinance/comments/1p67x1x/debt_repayment_question/","score":2,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764062025.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p66eks","name":"t3_1p66eks","subreddit":"personalfinance","author":"ThrowRaUsername08","title":"Should I save up for a car or start investing and building credit?","selftext":"I’m in a very privileged position, I know.\n\nI’m 19, still live with my parents and get rides to and from work everyday. I’ve been able to retain 80% of my paycheck just to savings with the other 20% going to setting up my secured credit card accounts and miscellaneous. \n\nI want a car so much in order to make my parents lives easier however, my parents keep repeating that they don’t mind since they feel bad they can’t afford to send me to college (I’m handling finances for college including Fasfa, residency papers, etc. on my own due to my parents refusing to sign any paperwork due to mistrust of the system). \n\nAnyways, Im in a blessed position where I can either choose to fund my car fund or invest in an alternative like a 401 k, a college plan fund (I forgot the name), an IRA (roth or trad), etc. (Honestly I know names but not overall value, also stat wise I got a 6% match with 401k at my job and that’s the only one I really know.\n\nI’m planning on increasing my income with another job or with overtime as well and continuing to budget either way though I know my grocery cost for Thanksgiving and then my Christmas list in general will be a bit rough but I’m trying.\n\nAnyways which path should I walk? My dad offered me to come onto their auto insurance plan as well but my mom is way more uncomfortable by this so it will take time to convince her before I get the car, plus I’m just now getting a credit card to earn enough stable credit to get a car.","url":"https://www.reddit.com/r/personalfinance/comments/1p66eks/should_i_save_up_for_a_car_or_start_investing_and/","permalink":"/r/personalfinance/comments/1p66eks/should_i_save_up_for_a_car_or_start_investing_and/","score":2,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764056112.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p627ys","name":"t3_1p627ys","subreddit":"personalfinance","author":"Rukkmeister","title":"529 Calculator/Strategy","selftext":"I know there are countless 529 posts, so apologies if I missed the exact answer to my question somewhere, but I promise I tried.\n\nI have two children with a third on the way. I've saved *pretty good* in the 529s for my children, but without too precise of a plan. I'm trying to fix that. I'd like to aim for 75-80% of tuition, room, and board for a 4 year degree at a public, in-state school. Easy enough to find an estimate for what that will be based on their age.\n\nWhat I'm now trying to do is figure out the most efficient approach to allocating my money. Say I have $600/month and a lump sum of $10k when I get my annual bonus. Is there an obvious most-efficient path to distributing that money? I screwed around with a couple of AI models, and at one point they convinced me it was best to fully focus on the oldest child, get them so they'd hit their target based on estimated market returns, then focus on the next oldest, and so on, but I'm not super confident in that. I had to correct enough stupid mistakes they were making that I've lost confidence in relying on their math.\n\nI've tried to find a calculator tool that would allow me to easily put in account balances, monthly contributions, lump sums, model turning off contributing when they hit a certain balance, etc. but everything is really basic...and I'm not smart enough to make my own.\n\n  \nAnybody have any go-to resources or wisdom when it comes to figuring out how to allocate money efficiently? Essentially, what requires the fewest principle dollars invested to meet the goals?","url":"https://www.reddit.com/r/personalfinance/comments/1p627ys/529_calculatorstrategy/","permalink":"/r/personalfinance/comments/1p627ys/529_calculatorstrategy/","score":2,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764041950.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6t97o","name":"t3_1p6t97o","subreddit":"personalfinance","author":"MexicanPlate","title":"Need help calculating paycheck","selftext":"How much of a pay cut would I be taking if I went from 80 hours (12:30pm-11:00pm on Sunday, M-W 9-7:30pm) to 72 (M-W 10:45am-11:15pm) making $35.98. There are a few differentials to consider: $3 for weekend day hours, $4 weekend and weekday hours after 2:45pm. I get paid biweekly. Married. Have one child. I have pretax deductions of $5400. TIA! ","url":"https://www.reddit.com/r/personalfinance/comments/1p6t97o/need_help_calculating_paycheck/","permalink":"/r/personalfinance/comments/1p6t97o/need_help_calculating_paycheck/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764116485.0,"edited":0.0,"link_flair_text":"Employment","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6rsj1","name":"t3_1p6rsj1","subreddit":"personalfinance","author":"Babayaga252","title":"RSUs Sell to Cover Tax Implications","selftext":"Hello,\n\nI am new to selling RSUs and I have read other posts on Reddit about this topic but still struggling with this.\n\nI was awarded 2600 shares which was worth $16 per share at the time. They vested and the share price at that time was $30. The company sold to cover taxes worth 650 shares at that $30 rate. In between the week of vest/sell to cover and sell the stock went it went to $45 in which I sold the remaining shares of 1950 at that rate. \n\nI did not want to wait a week but the company required it. \n\nFor context the rate I sold to cover at was 22% and will be taxed at 24% for me so I know I will owe money. I also know that since I sold basically a week after vest it will be ordinary income / short term capital gains. \n\nWhat I can’t wrap my head around is my tax implications considering the sell to cover my taxes was quite a bit lower than what I sold the remaining shares at a week ago.\n\nDoes someone have a simple calculation so I can put the pieces together?\n\nThanks ","url":"https://www.reddit.com/r/personalfinance/comments/1p6rsj1/rsus_sell_to_cover_tax_implications/","permalink":"/r/personalfinance/comments/1p6rsj1/rsus_sell_to_cover_tax_implications/","score":1,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764112653.0,"edited":0.0,"link_flair_text":"Taxes","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qdpb","name":"t3_1p6qdpb","subreddit":"personalfinance","author":"CaliRNforlife","title":"First time refinance","selftext":"I'm hoping someone can help me understand this. I am in the process of refinancing for the first time from 6.875 to 5.875 after about 1.5 years. Total fees are 5951. I am rolling majority of closing costs into then new loan and then paying some at closing for a new loan balance of 246,000. (current loan balance with Chase will be \\~241650 at time of closing) Estimated closing date is January 2nd, so I'm assuming I won't pay the current mortgage (Chase) in January and the interest will roll into the new loan. Since I am paying prepaid interest on the loan during closing, they say the next payment due date would be March 1st. Can I just continue to \"pay\" my mortgage Jan/Feb after closing as normal (assuming it would go towards the principal) and not \"wait\" so essentially paying back the closing costs that were rolled in? If that makes sense.","url":"https://www.reddit.com/r/personalfinance/comments/1p6qdpb/first_time_refinance/","permalink":"/r/personalfinance/comments/1p6qdpb/first_time_refinance/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764109135.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6pu3i","name":"t3_1p6pu3i","subreddit":"personalfinance","author":"PieRat343","title":"What should I do with my money?","selftext":"Hello guys.\n\nI currently have 1 credit card, 740-750 credit score depending on who you ask, and about 12k in my savings (like 9k in a 401k but I'm not touching that). I spend most of my checks but put around 100-200 into savings each check.\n\nMy question is what should I do to make my situation better? Should I get another credit card to help with my score, invest in the S&P, CDs, ect?\n\nAny advice would be greatly appreciated","url":"https://www.reddit.com/r/personalfinance/comments/1p6pu3i/what_should_i_do_with_my_money/","permalink":"/r/personalfinance/comments/1p6pu3i/what_should_i_do_with_my_money/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764107867.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6p0r9","name":"t3_1p6p0r9","subreddit":"personalfinance","author":"TehGuard","title":"Is it better to combine all my various 401ks and IRAS into one account?","selftext":"I have accounts from previous jobs with Voya, Fidelity and Principal. Is it a better idea to rollover all those into my current job one or have them all doing their own thing? ","url":"https://www.reddit.com/r/personalfinance/comments/1p6p0r9/is_it_better_to_combine_all_my_various_401ks_and/","permalink":"/r/personalfinance/comments/1p6p0r9/is_it_better_to_combine_all_my_various_401ks_and/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764105944.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6omc7","name":"t3_1p6omc7","subreddit":"personalfinance","author":"OhhhhhhhEldenRing","title":"Need Advice about allocating windfall to pay off debt or invest.","selftext":"I inherited about $1.05M in cash and 50% equity in a second home (I bought out from a sibling) about a year ago. Took the advice and did nothing with it for a year, put it all in a HYSA while I figure out what to do.\n\nMy current situation is - 33 years old, wife and 5 month old at home. My salary is $145k. I bring home after withholding and deductions about $7200/month.\n\nPrimary home - 3.125% interest rate, $240k remaining principle, estimated value ~$490k. Monthly expenses about $2300 with all mortgage. Taxes, insurance and utilities.\n\nSecondary property - 7.125% interest rate, $335k remaining principle, estimated value ~$700k. Monthly expenses are about $3500 with all mortgage, taxes, insurance, utilities and HOA.\n\nWife Student Loan Debt - 35k @ 5-7% rates. ($400/month payments).\n\nNo vehicle payments, \n\nDiscovery HYSA - 245k @ 3.4% APY\nWells Fargo HYSA - 796k @ 3.44% APY\nVanguard Simple IRA - $98k\nWife 401k - 11k\n\nBasically, I’ve been using the yield from the \nHYSA’s to pay for the second property, and because\nof this we haven’t really gained value in our cash accounts because of it.\n\nI was waiting to re-fi the mortgage on the second home to lower that payment since that has been the biggest expense. Contemplating using cash accounts to just buy the property outright. Also figuring it would be wise to pay off the student loan debt. \n\nWould like to park the money somewhere different than an HYSA and start to take advantage of tax deferred accounts (529, max IRA/401k etc).\n\nAny advice?","url":"https://www.reddit.com/r/personalfinance/comments/1p6omc7/need_advice_about_allocating_windfall_to_pay_off/","permalink":"/r/personalfinance/comments/1p6omc7/need_advice_about_allocating_windfall_to_pay_off/","score":2,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764105016.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6no5a","name":"t3_1p6no5a","subreddit":"personalfinance","author":"sassyclimbergirl","title":"Rollover IRAs - ok to invest 100% in FXIAX?","selftext":"Is there anything wrong with being 100% invested in FXIAX for my IRAs? I have both Roth and Rollover/traditional accounts. I'm in my mid-30s and ideally set & forget until I'm closer to retirement. For clarity, I am already invested - 71% in FXIAX, 29% in other large cap & target funds...just checking that this isn't an unreasonable position for a longer term.","url":"https://www.reddit.com/r/personalfinance/comments/1p6no5a/rollover_iras_ok_to_invest_100_in_fxiax/","permalink":"/r/personalfinance/comments/1p6no5a/rollover_iras_ok_to_invest_100_in_fxiax/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764102883.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nku0","name":"t3_1p6nku0","subreddit":"personalfinance","author":"wanderingman365","title":"Advice for best way to contribute to savings.","selftext":"Hi all, curious what different people's opinion is on how to view my savings. I know the general rule of thumb is you should aim for 15% of your income to go towards savings. Should this all be retirement contributions or should it be a mix between retirement and cash savings? My wife and I contribute 10% of our income to Roth 401k (we get an additional 2.5% match), an additional 5% to our HSA, which we intend to use like a retirement account. We also allocate a set % of money to different categories each year that we know we will likely spend on, but year-to-year may have some left over. This list is below:\n\nEmergency Fund: 3 month fund established, no longer contributing more.\n\nCar Maintenance (oil changes, repair, annual registration fees): 3% of take home pay\n\nVacation: 3.5% of take home pay\n\nPet (vet, boarding, meds): 2% of take home pay\n\nGifts (birthdays, holidays, etc): 2.5% of take home pay\n\nThis year, for example, we used 2/3rds of our car maintenance pool, all of our vacation, all of our pet, and about 2/3rds of our gift pool. \n\nWhen we break down the extra cash we have after monthly expenses, we save on average in cash about 2.5% of our take home pay. Any thoughts on this? Any kind advice is welcome. My Wife and I are trying to plan best for our future, while also managing our day to day. Thanks! ","url":"https://www.reddit.com/r/personalfinance/comments/1p6nku0/advice_for_best_way_to_contribute_to_savings/","permalink":"/r/personalfinance/comments/1p6nku0/advice_for_best_way_to_contribute_to_savings/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764102668.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6n7rf","name":"t3_1p6n7rf","subreddit":"personalfinance","author":"Alven92","title":"Should I go for a 5/1 ARM or a 30 Year Fixed Loan?","selftext":"I'm in the process of buying my first home so I'm fairly new to mortgages and the process. I have been doing a lot of research and shopping around for mortgages and I'm now considering either a 30 year 5/1 ARM or a 30 year fixed rate.\n\n  \n\n\nBelow are the numbers:\n\nHouse price: $515,000\n\nDown Payment: 20% ($103,000)\n\nSeller Concessions: $10k for closing cost\n\nHOI: $4,300/year\n\nProperty Taxes: $750/month \n\nHOA: $125/month\n\nWife's and my credit is around 680 - 700\n\n  \nThe house is a 4/2. The first 2-3 years my wife and I will rent 2 rooms to my brother and my brother in law at $850 each. This rent money will go to our savings\n\n  \nOption 1:\n\n30 Year Fixed \n\nRate: 6.7% (could go lower with if purchasing points)\n\nEstimated monthly payment (with HOA, HOI and taxes): $3,900/month\n\n  \nOption 2:\n\n30 Year - 5/1 ARM\n\nInitial rate: 5.25%\n\nEstimated Monthly Payment (with HOA, HOI and taxes): $3,500/month\n\n  \nI understand that with the 5/1 ARM only the first 5 years I would have a lower rate, then, at year 6 the rate would be adjusted. I could refinance before that happens, but there's always a risk that rates might actually be higher and my monthly payments increase.\n\nWith a 30 year fixed, I could refinance at any point if the rates go lower. If the rates increase then my rate would not change.\n\nThe difference between the options is around $400 per month. This would be the case for 60 months so If put this amount in savings I would be looking at +$24,000 at the end of year 5. \n\nOn one hand I do like the idea of a lower monthly payment, but the on other hand I'm a little afraid of what the market is going to be in 5 year.\n\nAppreciate opinions and suggestions. Thanks!","url":"https://www.reddit.com/r/personalfinance/comments/1p6n7rf/should_i_go_for_a_51_arm_or_a_30_year_fixed_loan/","permalink":"/r/personalfinance/comments/1p6n7rf/should_i_go_for_a_51_arm_or_a_30_year_fixed_loan/","score":1,"num_comments":16,"over_18":false,"stickied":false,"created_utc":1764101844.0,"edited":1764104706.0,"link_flair_text":"Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mnub","name":"t3_1p6mnub","subreddit":"personalfinance","author":"swthsth","title":"HSA vs OAP plan choice","selftext":"I feel like the answer for what I should pick here is obvious, but I’m still doubting my literacy on these things. For the HSA, I am fortunate to say I could cover my medical costs out of pocket and still max out my contributions, but all the same, is it really worth it with the higher premium? My yearly medical costs are about $500 for visits alone, then prescriptions and lab work would add a lot more on top (a lot, in the case of prescriptions). I have yet to hit the deductible though.\n\nOAP\n- $0 premium\n- In network coverage only\n- $2500 deductible\n- $5k OOP max\n- Prescriptions coverage isn’t dependent on the deductible  \n- $500 FSA contribution from employer \n\nHSA\n- $1370 annual premium\n- $500 employer contribution\n- $2500 deductible\n- $5k OOP max\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6mnub/hsa_vs_oap_plan_choice/","permalink":"/r/personalfinance/comments/1p6mnub/hsa_vs_oap_plan_choice/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764100593.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mhuo","name":"t3_1p6mhuo","subreddit":"personalfinance","author":"Initial_Yoghurt1524","title":"Very confused on what to do for 401k, please help!","selftext":"I am switching to a new job but I do not like my new company's 401k (weird platform and no matching), so I have a few questions:\n\n1. How long can I keep my old companys 401k, or do I have to transfer it to a traditional IRA? in that case, how does that impact my roth IRA?\n2. If I don't do my new company's 401k, I am thinking of throwing post tax money into a traditional IRA to keep investing in my retirement, but i don't get the pre tax benefits anymore.\n3. I am also worried about the \"pro rata rule\" for backdoors, how do I prevent it if I roll my 401k into a traditional IRA?\n\nWould like any advice from someone that has gone through this, thank you!","url":"https://www.reddit.com/r/personalfinance/comments/1p6mhuo/very_confused_on_what_to_do_for_401k_please_help/","permalink":"/r/personalfinance/comments/1p6mhuo/very_confused_on_what_to_do_for_401k_please_help/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764100222.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6m1vs","name":"t3_1p6m1vs","subreddit":"personalfinance","author":"DimensionNo8738","title":"Newtek personal savings closed same day as approved?","selftext":"I opened a newtek personal savings this morning hoping to take advantage of their advertised 4.35% APY.\n\nI went through getting everything set up which took around an hour linking accounts, emails, phones numbers, texting, apps etc, even did a initial tiny deposit to assure they were legit and see how long they take to perform transactions.\n\nAround 2 hours later, I got an email stating there was a secure message that I needed to login to see. So I tried to login and they gave an error stating access was denied and that I needed to call them.. So I wasted another 25 minutes holding on the phone(first minute I called I was told I was #1 in line), only to then hear they were too busy and that they wanted me to instead leave a voicemail!!! So I hung up and instead did the chat with voice option which got me a human who didn't know what was going on.\n\nHe eventually whispered to someone else(I could also very loud hear another employee loudly talking to another customer) and I was eventually asked me to email him 2 forms of ID plus my insurance for my car to prove my address. 2 hours later he called me back saying they are canceling my account and they won't tell me why.\n\n\\*Is this the norm for them, any of you experience this? I feel data harvested. \n\n\\*Is it possibly because my initial deposit was only $5.00 to test the account out?\n\n\\*Any better similar APY savings account options out here?","url":"https://www.reddit.com/r/personalfinance/comments/1p6m1vs/newtek_personal_savings_closed_same_day_as/","permalink":"/r/personalfinance/comments/1p6m1vs/newtek_personal_savings_closed_same_day_as/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764099246.0,"edited":1764099456.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lvvm","name":"t3_1p6lvvm","subreddit":"personalfinance","author":"RustyCastIron","title":"Advice on selling stock to cover losses","selftext":"I finally sold and realized losses from bad stock investments from years ago that have held onto. ~26k roughly of realized losses. I just wanted to get the red out of my portfolio and slowly start over.\n\nI have about ~18k in positive gains from NVDA, GOOD, UNH, AAPL, VTI. Should I sell these to offset the losses? Where do I begin or writing off on losses, do I hold those and use future gains to offset them?\n\nSorry if I am not the clearest but and trying to figure out how to go about this. Should I consult with a financial planner? Any recommendations are greatly appreciated later.","url":"https://www.reddit.com/r/personalfinance/comments/1p6lvvm/advice_on_selling_stock_to_cover_losses/","permalink":"/r/personalfinance/comments/1p6lvvm/advice_on_selling_stock_to_cover_losses/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764098876.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ltas","name":"t3_1p6ltas","subreddit":"personalfinance","author":"LevelEvening980","title":"What do I do with 24k at 19 years old?","selftext":"I’m 19 and have virtually no understanding of investing, retirement accounts, 401k, taxes, etc. But I do know I'd like to do something with the money I have other than letting it sit in my savings. \n\nI am a full time student and making $31/hour working full time as an EMT. After my bachelors I plan to go to medic school (1 year CC) and will be making ~$90,000 as a medic. I'm considering medical school, but still waiting to see how undergrad goes. \n\n- I have $24k in savings from my job\n- Won’t be graduating with student loan debt \n- Reliable car with no car loan \n- No other debt or loans\n- 752 credit score \n- Will have ~20k leftover in a 529 education account upon finishing bachelors and CC\n- Live in a lower cost of living/ more rural area in Michigan \n\nMy only current expenses are rent and food. Other expenses such as health insurance, auto repairs, and my phone bill will be provided until I am 21/ out of college. I’m estimating I will continue to save a total of $40k over the next two years, but I'm okay with being frugal to save more. \n\nI was wondering what I should do with the money I currently have and the money I estimate to save. I’d like to have as much as possible by age 25 for either a down payment on a house or to put towards medical school if I decide to go. I’ve heard you can roll over remaining 529 funds to a Roth IRA, but I’m not sure what it is other than it being a retirement account. \n\nLooking for any suggestions, thanks! :) ","url":"https://www.reddit.com/r/personalfinance/comments/1p6ltas/what_do_i_do_with_24k_at_19_years_old/","permalink":"/r/personalfinance/comments/1p6ltas/what_do_i_do_with_24k_at_19_years_old/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764098709.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6loij","name":"t3_1p6loij","subreddit":"personalfinance","author":"Technical_Ask_7088","title":"Hospital Bill Never Arrived (Self Pay)","selftext":"Hello! Could use some advice. \n\nIn Oklahoma and in August, I got into an electric scooter accident and went to the near by emergency clinic (not a full hospital or urgent care). I just had started a new job and didn’t have insurance as I’d been laid off from the previous one. My parents elected for self pay and entered my new address and all my info to my knowledge (I was pretty banged up and not capable of filling the paperwork out). They also gave them my old insurance card to try to run, in which they had said I wasn’t covered anymore. \n\nMy parents havent received a bill and I haven’t either (I live out of state). I’m starting to worry that they did try to bill my old insurance and that got sent to my prior Oklahoma address, so I never received the bill. To my knowledge, if they did send it, even if it’s the wrong address, I’m still on the hook. There’s no patient portal for this ER clinic and I have no way of accessing my old insurance information I don’t think (that portal is now connected to my new insurance with my new job as they used the same company). \n\nI need to keep my credit solid as my wife works on hers and I’m paranoid that this is going to show up in collections and on my credit, but I also don’t want to be an idiot and call the hospital to ask about the bill if an error happened and they lost the bill or something. \n\nAll advice is appreciated. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6loij/hospital_bill_never_arrived_self_pay/","permalink":"/r/personalfinance/comments/1p6loij/hospital_bill_never_arrived_self_pay/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764098414.0,"edited":0.0,"link_flair_text":"Insurance","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kwck","name":"t3_1p6kwck","subreddit":"personalfinance","author":"Dysfunctional_Waffle","title":"What to do with my 401k Loan","selftext":"In 2022, I [M32] took out a loan on my 401k to help put down money on my first home. Payments get auto deducted from every other paycheck at around $135.\n\n401k: ~$162k\n\nLoan details:\nOriginal amount: $31k\nInterest Rate: 3.25%\nOutstanding amount: $28.6k\nRemaining payments: 317\nPayment: $135 monthly - I can't easily change my payment amount as it was calculated at the time of taking the loan. At least that's what fidelity says. I haven't looked into this much.\n\nMy question is this, I'm concerned about the state of the economy and potentially losing my job. From what I understand if this were to happen, I'd need to pay off the remaining amount immediately but I'm not sure about this or if I could roll over existing situation to potential new employer?\n\nAlso I have a few other pieces of debt, student debt (280/month) and car payment (shared with my partner 800/month).\n\nShould I lose my job, what should I do? Should I take out a personal loan to pay my 401k back, should I take all my money out of my Roth IRA (~$29k) to pay it off, this feels like no so I keep compounding my investment. Should I really just be focusing every extra dollar at paying this off now instead of later?","url":"https://www.reddit.com/r/personalfinance/comments/1p6kwck/what_to_do_with_my_401k_loan/","permalink":"/r/personalfinance/comments/1p6kwck/what_to_do_with_my_401k_loan/","score":1,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764096722.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ksjc","name":"t3_1p6ksjc","subreddit":"personalfinance","author":"TedMosby11","title":"HELOC VS Home Equity Loan?","selftext":"I own a condo in NJ with about 123K left to pay and the condo is valued somewhere between 160-180K.  I have some credit card debt I would like to pay off and some small home improvement projects I would like to do but obviously, don't want to put it on a credit card. All in, would need under 10K ( about 3K of credit card and 7K of improvements).  Which is better in a situation like this? \n\nJust some more info - Credit score over 800. Have student loan and car loan (both about 5K) but both of there interest rates are about 4 percent so will just leave them be. \n\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6ksjc/heloc_vs_home_equity_loan/","permalink":"/r/personalfinance/comments/1p6ksjc/heloc_vs_home_equity_loan/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764096502.0,"edited":0.0,"link_flair_text":"Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6krnw","name":"t3_1p6krnw","subreddit":"personalfinance","author":"kg20028","title":"23 y.o. In the US. Student loans, Car, Home DP, Emergency Fund, and Travel. Truly ambitious but, confused. Need elderly and wise guidance in moving forward. How should I structure $$$.","selftext":"Hey Redditors, \n\nI’m 23, and I’ve just started my corporate life in the US. I’m part of the same rat race now, but I’m trying to run in the right direction instead of sprinting blindly. I clearly know I’ve got a lot more buckets at once, or maybe not.. but I would want to do them all. I also realize I need some clarity before sprinting (don’t want to run blindly). I need clarity, some guidance, brutal feedback, and honest critique, and all and above, a help to your brother here! \n\nHere’s some information about me:\n\n* My monthly take home post tax, is a little over $7K USD (\\~7.5K)\n* Rent + Utilities + Basic Living is a little around $2K\n* Groceries, food, monthly subs: $500 - $700\n* Student loans: I pay a $1000 USD. (My monthly minimum is about 800USD. Balances: \\~$82K overall at 5–9%)\n* I’ve got a personal debt of $5.5K USD, and I want to clear it by end of this year (2025). I’m hoping I can. \n* I pay my cards in full, FICO 747 (Capital one car with 2.2K Credit line), CreditKarma says I’ve got a score of \\~695. Need a new credit card. A little higher credit line, plz! Chase SP? AmEx's Delta Car?? \n* I don’t have a car yet. I walk to my office, and it’s hybrid too. And I feel I need a car by early 2026. I need some sort of transport.\n\n\\----\n\n**TL;DR**\n\n23M in US, \\~$7K/mo take home. Want to:\n\n* Clear $5K personal debt\n* Save $50K for India house DP\n* Build $20K emergency fund\n* Save \\~$5K car down payment\n* Travel to India twice a year\n* Manage $82K student loans\n* Keep life comfortable\n\nNeed help prioritizing and structuring buckets so I’m not sinking under all of this.\n\nThanks in advance.. I genuinely want to fix this stuff now rather than 5 years too late.\n\n\\----\n\n**My Goals**:\n\n**Home in India.**\n\n* Thinking a **₹4 Cr (\\~$450K)** property. A 10% DP = **₹40–50L (≈$50–60K)**.\n* If all goes well, I thgink I can hit this by early 2027.\n\n**Emegency Fund**. *(I want to have* ***6 months of rainy day savings***\\*, for whatever reasons’)\\*\n\n* I want to target $20K (tier wise building over time, at the earliest. 5K, 10K… 20K)\n\n**Car.**\n\n* Budget = **<$20K,** DP = **$5K**\n* Insurance (new driver): probably **$300–400/mo** in Atlanta — not sure.\n\n**Travel.**\n\n* I want to travel to India, twice a year. Round trip + spending is about $3K–$5K per trip. \\[*Putting higher ceiling values.*\\]\n\n**Lifestyle**\n\n* Not fancy. Just want space to buy a fragrance, clothes, small stuff without guilt.\n\n\\------\n\nQuick questions that I go to bed with:\n\n1. How do I split this \\~$7K USD across all these buckets without drowning? \n2. What’s the right order of priority? I need a car, yes.. but I also need to save up for the Home’s DP, but what about Personal Emergency Savings!? \n3. I don’t find these HSYA’s any useful, any way I could do something extra on the side, as a hustle to get some extra cash flow? But I’d need a car to get to that place, and maybe work post 5PM? \n4. Is it worth moving from my Federal Student Loan (FAFSA) to another lender for a lower interest rate? Cuz, what specific benefit am I getting by paying a higher interest rate? 9%? Crap! I know there’s some federal something to do with by paying loans? Don’t know this as well. Need guidance. Not sure whom to ask. \n5. How do I optimize my credit card, credit score? \n6. Any better way to handle the $85K USD Loan?\n7. Side hustle for extra $1K-2K/mo?\n\nI don’t know, guys!… I just don’t know. I know I’m taking a lot.. but, any opinions, critiques, harsh truths, guidance, tips? Just throw it at me. I’ll take it even if it’s salty. Just would want to make conscious decision planning whatever it is. I want to build a solid financial base, knowledge, early. Help my family? More like support them, when needed. And mainly not feel broke while doing it. Don’t want to make dumb decisions. \n\nThanks for reading it till here.. hoping to learn from you guys.. means a lot to me!\n\nPeace ✌🏻","url":"https://www.reddit.com/r/personalfinance/comments/1p6krnw/23_yo_in_the_us_student_loans_car_home_dp/","permalink":"/r/personalfinance/comments/1p6krnw/23_yo_in_the_us_student_loans_car_home_dp/","score":1,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764096451.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kng7","name":"t3_1p6kng7","subreddit":"personalfinance","author":"FieldTiny9542","title":"I invest €300/month in VWCE + €100/month in the Romanian stock market (BVB), but I don’t fully trust the market. Am I overthinking?","selftext":"Hey everyone,  \nI recently started investing around €300/month in VWCE and another €100/month in the Romanian stock market (BVB). I could actually invest €200 more monthly, but honestly… I don’t fully trust the stock market.\n\nIt feels like *everybody* is investing nowadays and, low-key, it feels a bit fishy to me. Maybe it’s just my anxiety, maybe I’m seeing too many “just buy ETFs bro” posts. I know that long-term the markets usually go up, but emotionally it still feels kind of hard to trust.\n\n  \nSo I wanted to ask: **what are the real pros and cons of investing in ETFs like VWCE?** Not the motivational stuff, but the actual risks and downsides besides “markets go down sometimes\"... \n\nAnd also, what alternatives do you guys use to put your money to work?  \nReal estate? Bonds? Small business? Something else?\n\n!! I’m not looking for moonshots or crypto gambling — just realistic options for someone who wants to grow their money but doesn’t want to rely 100% only on the stock market.  \n","url":"https://www.reddit.com/r/personalfinance/comments/1p6kng7/i_invest_300month_in_vwce_100month_in_the/","permalink":"/r/personalfinance/comments/1p6kng7/i_invest_300month_in_vwce_100month_in_the/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764096193.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6k5al","name":"t3_1p6k5al","subreddit":"personalfinance","author":"lethallenn","title":"Renting an apartment with a low credit score","selftext":"Hi all! I am 29 years old and applying for an apartment on my own for the first time. I should preface by saying that, for safety reasons, I need to move out of my current living situation as soon as possible. The main issue is my credit. Unfortunately, I missed that student loan repayments were restarting after the pandemic forbearance, and it sent my credit down by over 150 points, from 700+ to, based on the worst report, 546. These are the only late payments I've ever made to anything in my life, and the accounts are all up to date and I've been making regular payments since.\n\nI did some research and called Aidvantage, who said they couldn't help. My next step is to plead my case to the credit bureaus. But as someone who has no financial education beyond what I've taught myself, I just want someone to give me a realistic, knowledgable perspective on the situation and what I can do moving forward. Basically: how screwed am I, and what can I do to mitigate the effects of this? Thanks!\n\n  \nEDIT: Note that my next step being reaching out to the credit bureaus is based on a) what Aidvantage told me to do and b) what I've seen other people online have some success with. I don't really have any knowledge about this, I'm just doing what I was told might work, so if anyone has insight on this part of the process please include it! You all are greatly appreciated!","url":"https://www.reddit.com/r/personalfinance/comments/1p6k5al/renting_an_apartment_with_a_low_credit_score/","permalink":"/r/personalfinance/comments/1p6k5al/renting_an_apartment_with_a_low_credit_score/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764095072.0,"edited":1764095494.0,"link_flair_text":"Credit","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6jdl5","name":"t3_1p6jdl5","subreddit":"personalfinance","author":"Tuuuuuurow","title":"Looking for advice on brokerage accounts","selftext":"I have a 403b plan with TIAA from working at a school for a few years. I have been trying to research what I can do with the money in the account. \n-Could I convert that 403b account into a Roth IRA? \n-What taxes would I need to pay upfront when converting my 403b to a IRA\n-Is Traditjonal or Roth IRA better for my situation\n-Should I transfer to my current employers account?\nMy new employer has a profit sharing plan\n- What are the benefits of this type of plan?\n-Any tips or tricks for profit sharing plans? \n\n\nAny other advice is welcomed, Thanks. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6jdl5/looking_for_advice_on_brokerage_accounts/","permalink":"/r/personalfinance/comments/1p6jdl5/looking_for_advice_on_brokerage_accounts/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764093427.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6iui8","name":"t3_1p6iui8","subreddit":"personalfinance","author":"usagiftseveryday","title":"Should my work keep this 401k?","selftext":"Hi,\n\nI need help from some educated people on 401k’s. This is my current workplaces offerings:\n\nhttps://imgur.com/oorNGnj\n\n I brought to their attention that these fees seem extremely high (around 1.5%). My boss then talked with our provider who explained that these are still good fees because they are exclusive, are being paid for on the front end, and have a really good rate of return. I’m not specifically knowledgeable enough to accuracy check all of this. \n\nPlease explain, in mildly layman’s terms if/why these funds are not good/why another provider would be better so that I can help communicate if we should switch providers. \n\nI should also mention my workplace is very small with around 10 full time staff so if that is a factor please keep that in mind! \n\nThank you so so much in advance for any advice. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6iui8/should_my_work_keep_this_401k/","permalink":"/r/personalfinance/comments/1p6iui8/should_my_work_keep_this_401k/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764092254.0,"edited":1764092770.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i6q7","name":"t3_1p6i6q7","subreddit":"personalfinance","author":"Prestigious_Golf1234","title":"Need Advice- Car Related","selftext":"Around tax time last year I was super desperate to get a car, after having a repo a couple years ago, I was paying a friend $500/mo to rent a car. I got a 2014 Toyota Camry, that is, as of today, estimated to be worth $3,000-$4,000. I pay $420/mo for my car. Looking at my account, it says I have a balance of $10,702, but my payoff amount is $8,906 (Can someone explain this to me please. I am assuming the $10k is what my balance is after interest?) Besides the high mileage & now possible transmission issues, I got this car in perfect condition. I've only had to do brakes & oil changes so far. The possible transmission issues are the fact that my car is now stalling & stuttering, & slightly vibrating when I accelerate & drive sometimes. No engine lights, doesn't stop randomly, doesn't start up weird, always turns on. It doesn't do it all the time, but 85% of the time. I got my transmission flushed & that helped slightly, but the issue is still there. I went to my bank & got approved for a $2,000 loan for the repair. I'm supposed to take it in for a transmission diagnostic in a couple of weeks, so I'll know exactly what it will cost me then. What would be the smartest thing to do in this situation? I'm open to any & ask advice & criticism. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6i6q7/need_advice_car_related/","permalink":"/r/personalfinance/comments/1p6i6q7/need_advice_car_related/","score":1,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764090799.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ge1f","name":"t3_1p6ge1f","subreddit":"personalfinance","author":"BlueMorphoCHC","title":"Recommendations for teen checking account","selftext":"Looking into opening a checking account for my teenage son.  Nerd Wallet has some recommendations, including Capital One teen checking.  I am considering this one because he would be able to deposit cash and checks to it (the online only banking ones don’t allow deposited cash).  Any experience pro/con to consider this one over other fan favorites?  Including parental controls use restrictions etc?  Thank you ","url":"https://www.reddit.com/r/personalfinance/comments/1p6ge1f/recommendations_for_teen_checking_account/","permalink":"/r/personalfinance/comments/1p6ge1f/recommendations_for_teen_checking_account/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764086831.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fixg","name":"t3_1p6fixg","subreddit":"personalfinance","author":"sayrawr13","title":"utility bill question","selftext":"I'm not really sure where to ask so I apologize if this isn't the right place.\n\nI pay my xcel bill through Arcadia automatically every month. It's nice becuase I don't have to worry about forgetting it.  \nBut I just was charged more than I normally pay. At least 2x the amount.\n\nWhen I asked what the increase was for they said it was for missed statements going as far back as December 2024. Which means they missed it.\n\nCan I dispute this or am I just screwed?","url":"https://www.reddit.com/r/personalfinance/comments/1p6fixg/utility_bill_question/","permalink":"/r/personalfinance/comments/1p6fixg/utility_bill_question/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764084901.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6dahe","name":"t3_1p6dahe","subreddit":"personalfinance","author":"Equivalent-Way7745","title":"SP500 or investment property?","selftext":"How do I determine what makes the most sense? SP500 or real estate investment? I currently have 1 investment property where rent fully covers expenses.\n\nI have an extra $180K in the stock market. How do I determine what makes most sense - Leave the money on the stock market (more compounding growth) or take $100K and put it down 25% on a $400K rental (diversification/later term cash flow)\n\nNot sure if I should look at overall breakeven? Or estimate total value in X years?\n\nAlso note I prefer 15 yr mortgages for lower overall interest.\n\nI live in low to moderate cost of living area. Primary goal is long term wealth for early retirement. Currently 31.","url":"https://www.reddit.com/r/personalfinance/comments/1p6dahe/sp500_or_investment_property/","permalink":"/r/personalfinance/comments/1p6dahe/sp500_or_investment_property/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764079557.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6cu65","name":"t3_1p6cu65","subreddit":"personalfinance","author":"BackdoorDan","title":"(US) Question about tax liability for options and RSUs after company IPOd","selftext":"Hi all, my wife worked for a company that gave her stock options AND RSUs. She left the company before the IPO but still kept her equity.\n\nThey IPO'd this year which led her to exercise her options.\n\nWe still haven't sold the stock from the option exercise nor have we sold the RSUs.\n\nI am trying to figure out what our MAGI is to see if we can contribute to a roth IRA but I don't know if the stock options she exercised or RSUs count as taxable income as a result of the IPO.","url":"https://www.reddit.com/r/personalfinance/comments/1p6cu65/us_question_about_tax_liability_for_options_and/","permalink":"/r/personalfinance/comments/1p6cu65/us_question_about_tax_liability_for_options_and/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764078384.0,"edited":0.0,"link_flair_text":"Taxes","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65xx3","name":"t3_1p65xx3","subreddit":"personalfinance","author":"Electronic_Toe8131","title":"How Can I Improve My CIBIL Score After Loan & Credit Card Settlements?","selftext":"I have settled my credit cards and a few app-based loans this year due to high financial pressure. I understand that loan and credit card settlements can seriously damage my CIBIL score. Could someone please let me know if there’s any way to improve my CIBIL score going forward? Also, are there still chances of getting loans in the future after settlements?","url":"https://www.reddit.com/r/personalfinance/comments/1p65xx3/how_can_i_improve_my_cibil_score_after_loan/","permalink":"/r/personalfinance/comments/1p65xx3/how_can_i_improve_my_cibil_score_after_loan/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764054344.0,"edited":0.0,"link_flair_text":"Credit","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64r3e","name":"t3_1p64r3e","subreddit":"personalfinance","author":"FastDragonfruits","title":"Retirement Advice and is there any real difference to investing money for retirement into Robinhood Roth IRA vs Fidelity Roth IRA?","selftext":"As I learn more about making good financial decisions I understand saving/investing into retirement is very important and have been wanting to get my parents to start investing money into a retirement account.\n\nFor some quick background, parents came from a country where government retirement benefits are enough to live your life out easily(ish) enough, so when they immigrated to the U.S there was no plan for saving or investing into retirement, and they did not know English and have not realized they needed to invest money for retirement etc.\n\nIn short, parents have basically $0 in retirement and they are \\~55 years old.\n\nI wanted to open a Roth IRA account for them and get them to invest at least 10% of what they make to at least have a tiny bit of extra money (any bit helps) by the time they need to retire. For some reason Fidelity cannot verify their identity and I am not able to create an account. Robinhood had no issues in making an account for me.\n\nWould it be fine to just have them invest into a Robinhood Roth IRA index fund and call it a day, or would there be a real good reason to drive to a Fidelity office with them to apply in person instead?\n\nAlso would appreciate any other financial advice regarding my parents retirement. We do not own any property or house and live in rent, and once I finish college and move out they will likely stay in the same apartment. My dad is the main provider and will keep working until he is forced/completely unable to work anymore, but I worry about what would happen if he would not be able to anymore. Mom works part time and raises my siblings, the pay helps a lot but not enough to pay off rent on her own if anything happens, and likely plans on working as long as she will be able to as well.\n\nWe live Portland OR. Would convincing them to buy one of those very cheap tiny homes be worth it? From a quick look those seem to have you pay really high HOA fees (almost 1,000/moth), so it seems when they retire they would need to deal with rent payments anyways if they get the cheap tiny home/trailer home (not sure what those are called exactly).","url":"https://www.reddit.com/r/personalfinance/comments/1p64r3e/retirement_advice_and_is_there_any_real/","permalink":"/r/personalfinance/comments/1p64r3e/retirement_advice_and_is_there_any_real/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764050086.0,"edited":1764050562.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p64pol","name":"t3_1p64pol","subreddit":"personalfinance","author":"mserforfun","title":"Long-term line of credit and inactivity","selftext":"Hi.  I've seen this happen so many times to my buddies where they get laid off and without a steady income, a line of credit was impossible to get approved.  I am thinking of getting one in the event (god forbid) I get laid off too but obviously may end up not using it at all.\n\nI am not familiar with lines of credit and was wondering if there are inactivity fees and was also wondering if the bank will require income verification frequently?  ","url":"https://www.reddit.com/r/personalfinance/comments/1p64pol/longterm_line_of_credit_and_inactivity/","permalink":"/r/personalfinance/comments/1p64pol/longterm_line_of_credit_and_inactivity/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764049951.0,"edited":0.0,"link_flair_text":"Credit","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p62oz9","name":"t3_1p62oz9","subreddit":"personalfinance","author":"uglysenpai","title":"ELI5 using the VA Loan as a first time home buyer","selftext":"Hi reddit!\n\n  \nI am separating from the Air Force in December and lined up a job that will comfortably allow me to purchase a home. My friends have explained how their realtor/lenders helped them use their VA Loan but never really explained it well. Even using the internet just leads me to websites that give zero explanation but attempt to make me sign up to get lender's to \"explain.\"\n\n  \nCan someone explain how leveraging your VA loan helps purchasing a home in simple terms. Thank you!","url":"https://www.reddit.com/r/personalfinance/comments/1p62oz9/eli5_using_the_va_loan_as_a_first_time_home_buyer/","permalink":"/r/personalfinance/comments/1p62oz9/eli5_using_the_va_loan_as_a_first_time_home_buyer/","score":1,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764043366.0,"edited":0.0,"link_flair_text":"Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61zg7","name":"t3_1p61zg7","subreddit":"personalfinance","author":"Ok_Surprise2740","title":"Advice on applying for new credit card while waiting for loan assumption approval - with Template","selftext":"","url":"/r/CreditCards/comments/1p61wel/advice_on_applying_for_new_credit_card_while/","permalink":"/r/personalfinance/comments/1p61zg7/advice_on_applying_for_new_credit_card_while/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764041254.0,"edited":0.0,"link_flair_text":"Credit","is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p61o9k","name":"t3_1p61o9k","subreddit":"personalfinance","author":"Hot-Sherbert9301","title":"True Accord questions","selftext":"Hi, so I’m a bit new to all this credit stuff, I’m in my early twenties and just got my very first personally owned car and what not, I got a call last Tuesday from trueaccord they left me a voicemail but didn’t specify what it was about just told me their business hours and the ladies name. Should I potentially be worried about this? I don’t have any outstanding debts and all my bills get paid, and for being as young as I am my credit is actually amazing cause my mom helped me work hard on building my credit when I turned eighteen. So I just don’t know if I need to be worried. ","url":"https://www.reddit.com/r/personalfinance/comments/1p61o9k/true_accord_questions/","permalink":"/r/personalfinance/comments/1p61o9k/true_accord_questions/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764040339.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zzo8","name":"t3_1p5zzo8","subreddit":"personalfinance","author":"gold_and_diamond","title":"Question on COBRA timing","selftext":"","url":"/r/Insurance/comments/1p5zz7u/question_on_cobra_timing/","permalink":"/r/personalfinance/comments/1p5zzo8/question_on_cobra_timing/","score":1,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764035548.0,"edited":0.0,"link_flair_text":"Insurance","is_self":false,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zlns","name":"t3_1p5zlns","subreddit":"personalfinance","author":"gynecomastiasuckler","title":"Am I spending too much?","selftext":"I am a college student on a full ride. I have all of my needs (housing and meal plans) covered. I make anywhere from 700 to 1600 a month from part time jobs. I average around 500 dollars of spending money on my wants category every month. I always beat myself up for getting that protein bar or that coffee afterwards, but at the end of the month when I look at my spreadsheet I feel like I'm not spending that much. \n\nShould I try to cut these bad habits out or should I cut myself some slack?","url":"https://www.reddit.com/r/personalfinance/comments/1p5zlns/am_i_spending_too_much/","permalink":"/r/personalfinance/comments/1p5zlns/am_i_spending_too_much/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764034451.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6tkv4","name":"t3_1p6tkv4","subreddit":"personalfinance","author":"junkbomber","title":"Should I contribute to my Roth and 401k at the same time?","selftext":"I'm aiming to put 20% of my income towards retirement each paycheck. Should I contribute the full 20% into my Roth until I max it out and then move to the 401k (I don't get match)? Or should I split the Roth evenly throughout the year with each paycheck and then attribute the remainder of the 20% into my 401k, making it so I'm paying into both throughout the year?\n\nEdit for clarity:\nI contribute to a Traditional 401k and a Roth IRA.","url":"https://www.reddit.com/r/personalfinance/comments/1p6tkv4/should_i_contribute_to_my_roth_and_401k_at_the/","permalink":"/r/personalfinance/comments/1p6tkv4/should_i_contribute_to_my_roth_and_401k_at_the/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764117356.0,"edited":1764118184.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ryxy","name":"t3_1p6ryxy","subreddit":"personalfinance","author":"JD_Vishnu","title":"How much cash should I be holding if unemployed?","selftext":"I'm 35(m) and have been out of a full time job with benefits for about a year now. In the meantime, I have only had a part time temp job over the Summer. I do not know when I will be able to get another full time job with benefits.\n\n I am worried because I keep seeing reports and stories about how poorly the US economy is doing. The impending collapse of AI, the housing market, inflation, poor job reports. I am really worried. I'm thinking maybe I have too much in equities and not enough cash. I was hoping someone knowledgeable could give me some advice. \n\nI have 40k in a 401k, 42k in a money market account, 106,000 in a Roth IRA (VGT, and VOO) , 275,000k in a brokerage (VGT, VOO, NVIDIA), and 64,000 of Gold, and maybe 7k in emergency fund.\n\nMy total monthly expenses are about 3,000 a month.\n\nDo I have enough cash for someone who is unemployed and unsure about my employment future? Are my equities too risky?\n\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6ryxy/how_much_cash_should_i_be_holding_if_unemployed/","permalink":"/r/personalfinance/comments/1p6ryxy/how_much_cash_should_i_be_holding_if_unemployed/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764113101.0,"edited":0.0,"link_flair_text":"Employment","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ru56","name":"t3_1p6ru56","subreddit":"personalfinance","author":"kissingfish","title":"Chances of Loan Approval","selftext":"Good afternoon! I have the opportunity to live on a lot for free (through my job), but it would require securing an RV loan. I am attracted to this option because I currently pay $1,100 a month on rent, which is almost half of my monthly paycheck (2300 after taxes). The lot itself would be free, save utilities. My credit score is in the 700s, but my credit file is pretty thin, as I'm in my mid-20s and I've only had two credits for about 5 years. No student loans, I bought my car with cash, I have no debt. But I'm not making money because of how much I spend on rent. My savings is only $1500, so I can't really buy a (halfway decent one) for cash. \n\nShould I risk an inquiry given my circumstances? I just want a small camper, hopefully 15k or less. Besides this, I'm just not sure what to do to be able to start saving money. I need to keep my job as it pays for grad school, which I'm in currently. Thank you for your advice ahead of time. \n\nEdit: My yearly salary is only 34k. I have no children and do not qualify for need-based aid. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6ru56/chances_of_loan_approval/","permalink":"/r/personalfinance/comments/1p6ru56/chances_of_loan_approval/","score":0,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764112764.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6mzht","name":"t3_1p6mzht","subreddit":"personalfinance","author":"soupy_pancake","title":"Should I get rid of the mutual funds in my IRA? And/or my financial advisor?","selftext":"Hey all,\n\nBackground -- 36 year old woman, not a savvy investor in the slightest, have been trying to educate myself more and more. I have a financial advisor that took me on years ago because he manages my parents money. He doesn't charge me a fee, but he gets a portion of the fee the mutual funds I have charge. \n\nI've been hemming and hawing for years on whether to just drop him and move everything over to Vanguard, but I'm also scared and like the idea of having help from someone who knows what they're doing. But because I'm uninformed, I have no idea if he's actually good or not. Years ago when I first started with him, he had all my money in mutual funds, and then when I learned about index funds I asked him to move more money into ETFs. Those have all outperformed the mutual funds of course. Seems like a no brainer to me, and the fact that he didn't suggest it gave me pause. \n\n  \nI just made my max contribution to my IRA, and he told me that he was going to evenly distribute among what I already have which is --\n\n  \nEquities\n\n\\- BBN: 16.38%\n\n\\- QQQ: 16.09%\n\n\\- DIA: 10.49%\n\n\\- SPY: 14.94%\n\nTotal Equities: 57.89%\n\n\n\nMutual Funds\n\n\\- CWGCX: 14.44%\n\n\\- JFNCX: 14.55%\n\n\\- SCWCX: 13.12%\n\nTotal Mutual Funds: 42.11%\n\n  \nBut then he went and just bought CWGCX, JFNCX, SCWCX and a little bit of SPY. My instinct was to just do the index funds. Basically, am I being hosed? \n\n  \nLast year, I opened a Vanguard account and bought **VOO** so that I could see what it would feel like to handle my money myself. My thought was, any new investments I'll handle myself but let him keep managing what he already has of mine. Is that silly?\n\n  \nAm I being an idiot? What do I need to learn? Any advice is welcome, thank you guys.","url":"https://www.reddit.com/r/personalfinance/comments/1p6mzht/should_i_get_rid_of_the_mutual_funds_in_my_ira/","permalink":"/r/personalfinance/comments/1p6mzht/should_i_get_rid_of_the_mutual_funds_in_my_ira/","score":0,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764101311.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6msq9","name":"t3_1p6msq9","subreddit":"personalfinance","author":"n0chance_","title":"Exercise and Hold Stock Options using cash from assigned covered calls - does this strategy make sense?","selftext":"I have company stock (from previous distributed RSU/options) and NSO stock options (with value) from the same company that are expiring soon (within the year). I just consider this as all bonus money that I don’t count on. I feel the company is dependable where the stock will grow reasonably over long time frames.\n\nWould this strategy make sense at all to limit taxes?\n\n1. Do covered calls with current company stock to collect premium. Don’t worry about getting called on the stock.\n\n2. If I get assigned/called on the covered call and sell those shares, use that money to exercise and hold the stock options from the same company. I would have to pay some taxes for exercising.\n\n3. Hold any exercised stock for a year until it becomes a long position.\n\n4. Repeat back to step 1 assuming I still have stock options with value expiring soon.","url":"https://www.reddit.com/r/personalfinance/comments/1p6msq9/exercise_and_hold_stock_options_using_cash_from/","permalink":"/r/personalfinance/comments/1p6msq9/exercise_and_hold_stock_options_using_cash_from/","score":0,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764100894.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ms7n","name":"t3_1p6ms7n","subreddit":"personalfinance","author":"Impossible_Beat6092","title":"What to do with 90k inheritance?","selftext":"I just found out I'm about to receive a 90k inheritance. I never imagined having that much money at one time and I'm not sure what's the smartest thing to do with it.  \nHere's my current financial situation:  \nMonthly income \\~ $3500  \nMonthly expenses \\~ $3200  \nDebt - 15k (auto/student loans) under 3%  \nSavings - fully funded RothIRA this year, nothing else  \nI'm hoping to start grad school next fall which would cost 20k/yr for 3 years. \n\nAny advice is greatly appreciated!","url":"https://www.reddit.com/r/personalfinance/comments/1p6ms7n/what_to_do_with_90k_inheritance/","permalink":"/r/personalfinance/comments/1p6ms7n/what_to_do_with_90k_inheritance/","score":0,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764100866.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kbkm","name":"t3_1p6kbkm","subreddit":"personalfinance","author":"Outtaknowwhere","title":"Just refinanced my car for 10% less, same length, and $0 in fees.","selftext":"Went from Wells Fargo to a previously used local credit union.\n\nCar is a 2019 bmw. Original loan and refi loan had same length, (5year), Wells Fargo had me at 16% interest, credit union put me to a 5.5%. I’m blown away.\n\nCar is valued under loan amount, I got tricked into some dealership offers that I despise, and after 9 months of payments I hadn’t even touched the principle balance. Saving me $140 a month this way.\n\nLet me know if there are any red flags! This was my first time doing this. Also wanted to share hope. This will save me around $15k in interest with only on time payments. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6kbkm/just_refinanced_my_car_for_10_less_same_length/","permalink":"/r/personalfinance/comments/1p6kbkm/just_refinanced_my_car_for_10_less_same_length/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764095456.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6j2a1","name":"t3_1p6j2a1","subreddit":"personalfinance","author":"FootGarment","title":"Roth IRA, 21 years old… am I doing this right?","selftext":"Hello,\n\nI have a Roth IRA with SoFi that uses their robo investing feature. I deposit $50 a month (I am a broke college student, so…) and have the risk level set to be aggressive. I figure that since I don’t have that much money in it, it isn’t that big of a deal? Ever since I upped the risk level, I have seen significantly more gains than when I was playing it safe. \n\nI’ve probably had the account for about a year and a half and it is currently sitting just below $1,200. Can someone tell me if I’m doing this right? I am actually stupid when it comes to investing and whatnot. I also have $9.5k in a HYSA through capital one (which my rent comes out of), about $1k in my checking, and $1k in a crappy savings account for emergencies (I can transfer money from said savings account to my checking instantly, whereas it takes several business days to transfer from my HYSA). I don’t have any student debt because of scholarships. \n\nWhat do y’all think? Is there more I could be doing? Am I doing anything egregious? I should note that, as a stupid 21 year old, I definitely spend a lot of money on experiences and going out, but I feel okay with this because I never spend money I don’t have and I am also very privileged to have things like my phone and car insurance covered by my parents. I feel like I am doing okay for now, but am scared for when I inevitably enter the job market post grab, hopefully with my M.A. in political science (don’t worry, not doing it unless it’s paid for!)","url":"https://www.reddit.com/r/personalfinance/comments/1p6j2a1/roth_ira_21_years_old_am_i_doing_this_right/","permalink":"/r/personalfinance/comments/1p6j2a1/roth_ira_21_years_old_am_i_doing_this_right/","score":0,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764092740.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i5ro","name":"t3_1p6i5ro","subreddit":"personalfinance","author":"romshavo18","title":"I'am not sure what to do with my savings","selftext":"For context, i just turned 22 last month, i saved up 23,000 USD which is all in cash and is uninvested. I have a stable job from which i can save most of what i earn, and i do not know if i'am making the mistake of not putting that into an ETF or not, because i fear from inflation. My fear is that a reccession will come, and so i should be investing in that when its at a low price. Gold is also absurdly high, but eventually after the recession it will to back down to a moderate level. What should i invest in? This amount is in a HYSA account, which earns me a 2% APY ","url":"https://www.reddit.com/r/personalfinance/comments/1p6i5ro/iam_not_sure_what_to_do_with_my_savings/","permalink":"/r/personalfinance/comments/1p6i5ro/iam_not_sure_what_to_do_with_my_savings/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764090738.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6h1cg","name":"t3_1p6h1cg","subreddit":"personalfinance","author":"No_Echo_9075","title":"Trying to chart my next steps and would like ideas or smart feedback.","selftext":"If you were to say be 38 years old and married to someone in there early 30s. What would you next steps be given these facts.\n\n1. You own your home worth 270-300k , its paid off \n2. You have zero debt , both cars owned.\n3. You have one partner with a fixed income of 1500 a month and one partner with 2200.00 so 3700.00 take home.\n4. Both credit scores are high 700s\n\nIm asking because im kinda at a loss at what to do next.\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6h1cg/trying_to_chart_my_next_steps_and_would_like/","permalink":"/r/personalfinance/comments/1p6h1cg/trying_to_chart_my_next_steps_and_would_like/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764088267.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6g0bc","name":"t3_1p6g0bc","subreddit":"personalfinance","author":"Financial-Goat1755","title":"Looking for Advice on Saving for a Down Payment","selftext":"Hello Reddit fam, \nLooking for the advice on the best way to save up for a down payment for an apartment. \nIt would be me and my parter moving in together so everything would be split 50/50\n\nI have about ~12k in student loans however my company will pay for 9k over 3 years \nI owe my parents 14k for school with no interest \n\nI currently have 30k saved up from my full time job however I drive a 16 year old car that I know will have to be replaced in the coming years\n\nWith rough estimates if I saved \n35k for a car \n30k for an emergency fund for the move out \n~40k ish for the down payments, closing, furniture, etc \nWe’re looking at 105k\nLike I mentioned I already have 30k saved up leaving me with 75k left \n\nAnyone have any advice on the smartest way to save up the rest of that 75k ? \nI don’t just mean slashing my expenses, not dining out, etc. I already have been doing those things for months now. And I keep that money in HYSA. \n\nShould I look at getting a second job? Any side hustles people can recommend that aren’t Uber/door dash??\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6g0bc/looking_for_advice_on_saving_for_a_down_payment/","permalink":"/r/personalfinance/comments/1p6g0bc/looking_for_advice_on_saving_for_a_down_payment/","score":0,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764085996.0,"edited":0.0,"link_flair_text":"Housing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6fcf6","name":"t3_1p6fcf6","subreddit":"personalfinance","author":"BTCtreezy","title":"22 and Struggling financially","selftext":"Hello guys looking for any advice I’m currently living paycheck to paycheck \nBILLS\nPhone -100\nRent-1280\nLaundry - 50 \ncable 65\n\ni make 20.60 and so roughly 1350 every two weeks \nThe problem is I seem like I can never get ahead I have cc debt right now\nDiscover -1100\ncapital one -560\n\nLooking for any advice anything that will help I’m tired of living like this I feel like I’m in financial trouble where I’m in fight or flight mode any advice is greatly appreciated","url":"https://www.reddit.com/r/personalfinance/comments/1p6fcf6/22_and_struggling_financially/","permalink":"/r/personalfinance/comments/1p6fcf6/22_and_struggling_financially/","score":0,"num_comments":27,"over_18":false,"stickied":false,"created_utc":1764084491.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6aldb","name":"t3_1p6aldb","subreddit":"personalfinance","author":"laquestiok","title":"What can I do with £40k of savings ?","selftext":"Hello, I have 40 000£ of savings, I don’t own anything and I have no investments other than a little bit of gold. I am living in a place where life is very expensive and currently didn’t got almost any income in a year because of saturation of the market (I’m commission based). I want to find a way to get financial freedom with what I have, and build a plan to be able to have more stability in my life, buy a house, etc.. What can I do with this amount of money to be able to do that ?","url":"https://www.reddit.com/r/personalfinance/comments/1p6aldb/what_can_i_do_with_40k_of_savings/","permalink":"/r/personalfinance/comments/1p6aldb/what_can_i_do_with_40k_of_savings/","score":0,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764071900.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p68haj","name":"t3_1p68haj","subreddit":"personalfinance","author":"whitieiii","title":"Who has the best auto loan rates for private party?","selftext":"Just paid off a few things and now it's time to look into an auto loan.. who has the best rates? I'm buying private party and will do 60-72 month term giving me $40-70 minimum payments if i have 3-6% interest rate.. i will put $150-200 payments every month and finish the loan in closer to 48 months hopefully.. anyone have a good auto loan rate?","url":"https://www.reddit.com/r/personalfinance/comments/1p68haj/who_has_the_best_auto_loan_rates_for_private_party/","permalink":"/r/personalfinance/comments/1p68haj/who_has_the_best_auto_loan_rates_for_private_party/","score":0,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764064238.0,"edited":1764067368.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p65v0s","name":"t3_1p65v0s","subreddit":"personalfinance","author":"ilikebirdsandcats","title":"HYSA or Investing? Best way to grow your money?","selftext":"Hello, I'm 18 years old and I use SoFi. I'm currently in college and I want to save a good amount of money to help pay off student loans in the future, I also want to let my money grow. I just started a few months ago, I currently have about $580 in my HYSA and have about ~1k in investments across SoFi and Robinhood. Should I put more of my income into a HYSA or investments? Is there a recommended split I should do?","url":"https://www.reddit.com/r/personalfinance/comments/1p65v0s/hysa_or_investing_best_way_to_grow_your_money/","permalink":"/r/personalfinance/comments/1p65v0s/hysa_or_investing_best_way_to_grow_your_money/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764054046.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p63207","name":"t3_1p63207","subreddit":"personalfinance","author":"Possible-Exit7022","title":"I need help improving my budget tracking system","selftext":"Right now, I track my daily and monthly spending using the Expense Manager / Money Tracker app (free). On top of that, I have a Google Sheet where I record my weekly expenses and total them to see my monthly spending.\n\nI’m looking to improve my tracking by making it more detailed and organized (have savings and multiple accounts). Does anyone have recommendations for a one-time purchase app, a template, or a system that has worked well for them? Any suggestions would be appreciated.","url":"https://www.reddit.com/r/personalfinance/comments/1p63207/i_need_help_improving_my_budget_tracking_system/","permalink":"/r/personalfinance/comments/1p63207/i_need_help_improving_my_budget_tracking_system/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764044492.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6178r","name":"t3_1p6178r","subreddit":"personalfinance","author":"Impressive-Call-7017","title":"What options do I have to get this collections fixed or removed?","selftext":"I made a post over at Credit to get some help to evaluate my options. But long story short I had a loan go into collections. We came up with a settlement agreement which they then stopped collecting due to a system error.\n\nIts been over a year and they dinged my credit 19 times and it tanked nearly 100 points and now they want all their money including the settled amount which they issued a 1099c for\n\nhttps://www.reddit.com/r/CRedit/s/9cFvdjUctM","url":"https://www.reddit.com/r/personalfinance/comments/1p6178r/what_options_do_i_have_to_get_this_collections/","permalink":"/r/personalfinance/comments/1p6178r/what_options_do_i_have_to_get_this_collections/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764038984.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qok4","name":"t3_1p6qok4","subreddit":"personalfinance","author":"SuperbAd2082","title":"Making 500 a week at 17 need to know were to save","selftext":"Currently working and being student don’t have much costs except food everyday \n\nJust wondering the best app to actually put money into like 100 a week to save ","url":"https://www.reddit.com/r/personalfinance/comments/1p6qok4/making_500_a_week_at_17_need_to_know_were_to_save/","permalink":"/r/personalfinance/comments/1p6qok4/making_500_a_week_at_17_need_to_know_were_to_save/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764109860.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qjld","name":"t3_1p6qjld","subreddit":"personalfinance","author":"TrophyRoomNebraska","title":"Would Getting Married Help us While My Fiancée is in Grad School?","selftext":"Hey everyone!\n\nAs the title states, me and my fiancée are considering getting married before she begins graduate school in June 2026. Most of our discussions are revolving around the financial benefits and drawbacks of being married while she is in school and understanding which is the best route for us with a few situational complexities mixed in. At a surface level it appears the standard deduction is higher for couples filing jointly vs filing single. The tax brackets also appear to be more favorable as a married couple as well.\n\nFinancial Background: Currently I make approximately 80k every year with my only considerable debt being a car lease. I am up to date on all my lines of credit and have a very good credit score. I will be turning 26 in march and will likely need to get my own health insurance but this will add a monthly expense.\n\nMy fiancée earns considerably less than me and has a limited credit score with a very limited credit history. She is in her senior year of undergrad. She is not eligible for FAFSA contributions currently because of her parents income and we are worried this will impact her/us when applying for loans through FAFSA for 2026. Her parents will likely not contribute to her grad school expenses based on previous conversations.\n\nOur upcoming situation: We will be moving states for her to attend graduate school and I will be supporting her through this process basically paying for all expenses she has. The state we are moving to (Iowa) has a lower tax rate than our current state (Nebraska). I have done some research on taxes when filing jointly vs remaining single but it is hard to find concrete answers.\n\nOur Goal: To limit financial stress as much as we can while I help support her through school and beginning to pay off loans early to limit interest accrual. We are not looking for potential tax benefits to be a fix-all as making sound financial decisions will be most important but we are looking for any break we can get during this time.\n\nWhat are your thoughts on our situation? Would marriage provide worthwhile tax benefits to help make our financial situation less stressful during her schooling?","url":"https://www.reddit.com/r/personalfinance/comments/1p6qjld/would_getting_married_help_us_while_my_fiancée_is/","permalink":"/r/personalfinance/comments/1p6qjld/would_getting_married_help_us_while_my_fiancée_is/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764109522.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qfnc","name":"t3_1p6qfnc","subreddit":"personalfinance","author":"hulloworld24","title":"Is it worth transferring funds from VTSAX to VTI for taxable account?","selftext":"Hello, I have my retirement accounts in target date funds. For my taxable account, I put all my funds into VTSAX. I'm currently 30 and plan to continue to contribute to this until I retire. I heard that VTI is more tax efficient, so I'm wondering if it's worth it to transfer (I heard Vanguard lets you do that) or if I should just keep it in VTSAX. Or should I just contribute to VTI moving forward? Or just continue with VTSAX for simplicity?","url":"https://www.reddit.com/r/personalfinance/comments/1p6qfnc/is_it_worth_transferring_funds_from_vtsax_to_vti/","permalink":"/r/personalfinance/comments/1p6qfnc/is_it_worth_transferring_funds_from_vtsax_to_vti/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764109265.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6qfed","name":"t3_1p6qfed","subreddit":"personalfinance","author":"wizard_folio","title":"I got a $1,500 job bonus - should I invest it or throw it at my student loans","selftext":"I got a $1,500 bonus at work and I’m not sure what to do with it. I still have some student loan debt from college, but I’ve also been wanting to start investing instead of letting money just sit around.\n\nPart of me wants to throw the whole bonus at the loans, and the other part wants to put it into something long-term like an ETF or index fund.\n\nFor anyone who’s been in this situation: would you pay down the loans, invest the money, or split it?\n\nNot looking for professional advice — just curious how people would handle it.","url":"https://www.reddit.com/r/personalfinance/comments/1p6qfed/i_got_a_1500_job_bonus_should_i_invest_it_or/","permalink":"/r/personalfinance/comments/1p6qfed/i_got_a_1500_job_bonus_should_i_invest_it_or/","score":0,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1764109248.0,"edited":0.0,"link_flair_text":"Planning","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6og34","name":"t3_1p6og34","subreddit":"personalfinance","author":"EasternDust6278","title":"Leaving the US for a few months can my friend use my financed car and cover the payment","selftext":"I may need to leave the US for a few months while I wait for my OPT work card and my first job. I have a car that is fully in my name with an active auto loan and insurance. A close friend who stays in the US offered to use the car and pay the monthly loan amount while I am abroad.\n\nWhat are the main risks of this arrangement. The title and loan would still be in my name and I know that legally I am still responsible if there is a missed payment or an accident. Has anyone done this in a safe way with a written agreement and proper insurance.\n\nAny advice on how to structure this or if it is simply a bad idea would be appreciated.","url":"https://www.reddit.com/r/personalfinance/comments/1p6og34/leaving_the_us_for_a_few_months_can_my_friend_use/","permalink":"/r/personalfinance/comments/1p6og34/leaving_the_us_for_a_few_months_can_my_friend_use/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764104619.0,"edited":0.0,"link_flair_text":"Auto","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ofqw","name":"t3_1p6ofqw","subreddit":"personalfinance","author":"EasternDust6278","title":"International student with auto loan and negative equity what are realistic options","selftext":"I am an international student in the US with an auto loan from a major lender tied to a dealership. The current market value of the car is lower than what I still owe so I am upside down on the loan. I am graduating soon and my future income in the US is uncertain while I wait for OPT and my first job.\n\nIf I give the car back now the sale value would not fully cover the loan balance and I would still owe a few thousand dollars. For people who have been in this situation what are realistic options besides immediate voluntary surrender. Is it worth trying to negotiate lower payments or a modification before I miss any payments.\n\nNot looking for legal advice just practical experiences and what you would do in my place.","url":"https://www.reddit.com/r/personalfinance/comments/1p6ofqw/international_student_with_auto_loan_and_negative/","permalink":"/r/personalfinance/comments/1p6ofqw/international_student_with_auto_loan_and_negative/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764104598.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6nx5r","name":"t3_1p6nx5r","subreddit":"personalfinance","author":"Fair-Intention6479","title":"Buy here/Pay here lot. Need advice","selftext":"I leased a car from a buy here pay here lot that I had previously leased 2 cars from in the past. I totaled the first one and the lot was paid in full for it from my insurance. The 2nd car I paid a down payment for and lease it for about 2-3 years, then came back and traded it in for a newer car with fewer issues earlier this year. The new car ended up lasting me 6 months before breaking a axle and control arm (repair cost was looking to be $900+) on top of my monthly payment which was already $500 a month. So suddenly I owed roughly $1400-$1500 on a broken down car all in the matter of a month. I was in contact with the owner of the lot and told him I couldn't pay it and to just come get the car. He came and got it and I drove up to his lot the next day and spoke to him face to face, gave him the keys back and told him I couldn't financially afford to pay for the repair cost and monthly payment. He said ok and I left. How fast forward a month or two and the car is now repaired and sitting on his lot ready to be leased to someone else and he hasn't communicated with me about paying off the rest of my loan. It looks like he just fixed the car and put it back out on his lot again to lease to someone else. He told me he has the title with my name on it and I signed the back of the time back to him. And by me doing that he says I don't have to pay him anymore on the loan. This was a $20,000 car I paid maybe $8000 on. What's going on? Is this legal? Can he just forgive my loan like that and act like this repossession never happened? \n\nEdit: Sorry for all the typos I'm on mobile","url":"https://www.reddit.com/r/personalfinance/comments/1p6nx5r/buy_herepay_here_lot_need_advice/","permalink":"/r/personalfinance/comments/1p6nx5r/buy_herepay_here_lot_need_advice/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764103449.0,"edited":1764104478.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6kpap","name":"t3_1p6kpap","subreddit":"personalfinance","author":"ZealousidealFan7769","title":"Traditional 401k vs Roth 401k","selftext":"I've been trying to read up on the pros and cons of these but it gets overwhelming quickly. \n\nI feel like my financial situation is pretty straightforward. 41 years old, currently making about 65k. No debt, just started a Roth IRA this year and plan on maxing it out every year.\n\n  \nI got a late start on my 401k and currently have about 36k in it. I was doing all traditional until earlier this year when our company started allowing Roth 401k. At that point I thought it good to get a mix, so I currently stand at about 19k Standard, 11k Roth and 6k matching.\n\n  \nIf I'm being honest with myself, I don't see my income increasing significantly with potential to slightly decrease if I lose my job.  So If I expect to be making under 100k for the rest of my working career, is it obvious to do one over the other with 401k? \n\n  \nThanks!","url":"https://www.reddit.com/r/personalfinance/comments/1p6kpap/traditional_401k_vs_roth_401k/","permalink":"/r/personalfinance/comments/1p6kpap/traditional_401k_vs_roth_401k/","score":0,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764096311.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6hjiz","name":"t3_1p6hjiz","subreddit":"personalfinance","author":"travelinggal7147","title":"Which debt should I pay off first?","selftext":"Hi all! I am finally making enough money to start paying off my debts, woohoo! \n\nI have heard of the snowball method to pay things off. Where you throw all your extra money at the lowest debt amount and make minimum payments on everything else. But it feels smarter to make the larger payments on the debt with the highest interest rate. What makes the most sense for my debts?\n\nHere is what debt I have: \n- credit card: $5200 @ 26.74% \n- student loan 1: $559 @ 4.45% \n- student loan 2: $877 @ 2.75%\n- student loan 3: $5812 @2.75%\n- student loan 4: $6791 @ 3.73%\n- student loan 5: $13986 @ 11.25%\n\n\nSide note: I am currently renting ($1050/month + utilities) and want to save for a house but feel like I need to get some of these debts paid off before going into a home loan. Knowing my debts do you agree? \n\nThanks! ","url":"https://www.reddit.com/r/personalfinance/comments/1p6hjiz/which_debt_should_i_pay_off_first/","permalink":"/r/personalfinance/comments/1p6hjiz/which_debt_should_i_pay_off_first/","score":0,"num_comments":19,"over_18":false,"stickied":false,"created_utc":1764089382.0,"edited":0.0,"link_flair_text":"Debt","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6ehhp","name":"t3_1p6ehhp","subreddit":"personalfinance","author":"Own_Resource_1972","title":"Our In-laws want to pay off the rest of our mortgage.","selftext":"My wife's parents have very generously offered to pay off the rest of our mortgage as a gift to us. It will be about 45,000 dollars. I understand that this amount will result in my in-laws needing to report it for tax purposes but it's my understanding my wife and I won't have to report anything? Are there any other financial consequences of paying off your mortgage early like this that I'm not thinking of? ","url":"https://www.reddit.com/r/personalfinance/comments/1p6ehhp/our_inlaws_want_to_pay_off_the_rest_of_our/","permalink":"/r/personalfinance/comments/1p6ehhp/our_inlaws_want_to_pay_off_the_rest_of_our/","score":0,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764082498.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6cp26","name":"t3_1p6cp26","subreddit":"personalfinance","author":"Green_Ad_4036","title":"Personal and Business transactions are mixed together and numerous. How do I stop the madness?","selftext":"As the post notes my many many personal and business transactions are all mixed together across several credit cards and bank accounts. My life and business partner will not stop creating more of a mess. I am also to a smaller degree to blame. I am willing to hire a bookkeeper and realize I need to segregate the sources of funds but I am here asking for any other advice possible. My head is about to explode and I suspect we are bleeding money. Thanks very much in advance. ","url":"https://www.reddit.com/r/personalfinance/comments/1p6cp26/personal_and_business_transactions_are_mixed/","permalink":"/r/personalfinance/comments/1p6cp26/personal_and_business_transactions_are_mixed/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764078018.0,"edited":0.0,"link_flair_text":"Budgeting","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p5zrr1","name":"t3_1p5zrr1","subreddit":"personalfinance","author":"BananasinBigLaw","title":"Please help me figure out how to allocate my funds pleaseee","selftext":"Hi All! I have very limited finance knowledge/skills and would greatly appreciate some input on how to balance my student loans/savings and other investments. \n\nI have roughly $80K between my checking/savings account, $25K in a 401K and roughly $110K in student loans. \n\nI recently had surgery and had to take extended time off from work for recovery so I quit my job and went on CA SDI for which I should be eligible for the next 6 months or so still (though the payments have been very slow and delayed) but my weekly benefit amount should cover my expenses for the next 6 months (but who knows when I will get that money if at all so I want to have a 6 month emergency fund of $30K) while I apply for new jobs. \n\nWhat would you do if you were me? Pay down some of those loans? Invest some of that money and if so, what kind of investing? Leave everything as is until I have a new position? \n\nThank youuuuu","url":"https://www.reddit.com/r/personalfinance/comments/1p5zrr1/please_help_me_figure_out_how_to_allocate_my/","permalink":"/r/personalfinance/comments/1p5zrr1/please_help_me_figure_out_how_to_allocate_my/","score":0,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764034925.0,"edited":0.0,"link_flair_text":"Investing","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6md1e","name":"t3_1p6md1e","subreddit":"personalfinance","author":"RecipeSuper1690","title":"Why did my credit available change","selftext":"Hello sorry if this isn’t a good subreddit for this but my credit available suddenly went up without me putting money in and I don’t think it’s because the credit limit was increased because my limit stayed the same.\nMy limit has been 1000 ever since I opened the credit card with Simpli financial a year ago. My credit available yesterday was 400 and today it went up to 1400 without me putting money in. Why would my available credit increase by 1000 when my limit stayed the same?\nThank you","url":"https://www.reddit.com/r/personalfinance/comments/1p6md1e/why_did_my_credit_available_change/","permalink":"/r/personalfinance/comments/1p6md1e/why_did_my_credit_available_change/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764099936.0,"edited":0.0,"link_flair_text":"Credit","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6lyll","name":"t3_1p6lyll","subreddit":"personalfinance","author":"Mija0101","title":"HSA losing money…options?","selftext":"A job I previously worked at contributed to my HSA. It was since been sitting in the account however I recently checked it and saw that it’s been getting charged like $4/month yet only earning like 6 or 7 cent a month. So it’s been decreasing. I have since filled my Amazon cart full of Hsa eligible products that I want to use since I’m losing money anyway. Before I make that large purchase, is there a better choice or should I just spend it all? I’m not currently getting/making any contributions so it’s literally just losing money every month. I just saw the option to invest which I’m sure would be smarter. Any advice?","url":"https://www.reddit.com/r/personalfinance/comments/1p6lyll/hsa_losing_moneyoptions/","permalink":"/r/personalfinance/comments/1p6lyll/hsa_losing_moneyoptions/","score":0,"num_comments":19,"over_18":false,"stickied":false,"created_utc":1764099043.0,"edited":0.0,"link_flair_text":"Saving","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6i760","name":"t3_1p6i760","subreddit":"personalfinance","author":"Ok_Shallot_5583","title":"Loan for Lawyer- Assistance pls","selftext":"Hello. \n\nTo explain my situation, I need a lawyer by next week. I chose one, but my mother doesn’t want to finance it. I know that I can do it myself, but this just so happened at a time just when I started my job. I have two weeks until I can start getting paychecks, I get paid 1.5k biweekly after tax.\n\nI don’t pay rent, so I can probably pay off the loan relatively quickly.\n\n\nThe lawyer is asking 7,500 upfront and I need to pay 12,500 total. \n\n What are my options here? Thinking of taking out a loan. My mother put me on her credit card so I have a credit of 760+. I don’t have my own credit card.\n\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6i760/loan_for_lawyer_assistance_pls/","permalink":"/r/personalfinance/comments/1p6i760/loan_for_lawyer_assistance_pls/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764090826.0,"edited":0.0,"link_flair_text":"Other","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
{"id":"1p6bnwb","name":"t3_1p6bnwb","subreddit":"personalfinance","author":"Longjumping-Link-455","title":"Exceeded income limit for Roth IRA","selftext":"Location U.S\n\nThe situation is I'm estimating my magi to be 168k by the end of year. \n\nWhat are my options since I went over the income limit?\n\n This year I received retro pay due an outdated and wrong pay scale for my position which was about 15k.  I also got a new position with 10% more pay\n\nI do not expect to make more than the IRA income in the next few years since I'll be adjusting my pretax contributions to my 457 which will keep me below the  limit. \n\n","url":"https://www.reddit.com/r/personalfinance/comments/1p6bnwb/exceeded_income_limit_for_roth_ira/","permalink":"/r/personalfinance/comments/1p6bnwb/exceeded_income_limit_for_roth_ira/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764075156.0,"edited":0.0,"link_flair_text":"Retirement","is_self":true,"spoiler":false,"locked":false,"thumbnail":""}
