{"id":"1otyqwd","name":"t3_1otyqwd","subreddit":"espanol","author":"ReasonablePea458","title":"¿Soy culpable o no?","selftext":"Esta es una historia que me atormenta y un recuerdo que viene a mi memoria cada tanto, causándome dolor por lo injusto que fue.   \nDurante un viaje familiar, yo, primos, tíos y mi hermana nos quedamos durante una semana en una casa con piscina. Yo era la que pasaba más tiempo dentro, disfruto nadar. Pero un día, cuando yo y mi hermana estábamos nadando, mi hermana decidió envolver su celular (un Motorola) en MI TOALLA. No es que lo haya sobrepuesto, literal abrio mi toalla, lo metio dentro y lo envolvió, era imposible de ver. Yo, al ver que el almuerzo estaba listo, decidí salir de la piscina, obvio tenia que secarme y al agarrar mi tolla escucho algo caer al agua.   \nNo pensé nada malo, pensé que lo que había caído eran unos lentes que justamente estaban en el ultimo escalón de la piscina. Pero caigo en panico cuando veo el telefono sumergido en el agua. Me asuste, lo más rapido que pudo lo saque y en mi inocencia lo encendi... fue un gran error, lo se, pero tenia 11 años ¿que iba a saber yo que si un dispositivo se moja lo ultimo que debes hacer es encenderlo?   \nLuego de esto lo dejo en una banca. Nadie se había dado cuenta, solo yo.   \nComo era de esperarse, el celular había quedado dañado, la pantalla empezó a tornarse negra, la bocina sonaba obstruida y la cámara estaba empañada desde dentro.   \nTermine confesando, pero quise decir mi versión \"Yo no sabia que estaba dentro\". Pero nunca recibí un \"no fue tu culpa\" nunca se le reprocho a mi hermana por hacer lo que hizo, solo yo soy la culpable. ¿Que culpa tenia yo?   \n  \nY como si fuera un castigo, años más tarde, como a mi jamás me han comprado un celular propio, solo que usado celulares obsoletos de mi familia. El ciclo es que alguien se compra un celular y el celular viejo me lo dan a mi. Siempre, y eso volvió a pasar. Porque mis padres decidieron que mandarían a arreglar el Motorola, que, porcieto, estaba totalmente oxidado y luego darmelo, tal vez como un castigo... uno que solo yo veo.   \nEl celular, en su momento, fue el mejor que habia tenido, pero pronto demostro ser igual de inservible que los demás. ¿Y como no? Este Motorola fue conciderado gama alta en 2019.    \n¿Todo esto fue mi culpa? ","url":"https://www.reddit.com/r/espanol/comments/1otyqwd/soy_culpable_o_no/","permalink":"/r/espanol/comments/1otyqwd/soy_culpable_o_no/","score":3,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1762831145.0,"edited":false,"link_flair_text":"Discusión","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1otm8w7","name":"t3_1otm8w7","subreddit":"espanol","author":"Just-Application-551","title":"Que artista te gusta todas sus canciones","selftext":"Normalmente algunas personas solo escuchan las canciones más famosas de una banda u artista pero existe alguna banda u artista donde te has dado cuenta que te gusta todas sus canciones. Personalmente me gusta todas las canciones de led zeppelin. me gusta Stairway to heaven. All my love. Whola lotta love. Black dog. Inmigrant song. Heartbraker, Ramble on. Going to California. Heartbraker Kashmir es mi favorita. Going to California. Over the hills and far away. The ocean. Rock and Roll. Since I’vee been love you. Moby dick. Dazed and confused. Good times Bad times. Babe I’m gonna Leave you. How many times more. Brig It on home. I can‘t quit you baby. Hay dije todas las canciones que me gustaba. No exagero de verdad me gusta todas las cnsidones de led zeppelin por eso me preguntaba si alguien tíene algún artista o Banda donde no se limiten al escuchar y gustarte las canciones más famosas sino que te gusta todas sus canciones ","url":"https://www.reddit.com/r/espanol/comments/1otm8w7/que_artista_te_gusta_todas_sus_canciones/","permalink":"/r/espanol/comments/1otm8w7/que_artista_te_gusta_todas_sus_canciones/","score":3,"num_comments":12,"over_18":false,"stickied":false,"created_utc":1762800478.0,"edited":false,"link_flair_text":"Foto ","is_self":true,"spoiler":true,"locked":false,"thumbnail":"spoiler"}
