{"id":"1p6eu8l","name":"t3_1p6eu8l","subreddit":"sysadmin","author":"orion3311","title":"Org goes all shadow IT","selftext":"Anyone else find their org going all shadow IT? I get pulled in to fix stuff non-stop and never included from the start. Ready to jump off a roof.","url":"https://www.reddit.com/r/sysadmin/comments/1p6eu8l/org_goes_all_shadow_it/","permalink":"/r/sysadmin/comments/1p6eu8l/org_goes_all_shadow_it/","score":255,"num_comments":108,"over_18":false,"stickied":false,"created_utc":1764083324.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6fq4h","name":"t3_1p6fq4h","subreddit":"sysadmin","author":"SquizzOC","title":"Memory - Fair Warning","selftext":"Folks, we've seen a few posts regarding Memory availability and pricing over the last week or two and just a quick update from what we are seeing on the VAR side.  \n\nMemory is becoming non-existent slowly, but surely.   \nThe pricing since just August has more then doubled.  \nAnticipate system costs going up from here if they haven't already.  \n\nDell for example will not sell certain modules unless its in a system build. I've seen this with servers and laptops at this time.  \n\n3rd parties like Axiom/Kingston/Crucial are basically running out of stock.  \n\nI don't believe there's a good solution to \"Buy Now\" or \"Wait it out\" this is just what to expect if any of your partners come back with exceptionally high pricing or long lead times. Also your ETA's should be expected to be extended at any time.  \n\nJust fair warning friends.","url":"https://www.reddit.com/r/sysadmin/comments/1p6fq4h/memory_fair_warning/","permalink":"/r/sysadmin/comments/1p6fq4h/memory_fair_warning/","score":184,"num_comments":61,"over_18":false,"stickied":false,"created_utc":1764085356.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p66n1h","name":"t3_1p66n1h","subreddit":"sysadmin","author":"Exotic-Reaction-3642","title":"Why does identity in the Microsoft stack still feel so scattered?","selftext":"Entra ID roles here.\n\nAzure IAM there.\n\nIntune permissions somewhere else.\n\nEnterprise app settings in another menu.\n\nCA policies in their own world entirely.\n\nEvery time I try to do a clean audit, I end up clicking through 10 different portals just to understand who can do what.\n\nIs this just the permanent state of Microsoft cloud, or have any of you actually found a sane way to centralize identity governance?","url":"https://www.reddit.com/r/sysadmin/comments/1p66n1h/why_does_identity_in_the_microsoft_stack_still/","permalink":"/r/sysadmin/comments/1p66n1h/why_does_identity_in_the_microsoft_stack_still/","score":150,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764057028.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6j5rr","name":"t3_1p6j5rr","subreddit":"sysadmin","author":"mwskibumb","title":"Who's working on their last 10 years","selftext":"Who's working on their theoretically last 10 years (retire at 65?), and what are your thoughts on your current position and future in the industry?","url":"https://www.reddit.com/r/sysadmin/comments/1p6j5rr/whos_working_on_their_last_10_years/","permalink":"/r/sysadmin/comments/1p6j5rr/whos_working_on_their_last_10_years/","score":108,"num_comments":156,"over_18":false,"stickied":false,"created_utc":1764092955.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ecnd","name":"t3_1p6ecnd","subreddit":"sysadmin","author":"ExtraordinaryKaylee","title":"The original \"Vibe Coding\" wasn't AI. It was VisiCalc (1979)","selftext":"I've been seeing the term \"Vibe Coding\" thrown around a lot lately regarding AI tools, and it sent me down a bit of a history rabbit hole.\n\nI went back and looked at the launch of VisiCalc in 1979 and James Martin’s 1982 book *Application Development Without Programmers*. The parallels to what we are dealing with right now are actually kind of insane.\n\nBack then, IT departments had multi-year backlogs. Managers started buying Apple IIs with their typewriter budgets just to run VisiCalc so they could bypass IT. That was the birth of \"Shadow IT.\"\n\nEveryone thinks macros were the start of user-gen coding, but VisiCalc didn't even *have* macros. It was just the sheer ability for a user to define logic without asking permission that broke the dam.\n\nI wrote up a deeper dive on this, but the conclusion I came to is that we're trying to solve this the wrong way (again). In the 80s, IT tried to ban PCs. It failed. Then we tried to ignore spreadsheets. That failed. Eventually, we just accepted them.\n\nWe're currently in the \"ban/ignore\" phase with AI/Low-code tools. I think the only way out is what I'm calling \"Governed Sandboxes\"—basically giving users \"IT-like\" powers but inside a walled garden where we can still audit the data.\n\nCurious if anyone here was around for the Lotus/Excel wars, or if you guys are seeing the exact same \"Shadow IT\" patterns popping up with things like Copilot or Power Platform right now?","url":"https://www.reddit.com/r/sysadmin/comments/1p6ecnd/the_original_vibe_coding_wasnt_ai_it_was_visicalc/","permalink":"/r/sysadmin/comments/1p6ecnd/the_original_vibe_coding_wasnt_ai_it_was_visicalc/","score":82,"num_comments":62,"over_18":false,"stickied":false,"created_utc":1764082183.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p60jhr","name":"t3_1p60jhr","subreddit":"sysadmin","author":"matroosoft","title":"What needed to be in Windows ages ago?","selftext":"Week numbers in the taskbar.\n(if you ever worked in planning, procurement or production, you know)\n\nAdding text in screenshots, why in earth didn't they add this yet? Now I'm writing in my nice mouse-gestures-font ","url":"https://www.reddit.com/r/sysadmin/comments/1p60jhr/what_needed_to_be_in_windows_ages_ago/","permalink":"/r/sysadmin/comments/1p60jhr/what_needed_to_be_in_windows_ages_ago/","score":76,"num_comments":223,"over_18":false,"stickied":false,"created_utc":1764037114.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6absr","name":"t3_1p6absr","subreddit":"sysadmin","author":"Silly-Commission-630","title":"Data leakage is happening on every device, managed or unmanaged. What does mobile compliance even mean anymore? Be real, all our sensitive company data and personal info we shouldn’t type into AI tools is already there...","selftext":"We enforce MDM.  \nWe lock down mobile policies.  \nWe build secure BYOD frameworks.  \nWe warn people not to upload internal data into ChatGPT, Perplexity, Gemini, or whatever AI tool they use.  \nEmails, internal forms, sensitive numbers, drafts, documents....everything gets thrown into these AI engines because it’s convenient.\n\nThe moment someone steals an employee’s phone…  \nor their laptop…  \nor even just their credentials…  \nall that AI history is exposed.\n\nIf this continues, AI tools will become the new shadow IT risk no one can control and we’re not ready\nAnd because none of this is monitored, managed, logged, or enforced…  \nwe will never know what leaked, where it ended up, or who has it\nHow are u handling mobile &  AI data leakage ?   \nAnything that actually works?","url":"https://www.reddit.com/r/sysadmin/comments/1p6absr/data_leakage_is_happening_on_every_device_managed/","permalink":"/r/sysadmin/comments/1p6absr/data_leakage_is_happening_on_every_device_managed/","score":53,"num_comments":50,"over_18":false,"stickied":false,"created_utc":1764070996.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6m48y","name":"t3_1p6m48y","subreddit":"sysadmin","author":"Mr-Hops","title":"Anyone using Starlink as Internet backup?","selftext":"Currently, we have a single Internet service for our office. 1000 meg download with a block of 15 static public IPs.\n\nWe are now looking into a redundant Internet service. Fiber is not yet fully available in our area. Talks about early - mid 2026 though.\n\nAnyway, anyone using Starlink as a backup internet service? If so, have you noticed if the connection is solid? Also, do they offer static IPs for businesses?  ","url":"https://www.reddit.com/r/sysadmin/comments/1p6m48y/anyone_using_starlink_as_internet_backup/","permalink":"/r/sysadmin/comments/1p6m48y/anyone_using_starlink_as_internet_backup/","score":31,"num_comments":53,"over_18":false,"stickied":false,"created_utc":1764099394.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p635sc","name":"t3_1p635sc","subreddit":"sysadmin","author":"donyewumpppp","title":"Is anyone at a 2025 ADDS functional level?","selftext":"Curious if anyone has been brave enough to go for it ","url":"https://www.reddit.com/r/sysadmin/comments/1p635sc/is_anyone_at_a_2025_adds_functional_level/","permalink":"/r/sysadmin/comments/1p635sc/is_anyone_at_a_2025_adds_functional_level/","score":31,"num_comments":33,"over_18":false,"stickied":false,"created_utc":1764044841.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6s3as","name":"t3_1p6s3as","subreddit":"sysadmin","author":"mikeypf","title":"8.8.8.8 having issues?","selftext":"Anyone else seeing 8.8.8.8 have issues responding to requests?","url":"https://www.reddit.com/r/sysadmin/comments/1p6s3as/8888_having_issues/","permalink":"/r/sysadmin/comments/1p6s3as/8888_having_issues/","score":17,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764113415.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6f5va","name":"t3_1p6f5va","subreddit":"sysadmin","author":"NSFW_IT_Account","title":"Are you testing your Backups?","selftext":"How do you test them? Is it possible to restore a production server to another machine without affecting anything in production? I'd like to start testing system state backups to make sure they work.","url":"https://www.reddit.com/r/sysadmin/comments/1p6f5va/are_you_testing_your_backups/","permalink":"/r/sysadmin/comments/1p6f5va/are_you_testing_your_backups/","score":19,"num_comments":40,"over_18":false,"stickied":false,"created_utc":1764084074.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6j516","name":"t3_1p6j516","subreddit":"sysadmin","author":"RaisingElephantSysrq","title":"APC UPS eats up batteries","selftext":"Hello, please let me know if this the wrong sub. \n\nSMB infr here. We bought a Smart-UPS SRT 8000 in 2017 along with 2 battery packs in addition to the internal one that comes with the UPS. Each battery pack has two cartridges and each cartridge has 2 cells in it. Over the last three years we have had to replace both cartridges on one of the add-on battery packs every twice. The first time the cartridges lasted a year and the second time they lasted almost 2 years. We've also had to replace cartridges on the other add-on battery pack but much less frequently. The curious thing is that when the batteries are first installed they'll say that the \"Predicted Replacement Date\" is like 4-5 years out\n\nLast week I got one of the alert messages saying that one of the cartridges in the problematic battery pack needs to be replaced soon (mid December). Then this week, after the UPS ran a scheduled self-test it came back saying that 3 cartridges in total needed replacing. One if each of the 3 battery packs. I am also getting messages saying that \"The battery power is too low to support the load; if power fails, the UPS will be shut down immediately.\"\n\nI'm curious, has anyone seen this behavior where cartridges need replacing every 1 to 2 years? Is there a proper way to replacing these that I am missing? Should I be replacing both cartridges in each pack at the same time instead of just the one that UPS says needs replacing? \n\nAlso, I noticed that when the self-test ran I got messages saying \"The battery power is too low to support the load; if power fails, the UPS will be shut down immediately.\" I know that the self test is supposed to drain the battery to a certain amount but I never received those errors before.\n\nWhat I don't want to happen is that we replace all 3 of these cartridges now (about $3K) and a year down the road we are in the same boat again without actually fixing what the real problem may be. I already have enough issues justifying other necessary IT purchases to management. \n\nAny suggestions or insight on what may be going on would help alot.","url":"https://www.reddit.com/r/sysadmin/comments/1p6j516/apc_ups_eats_up_batteries/","permalink":"/r/sysadmin/comments/1p6j516/apc_ups_eats_up_batteries/","score":13,"num_comments":41,"over_18":false,"stickied":false,"created_utc":1764092909.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ns39","name":"t3_1p6ns39","subreddit":"sysadmin","author":"Jeff-J777","title":"AI/CoPilot Training","selftext":"We are getting requests from people for an AI tool. We are a M365 shop and have people in IT using CoPilot. But with requests coming from other departments, we want to provide training to uses first before giving them access to AI.\n\nMainly we want training at various ways to use CoPilot within the Microsoft Office suite. Then how to use the chatbot function as well. Maybe tips and tricks. \n\nThen some training at reasonability using AI as well.\n\nI know Microsoft has the learning platform and we thought about pulling from that. Or if there is a YouTube channel that provides this as well. We are not looking to make the training mandatory but want hold training sessions before giving them an AI.\n\nI just wanted to see what others are doing, and possibly what platforms they are using.","url":"https://www.reddit.com/r/sysadmin/comments/1p6ns39/aicopilot_training/","permalink":"/r/sysadmin/comments/1p6ns39/aicopilot_training/","score":10,"num_comments":9,"over_18":false,"stickied":false,"created_utc":1764103133.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p66p9c","name":"t3_1p66p9c","subreddit":"sysadmin","author":"thisdodobird","title":"Retired & Bored: Tips to get back on track?","selftext":"I've been retired since 2018, yet I still do tinker at home and for friends. Setting up tiny home networks, fixing computers, setting up VPS'es and whatnot. Currently, I'm maintaining several VPS for a community of gamers, nothing fancy though.\n\nHowever, I don't feel fulfilled enough and frankly, I'm bored out of my skull.\n\nWhat are the current certs to keep up with, that may help jump start as a freelancer? I've worked with windows/linux environments before. My interests are mainly linux and security...I'd love to jump onto the *crowded* cybersec bandwagon. Or maybe pivot into AI.\n\nBut, is it too late for this old geezer (haven't hit 50 just yet)? Or are our years of experience still valued?\n\nI'm open for suggestions and advice!","url":"https://www.reddit.com/r/sysadmin/comments/1p66p9c/retired_bored_tips_to_get_back_on_track/","permalink":"/r/sysadmin/comments/1p66p9c/retired_bored_tips_to_get_back_on_track/","score":12,"num_comments":16,"over_18":false,"stickied":false,"created_utc":1764057267.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ost2","name":"t3_1p6ost2","subreddit":"sysadmin","author":"mr-roboticus","title":"How many jobs is this job description?","selftext":"“Please see below for the JD. \n\nInfrastructure & Cloud Engineering\n\nDirect the design, implementation, and optimization of hybrid infrastructure environments spanning on-premises systems and Azure cloud platforms.\n\nDrive the adoption and integration of Azure AI services, including Azure Machine Learning, Cognitive Services, and AI-powered analytics solutions.\n\nEnsure enterprise systems, networks, and data platforms meet high standards for availability, performance, and scalability.\n\nPartner with software engineering teams to ensure infrastructure readiness, seamless CI/CD pipeline integration, and adherence to DevOps best practices.\n\nCybersecurity & Risk Management\n\nOwn and evolve the enterprise cybersecurity strategy in alignment with technology leadership.\n\nDevelop and maintain comprehensive security frameworks, incident response processes, and compliance programs (e.g., NIST, HIPAA, CIS, NYDFS).\n\nOversee proactive risk monitoring and mitigation efforts related to data protection, access control, and threat detection across all digital assets.\n\nHelp Desk & End-User Support\n\nLead Help Desk and desktop support functions to deliver exceptional service and technical assistance to all employees”\n\nJust curious if you see 1 job here or many. I was offered this recently.  Company is quite large, maybe over 1k employees.  Seems like at least 2 jobs from my perspective.","url":"https://www.reddit.com/r/sysadmin/comments/1p6ost2/how_many_jobs_is_this_job_description/","permalink":"/r/sysadmin/comments/1p6ost2/how_many_jobs_is_this_job_description/","score":9,"num_comments":42,"over_18":false,"stickied":false,"created_utc":1764105429.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6llmw","name":"t3_1p6llmw","subreddit":"sysadmin","author":"Trusci","title":"Automatic Timezone Windows 25h2 - October update","selftext":"Hello,\n\nI was using my good old working script for years to enable the automatic timezone but after the October update on 25h2 (It was working on the GA September version), my script failed to start the tzautoupdate service\n\nThe script was set 2 registry keys and config the service\n\n>HKEY\\_LOCAL\\_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Sensor\\\\Overrides\\\\{BFA794E4-F964-4FDB-90F6-51056BFE4B44}\n\n>SensorPermissionState = 1\n\n>HKEY\\_LOCAL\\_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\location\n\n>Value = Allow\n\n>Set the service tzautoupdate in manual startupmode\n\n>Start the service tzautoupdate\n\nI spent too many hours to test and fix an (undocumented?) change. Finally, I found a new way to do the same things\n\nStart the command\n\n>C:\\\\Windows\\\\system32\\\\SystemSettingsAdminFlows.exe SetCamSystemGlobal location 1  \nSet the service tzautoupdate in manual startupmode  \nStart the service tzautoupdate\n\n\n\nI did not test on previous Windows versions / builds especially 24h2 with October update. I don't know if  SystemSettingsAdminFlows.exe was existing before this update.","url":"https://www.reddit.com/r/sysadmin/comments/1p6llmw/automatic_timezone_windows_25h2_october_update/","permalink":"/r/sysadmin/comments/1p6llmw/automatic_timezone_windows_25h2_october_update/","score":11,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764098237.0,"edited":1764105588.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ldc0","name":"t3_1p6ldc0","subreddit":"sysadmin","author":"NeighborhoodSome184","title":"RDP “Your credentials did not work” — failure only from ONE laptop (all users).","selftext":"I'm in an Active Directory environment and I'm stuck with a very strange RDP issue.\n\nOnly ONE laptop cannot connect via RDP to ONE specific Windows desktop, no matter which user logs into the laptop.\n\nEverything else works normally:\n\n* Any other computer → the target desktop = OK\n* Any user → other computers = OK\n* Any user → this laptop → the target desktop = FAIL\n* Reinstalling Windows 11 on the laptop = no change\n\nSymptoms on the target desktop:\n\nEvery RDP login attempt from this laptop shows: \"Your credentials doesn't work\"  \nEvent Viewer on the target machine logs **4625**:\n\n`Status: 0xC000006D`\n\n`SubStatus: 0x0`\n\n`LogonType: 3`\n\n`AuthenticationPackageName: NTLM`\n\n`KeyLength: 0`\n\n`TargetUserSid: S-1-0-0   (NULL SID)`\n\n`WorkstationName: <laptop>`\n\n`IpAddress: <laptop-ip>`\n\n  \nFrom other machines, successful RDP logins generate normal 4624 events with NTLMv2 etc.  \nWhat I've already tested\n\n* Network: `test-netconnection <desktop> -Port 3389` = success\n* Ping = OK\n* DNS = OK\n* Resetting the domain user password = no effect\n* Other domain users logging into this same laptop = also fail\n* Reinstalling Windows on the laptop = still fails\n* No cached credentials that could interfere\n* Other users from other clients connect to this desktop without any issues\n\nSo it’s only this one laptop → only this one desktop.\n\nCan anyone help me understand what could cause this?\n\nThanks in advance","url":"https://www.reddit.com/r/sysadmin/comments/1p6ldc0/rdp_your_credentials_did_not_work_failure_only/","permalink":"/r/sysadmin/comments/1p6ldc0/rdp_your_credentials_did_not_work_failure_only/","score":10,"num_comments":25,"over_18":false,"stickied":false,"created_utc":1764097733.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6l4v8","name":"t3_1p6l4v8","subreddit":"sysadmin","author":"sdvid","title":"Anyone running Epic without VDI? Looking for real-world workflows","selftext":"We’re a hospital running Epic and currently rely heavily on VDI. I’m exploring whether it’s possible to simplify things and move away from VDI entirely.\n\nIf your organization uses Epic without Citrix/Horizon/RDS, I’m interested in how you handle:\n\t1.\tApplication delivery\n\t2.\tClinician roaming between workstations\n\t3.\tPerformance during peak hours\n\t4.\tAny issues you ran into after dropping VDI\n\nLooking for real-world setups and lessons learned. Thanks.","url":"https://www.reddit.com/r/sysadmin/comments/1p6l4v8/anyone_running_epic_without_vdi_looking_for/","permalink":"/r/sysadmin/comments/1p6l4v8/anyone_running_epic_without_vdi_looking_for/","score":11,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764097238.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6fdiw","name":"t3_1p6fdiw","subreddit":"sysadmin","author":"Sea-Ad2045","title":"System Administrator has set policies to prevent this installation","selftext":"We inherited a new client are trying to update a software and we are getting a blocked error\n\nWindows Installer\n\n\"The system administrator has set policies to prevent this installation\"\n\nI checked Windows Installer policies under both HKLM and WOW6432Node and confirmed they were empty. I also verified that AppLocker had no MSI or script rules, and that Software Restriction Policies weren’t defined. I examined the Windows Installer service to make sure it wasn’t disabled, and I checked SafeBoot registry settings to confirm Windows wasn’t stuck thinking it was in Safe Mode. I removed the leftover MSI product registration that still referenced “oldadmin,” and I inspected the C:\\\\Windows\\\\Installer directory for cached MSI files. I also reviewed Group Policy settings in gpedit.msc under Windows Installer, and nothing was configured to block installations. Despite all of that, the MSI still fails with Event 1040, 1042, and 1033 in Event Viewer, which tells me something deeper possibly WDAC, SRP registry “tattoos,” an IFC policy, or Code Integrity rules is still blocking Windows Installer.\n\nNext I tried to connect him to there domain controller (remote employee) hoping maybe we could overwrite it as domain administrator with no luck. I also reset the password of the previous admin account for the old MSP nothing seemed to work. However we are able to install other products for some reason this software alone is hitting this policy but all of its dependencies work just fine\n\nThreat locker was ruled have the machine in monitor mode and elevation mode and performed a UA\n\nOther users have no problem for some reason his machine exclusively\n\nPlease advise","url":"https://www.reddit.com/r/sysadmin/comments/1p6fdiw/system_administrator_has_set_policies_to_prevent/","permalink":"/r/sysadmin/comments/1p6fdiw/system_administrator_has_set_policies_to_prevent/","score":8,"num_comments":43,"over_18":false,"stickied":false,"created_utc":1764084560.0,"edited":1764085260.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ony0","name":"t3_1p6ony0","subreddit":"sysadmin","author":"LionelTallywhacker","title":"ERP Software SQL Blocking/Locking Issue","selftext":"Hey guys. I just started a new “IT Support Specialist” that it turns out is just the sole system admin/database admin/network admin. I literally just started using SQL yesterday. We use JobBOSS and whenever users are using it concurrently the whole systems freezes up. I finally got into our SQL server and saw that it was due to blocks and tables being locked. I saw the first problem table and ended up creating a nonclustered index as I thought that would fix it, but the long I monitor, the more tables are being locked. I’ve included a ChatGPT summary of the issue in the form of a privatebin link, as I don’t think I can explain it that well. Basically, I’ve come to the conclusion that I possibly need to enable RCSI, but I’m a noob and just started here and I’m deathly afraid of breaking something.","url":"https://www.reddit.com/r/sysadmin/comments/1p6ony0/erp_software_sql_blockinglocking_issue/","permalink":"/r/sysadmin/comments/1p6ony0/erp_software_sql_blockinglocking_issue/","score":6,"num_comments":22,"over_18":false,"stickied":false,"created_utc":1764105123.0,"edited":1764119978.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6gvhl","name":"t3_1p6gvhl","subreddit":"sysadmin","author":"Candid-Molasses-6204","title":"Any MSPs or VARs you don't hate?","selftext":"I am currently stuck between an MSP that is now owned by Private Equity and takes months (in one case a year!) to send me an invoice and an MSP whose contract team is difficult and makes my life difficult. Are there any resellers, VARs or MSPs who don't make your life total pain?","url":"https://www.reddit.com/r/sysadmin/comments/1p6gvhl/any_msps_or_vars_you_dont_hate/","permalink":"/r/sysadmin/comments/1p6gvhl/any_msps_or_vars_you_dont_hate/","score":8,"num_comments":29,"over_18":false,"stickied":false,"created_utc":1764087901.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6dmuc","name":"t3_1p6dmuc","subreddit":"sysadmin","author":"SmallToTheWall","title":"Is there cost reporting hidden somewhere in the M365 Admin?","selftext":"Management is looking for reporting on licensing costs for the year for our M365 tenant. It varies each month due to constant onboarding / offboarding. \n\nAll I can find is \\~6-8 invoices we receive each month, spread across multiple billing accounts.\n\nAm I missing something or am I about to download and input the contents of 80 PDFs into Excel?","url":"https://www.reddit.com/r/sysadmin/comments/1p6dmuc/is_there_cost_reporting_hidden_somewhere_in_the/","permalink":"/r/sysadmin/comments/1p6dmuc/is_there_cost_reporting_hidden_somewhere_in_the/","score":7,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764080427.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6rf4w","name":"t3_1p6rf4w","subreddit":"sysadmin","author":"Money_Principle6730","title":"Anyone else struggling to evaluate voice agents beyond it kinda works?","selftext":"I’ve been running a voice agent in production for about a month and the biggest issue right now is consistency. Some calls sound great. Others completely derail depending on accents, speed of speaking, or background noise.\n\nI’ve been logging transcripts and doing some manual listening, but it feels super inefficient and subjective. I also tried running scripted test calls but that only covers the happy path.\n\nSo how are you all evaluating edge cases like interruptions, sentiment shifts, or multi-turn memory? Is there an actual framework people use or is everyone winging it like I am?","url":"https://www.reddit.com/r/sysadmin/comments/1p6rf4w/anyone_else_struggling_to_evaluate_voice_agents/","permalink":"/r/sysadmin/comments/1p6rf4w/anyone_else_struggling_to_evaluate_voice_agents/","score":4,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764111700.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6o3r6","name":"t3_1p6o3r6","subreddit":"sysadmin","author":"Le085","title":"QNAP and Entra ID","selftext":"Hi and Happy Thanksgiving everyone!\n\nIn my MSP most of my clients are on Entra ID. So, for this client I ended up with QNAP NAS.\n\nAre any of you aware of any way to integrate it with Entra ID for SSO and correct permissions and WITHOUT a VPN?\n\nI’m aware that they have an official KB: [https://www.qnap.com/en/how-to/tutorial/article/how-can-i-configure-microsoft-entra-domain-services-single-sign-on-for-a-qnap-nas](https://www.qnap.com/en/how-to/tutorial/article/how-can-i-configure-microsoft-entra-domain-services-single-sign-on-for-a-qnap-nas)\n\nKB 2: [https://www.qnap.com/en/how-to/tutorial/article/how-do-i-configure-saml-based-single-sign-on-for-quwan-qbelt-vpn-server-with-microsoft-entra-id-as-the-identity-provider](https://www.qnap.com/en/how-to/tutorial/article/how-do-i-configure-saml-based-single-sign-on-for-quwan-qbelt-vpn-server-with-microsoft-entra-id-as-the-identity-provider)\n\nBut it uses VPN.\n\nI think Synology doesn’t…\n\nThanks.","url":"https://www.reddit.com/r/sysadmin/comments/1p6o3r6/qnap_and_entra_id/","permalink":"/r/sysadmin/comments/1p6o3r6/qnap_and_entra_id/","score":5,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764103868.0,"edited":1764105838.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6hq8x","name":"t3_1p6hq8x","subreddit":"sysadmin","author":"hasthisusernamegone","title":"Backing up Entra Applications","selftext":"We've been putting a lot of work into getting as many of our third party applications as possible set up with SSO, which has resulted in a LOT of Enterprise Applications being created in Entra. How do we go about backing up all that work? Is that even a thing you can do?\n\nThere are Powershell commands (Get-Mg Application, Get-MgServicePrincipal) that look like they will pull most of the information, but can we restore that in a meaningful way if we can't export the associated certificates or secrets?\n\nIs this something you are doing, or are you just YOLOing it and adding it to the accepted risks document?","url":"https://www.reddit.com/r/sysadmin/comments/1p6hq8x/backing_up_entra_applications/","permalink":"/r/sysadmin/comments/1p6hq8x/backing_up_entra_applications/","score":4,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764089801.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p69vr5","name":"t3_1p69vr5","subreddit":"sysadmin","author":"Brilliant-Extent2684","title":"Windows DNS forwarders validation error","selftext":"Hy!\n\nI have a DC, which are also DNS server. I try to set up the forwarders to dns1.fortiguard.net. When I entered the IP address of the DNS server 96.45.45.45, the GUI show: An unknown error occurred while validating the server.\n\nI check the name resolution with nslookup from DC:\n\nnslookup [google.hu](http://google.hu) [96.45.45.45](http://96.45.45.45) and the result is success. I also check with PowerShell:\n\nTest-NetConnection [96.45.45.45](http://96.45.45.45) \\-Port 53\n\nThe result is success.\n\nWhy does it say the GUI the validation error?\n\n  \nEdit: The server operatin system is Windows Server 2022. I tried it on Windows Server 2019 and 2016, but the validation is OK in the same network. Is it a Windows Server 2022 bug?","url":"https://www.reddit.com/r/sysadmin/comments/1p69vr5/windows_dns_forwarders_validation_error/","permalink":"/r/sysadmin/comments/1p69vr5/windows_dns_forwarders_validation_error/","score":4,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764069418.0,"edited":1764079978.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p65x1m","name":"t3_1p65x1m","subreddit":"sysadmin","author":"Critical-Brain2841","title":"Genuinely curious - would you use AI more if your data actually stayed private?","selftext":"Hey everyone, genuine and curious question here.\n\nI've been talking to a bunch of people lately about AI at work - ChatGPT, Claude, Copilot, all that stuff. And I keep hearing the same thing over and over: \"I'd use it way more, but I can't put client data into it\" or \"my compliance team would kill me.\"\n\nSo what happens? People either don't use AI at all and feel like they're falling behind, or they use it anyway and just... hope nobody finds out. I've even heard of folks spending 20 minutes scrubbing sensitive info before pasting anything in, which kind of defeats the whole point.\n\nI've been researching this space trying to figure out what people actually want, and honestly I'm a bit confused.\n\nLike, there's the self-hosting route (which I saw recently there's a post that went viral on self-hosting services). Full control, but from what I've seen the quality just isn't there compared to GPT-5 or Claude Opus 4.5 (which just came out and it's damn smart!). And you need decent hardware plus the technical know-how to set it up.\n\nThen there's the \"private cloud\" option - running better models but in your company's AWS or Azure environment. Sounds good in theory but someone still needs to set all that up and maintain it.\n\nOr you could just use the enterprise versions of ChatGPT and hope that \"enterprise\" actually means your data is safe. Easiest option but... are people actually trusting that?\n\nI guess I'm curious about two different situations:\n\nIf you're using AI for personal stuff - do you even care about data privacy? Are you fine just using ChatGPT/Claude as-is, or do you hold back on certain things?\n\nIf you're using AI at work - how does your company handle this? Do you have approved tools, or are you basically on your own figuring out what's safe to share? Do you find yourself scrubbing data before pasting, or just avoiding AI altogether for sensitive work?\n\nAnd for anyone who went the self-hosting route - is the quality tradeoff actually worth it for the privacy?\n\nI'm exploring building something in this space but honestly trying to figure out if this is a real problem people would pay to solve or if I'm just overthinking it.\n\nWould love to hear from both sides - whether you're using AI personally or at work.\n\nThanks :)","url":"https://www.reddit.com/r/sysadmin/comments/1p65x1m/genuinely_curious_would_you_use_ai_more_if_your/","permalink":"/r/sysadmin/comments/1p65x1m/genuinely_curious_would_you_use_ai_more_if_your/","score":3,"num_comments":39,"over_18":false,"stickied":false,"created_utc":1764054248.0,"edited":0.0,"link_flair_text":"ChatGPT","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6o10m","name":"t3_1p6o10m","subreddit":"sysadmin","author":"win10jd","title":"LLM AI solely on local hardware?","selftext":"I got a half \"request in passing\" about running an LLM 100% locally.   This is a Windows user.  Smart enough but not super tech savvy.  They'll be giving presentations and writing articles about this I'm sure since it's the topic of the day.  It wouldn't be a linux machine for sure.  This would be a typical user Windows desktop purchase, customized as far as the manufacturer does normally.  It wouldn't be a special build running linux with some special LLM AI on it.  Even the LLM software would be something \"off the shelf.\"  The user isn't a programmer or developer.  Maybe they know some python.  That level.\n\nMy main question is, does LLM software exist?  Does it actually run 100% on a local machine?  My impression with anything AI was that the actual processing was done in the power sucking, graphics card data centers, that those get trained up, and what comes out is that AI iteration.  If I'm using something like copilot on my laptop, that's just interfacing with me but the actual processing and creation of that processing is done on the data center side.  Is that correct?  Am I off?  Or, maybe take something running on the data center side, get a slimmed down version that's something like AI for writing email, and then that email-AI could run 100% on a local computer without sending any data out?  I'm thinking of deepseek there a bit maybe.  It's possible the user is thinking of an LLM that's just a python script too.\n\nIt may end up being a situation where the user is more talk than actual product.  That won't surprise me at all.  I have seen projects that never are fully realized but everyone gets to talk about it.  In terms of being able to spec out actual hardware, that's the next thing I'm wondering about.  If you have specs on anything LLM/AI that runs 100% on the machine, I'm curious.  And that runs Windows, and that is some kind of LLM software you can purchase off the shelf.  Another thought I had was that if you were really creating your own LLM/AI, that you would rent processing and space on those data centers (unless you actually built your own but that scale isn't happening for this user, and some thing off the shelf is only going to be a fraction of a data center's LLM/AI).  If you're renting processing like that on a data center, it probably doesn't matter what machine you're connecting with.  It wouldn't need to be the most powerful consumer-level desktop or laptop in existence since it's not doing the processing.  However, that's sending your data outside the organization.\n\nI'm curious on anyone's thought on the situation.  It's Windows-only user, non-programmer, excited about getting budget approval to do something with LLM and AI with whatever software you can just buy that does that.  Then they're write and present about it.  But if a computer is actually purchased, that's where my area comes in more.  If I had to guess, that budgeted amount is maybe up to $10,000.  This is also a user who will ask for the highest end machine they're aware of.  They've also insisted on hardware upgrades and new machines when it turned out they were doing projects on a remote server and didn't stress their local machine at all.  Insists they need a new computer, need more RAM, but then it turns out their computer isn't lifting a finger and that's just how long it takes a remote server to process their request.\n\nI could also see a situation where they get a test set up first as a proof of concept of whatever they do, and then scale it up from there.  Or maybe they want a $10,000 computer when a $5,000 one will work just fine.  Then they could get two computers I guess.","url":"https://www.reddit.com/r/sysadmin/comments/1p6o10m/llm_ai_solely_on_local_hardware/","permalink":"/r/sysadmin/comments/1p6o10m/llm_ai_solely_on_local_hardware/","score":3,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764103687.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6i6iw","name":"t3_1p6i6iw","subreddit":"sysadmin","author":"SpankG0rilla","title":"Anyone Ever Experienced Favoritism amongst their team?","selftext":"As the title suggests, I am in a team of 5 sysadmins and it seems like the manager has a honeymoon phase for this new admin that has started sinc  beginning of this year. We even had another admin get added later this year but isn’t as favorited as the other one.\n\nMy issue is every time I bring up a new solution to the team such as integrating Linux, Ansible, or even vulnerability scanner to our environment my manager would shrug it off and say he needs a full email breakdown of the solution.\n\nWhenever the new admin proposes a solution the manager will gladly make time for him. Join his meetings and even have him attend other meetings the rest of us are not invited to.\n\nI have spoken with my senior admin on our team and it seems like he doesn’t even get this much support compared to this new guy. He’s often said that he and our manager have been speaking less than before.\n\nI don’t want to be a lunatic about it but do I even trust this new admin? I was kind enough to get him under my wing when no one wanted to male time for him.\n\nIdk maybe I should start looking somewhere else. Team morale has really shifted ever since we noticed this with the new admin.","url":"https://www.reddit.com/r/sysadmin/comments/1p6i6iw/anyone_ever_experienced_favoritism_amongst_their/","permalink":"/r/sysadmin/comments/1p6i6iw/anyone_ever_experienced_favoritism_amongst_their/","score":2,"num_comments":25,"over_18":false,"stickied":false,"created_utc":1764090786.0,"edited":0.0,"link_flair_text":"Rant","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6hr0l","name":"t3_1p6hr0l","subreddit":"sysadmin","author":"slothmeister","title":"Asset Management for Small Business (150 machines)","selftext":"Hi,\n\nI've recently discovered that as a business we don't have an up to date asset database of our laptops/desktops, this is especially apparent after doing our upgrades to win 11, i have no idea what machines have been upgraded and what's being disposed of.\n\n  \nWe're a smallish business with 150 machines, a number of VMs, we're a hybrid domain, with some business units joined with entra and some with AD. \n\nI'm looking for a reasonably prices asset management system that does auto discovery for both domain types if possible, as we don't have a up to date database of our current devices.\n\nI've seen mentions of Snipe-IT before, that looks to be a great bit of software, but I can't seem to find a way of doing Auto discovery with it. Something like LanSweeper would be amazing, but we don't have the budget for anything like that. \n\nWe use Jira at the moment and I see that you can do management with that, but i'm having trouble find proper documentation for it on how to set it up. \n\nAny ideas would be welcome.","url":"https://www.reddit.com/r/sysadmin/comments/1p6hr0l/asset_management_for_small_business_150_machines/","permalink":"/r/sysadmin/comments/1p6hr0l/asset_management_for_small_business_150_machines/","score":3,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764089849.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6h3qz","name":"t3_1p6h3qz","subreddit":"sysadmin","author":"koecerion","title":"Exchange Online - Mailbox Corruption","selftext":"I'm trying to track down an item or item(s) in a user's mailbox that is causing OST corruption. We have an executive user with \\~60GB mailbox (been w/ firm 10+ yrs) with an even larger online archive.\n\nThe user recently did a large cleanup exercise as they were close to the 100GB online mailbox limit and delete a TON of items, mostly from the \"Other\" section of the focused inbox, but also wiped out sent, deleted, and purged from the recoverable items.\n\nA few days afterwards, the user logged in first thing and received a notice that \"Errors have been detected in the OST file <path>.\" Upon hitting \"OK\" it brings up the PST repair tool. We have allowed the repair tool to run through the weekend, however, upon the repair completing Outlook no longer syncs requiring a profile rebuild.\n\nI have a case open with Microsoft and they are having me run around rebuilding profiles/OST files and I have a second PC (with identical hardware) and a VM running that I check periodically which my team checks periodically throughout the day, we also have mouse jigglers running on both. Both systems have encountered the same corruption after having fully synced the mailbox.\n\nI have used MFCMAPI to remove any bogus rules & junk rules to no avail. Does anyone have any tools, scripts, or advice I can use to try and identify what is causing this issue?","url":"https://www.reddit.com/r/sysadmin/comments/1p6h3qz/exchange_online_mailbox_corruption/","permalink":"/r/sysadmin/comments/1p6h3qz/exchange_online_mailbox_corruption/","score":3,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764088419.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6gzb8","name":"t3_1p6gzb8","subreddit":"sysadmin","author":"ZADeltaEcho","title":"rsync.net outage?","selftext":"For the last day or so all our backups from all locations to [rsync.net](http://rsync.net) have been failing. Is anybody else experiencing this as well? \n\nI logged a support call a few hours back, no response as yet, and I tried to reach them telephonically, but also no luck. ","url":"https://www.reddit.com/r/sysadmin/comments/1p6gzb8/rsyncnet_outage/","permalink":"/r/sysadmin/comments/1p6gzb8/rsyncnet_outage/","score":3,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764088146.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p60wjv","name":"t3_1p60wjv","subreddit":"sysadmin","author":"F-001","title":"One touch ADF scanning to network share","selftext":"Can anyone suggest a cheap scanner/MFP with network support for 1 touch scanning to a network share? I want to set it up so employees can just load docs in the ADF, press SCAN and be done where the doc gets scanned and the file saved to a network share. Approx volume 400-500 A4s a day.\n\n  \nAny suggestions for cheap MFPs that will support this? TIA.","url":"https://www.reddit.com/r/sysadmin/comments/1p60wjv/one_touch_adf_scanning_to_network_share/","permalink":"/r/sysadmin/comments/1p60wjv/one_touch_adf_scanning_to_network_share/","score":3,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764038151.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p60eae","name":"t3_1p60eae","subreddit":"sysadmin","author":"StardwFarmr","title":"Any feedback on ManageEngine OS Deployer","selftext":"Our team is looking for a solution for deploying custom Windows 11 images. This one came in as a suggestion.\n\nAny advice or concerns about this product?","url":"https://www.reddit.com/r/sysadmin/comments/1p60eae/any_feedback_on_manageengine_os_deployer/","permalink":"/r/sysadmin/comments/1p60eae/any_feedback_on_manageengine_os_deployer/","score":3,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764036695.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6j0tw","name":"t3_1p6j0tw","subreddit":"sysadmin","author":"Maleficent_Data_4606","title":"How can i create guachamole proxy?","selftext":"Hello, I have one headquarters (HQ) where Apache Guacamole is installed, and I also have a few branch offices. There is no network connection between them. Is there a concept like a proxy server that would allow me to connect to all of them through a single Guacamole instance at the HQ? I want to set up a proxy server, open its ports to the outside, and then connect to the branch offices through the central Guacamole.","url":"https://www.reddit.com/r/sysadmin/comments/1p6j0tw/how_can_i_create_guachamole_proxy/","permalink":"/r/sysadmin/comments/1p6j0tw/how_can_i_create_guachamole_proxy/","score":2,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764092650.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6i949","name":"t3_1p6i949","subreddit":"sysadmin","author":"dacook11","title":"UCaaS","selftext":"I'm looking at migrating to a new hosted phone system a UCaaS system in particular. \n\nI am mainly looking at a RingCentral or Crexendo system. Anyone have experience with either? \n\nSupport\nATAs\nPhones\nVirtual phones\nApp\nCall quality\nPorting process","url":"https://www.reddit.com/r/sysadmin/comments/1p6i949/ucaas/","permalink":"/r/sysadmin/comments/1p6i949/ucaas/","score":2,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764090942.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6hton","name":"t3_1p6hton","subreddit":"sysadmin","author":"gnordli","title":"Windows 11 increase SMB Read Request Len (right now only 32K)","selftext":"Hi.  \n\nI have a remote user that was working OK with Windows 10.  After the upgrade to Windows 11 the SMB performance dropped off a cliff.   They have very high latency.  I have no baseline on how it was performing on Windows 10, but they were able to do their work.  \n\nI did some tracing with wireshark.  The Read Request Len is only 32K.   \n\nWhen I look at other machines I see large read request len like 2M.\n\nWhat knobs do I need to turn to get that Read Request Len increased?\n\nthanks!!\n\n\n\n ","url":"https://www.reddit.com/r/sysadmin/comments/1p6hton/windows_11_increase_smb_read_request_len_right/","permalink":"/r/sysadmin/comments/1p6hton/windows_11_increase_smb_read_request_len_right/","score":2,"num_comments":13,"over_18":false,"stickied":false,"created_utc":1764090017.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ef6g","name":"t3_1p6ef6g","subreddit":"sysadmin","author":"42stats_","title":"How to route emails to own (non exchange server) if smtp auth is enforced","selftext":"Hi, \n\n  \nHopefully, I am not on the wrong subreddit. We use teams, and with it come email addresses and exchange in azure. \n\nHowever, our email remains hosted on our own non exchange server. When we setup a teams meeting, invites are sent on behalf of us directly by exchange365 for external recipients and to the internal exchange mailboxes our domain teams addresses which we do not use...\n\n  \nI found the connectors, and tried to configure one to reroute outgoing email through our own server. However this fails because : \n\n \\- SMTP Auth is enforced by our server, and exchange does have our passwords.\n\n  \nMy question is how is it possible to make a connector that will send teams invites our own server, despite our server enforcing smtp auth?. \n\nIs it possible to specify a different mail from for the connector? \n\nThe second issue I have is that with restrictive dmarc policy, exchange will not be able to dkim sign our emails. Routing all email via our own server would make this simpler, but also has the problem of the smtp auth for sending email from our addresses.\n\n  \nI could not find documentation of that kind of use case. Maybe there is one explaining all this I just did not find yet, but you can point to me :)\n\n  \nRegards,","url":"https://www.reddit.com/r/sysadmin/comments/1p6ef6g/how_to_route_emails_to_own_non_exchange_server_if/","permalink":"/r/sysadmin/comments/1p6ef6g/how_to_route_emails_to_own_non_exchange_server_if/","score":2,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764082348.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6du5o","name":"t3_1p6du5o","subreddit":"sysadmin","author":"sccmguy","title":"Wake-on-LAN not working on newer Dell OptiPlex models w/ Intel I219-LM — anyone else seeing this?","selftext":"Looking for some feedback because I’ve been banging my head on this for a while and Dell Support hasn’t been very helpful.\n\nWe’re having **Wake-on-LAN failures on the newer Dell OptiPlex systems**, specifically the **OptiPlex 7020** using the **Intel I219-LM** NIC. All of our endpoints run **Windows 11 24H2 Enterprise**.\n\nThe issue:\n\n* If the machine is shut down normally (Start → Power → Shut down), the **NIC light goes completely off** and the system no longer listens for WOL packets.\n* If we perform a *hard power-off* (holding the power button), **WOL works perfectly**.\n* WOL works without any issues on **OptiPlex 3000 series and earlier** models in the same environment.\n\n**What we've tried:**\n\n* Disabled **Fast Startup**.\n* Verified all the usual NIC properties:\n   * *Wake on Magic Packet* enabled\n   * *Wake on pattern match* disabled\n   * *Allow this device to wake the computer* enabled\n   * *Only allow magic packet* enabled\n* Disabled **Energy-Efficient Ethernet** and other power savings features.\n* Checked BIOS settings:\n   * WOL enabled for both AC and DC power\n   * Deep Sleep Control disabled\n   * All power management/WOL-related settings confirmed to match older OptiPlex models that work\n   * Updated BIOS\n* Verified the system receives magic packets when powered off (it does).\n* Same network, same switches, same SCCM/WoL infrastructure—older Dell models are fine.\n\n# My suspicion\n\nIntel and Dell seem to be adopting newer energy-saving standards on the latest NICs, and something about modern shutdown states may be putting the NIC into a deeper off state than before. However, Dell Support hasn’t been able to confirm anything, and their guidance has mostly been generic “enable WOL in BIOS” and “reinstall drivers.”\n\n# Question for the community\n\n**Has anyone else run into this issue on the newer Dell models (OptiPlex 7020, 7010, Latitude 5000/7000 series, etc.) using the I219-LM NIC on Windows 11?**\n\nIf so:\n\n* Did you find a workaround or BIOS setting that fixes it?\n* Is this an Intel driver/firmware bug?\n* Is this tied to Modern Standby or newer ACPI states in Win11?\n* Did Dell provide any real solution?\n\nAny insights or shared experiences would be hugely appreciated. This is the last major blocker for fully using WoL on our newest hardware.\n\nThanks in advance!","url":"https://www.reddit.com/r/sysadmin/comments/1p6du5o/wakeonlan_not_working_on_newer_dell_optiplex/","permalink":"/r/sysadmin/comments/1p6du5o/wakeonlan_not_working_on_newer_dell_optiplex/","score":2,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764080920.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p65dbp","name":"t3_1p65dbp","subreddit":"sysadmin","author":"Diligent_Sundae7209","title":"Windows 11 signed in user and remotely signing in user limitation","selftext":"I'm relying on a signed in user to establish wireless connectivity for the user to remotely sign in the machine. However, once remotely signed in even with a different user, there will be a prompt to sign out the currently signed in user. This will then logoff the user and disconnect the wifi. Is there  away around this?","url":"https://www.reddit.com/r/sysadmin/comments/1p65dbp/windows_11_signed_in_user_and_remotely_signing_in/","permalink":"/r/sysadmin/comments/1p65dbp/windows_11_signed_in_user_and_remotely_signing_in/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764052262.0,"edited":1764057932.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p60q0z","name":"t3_1p60q0z","subreddit":"sysadmin","author":"Bodybraille","title":"Looking for guidance from fellow sysadmins","selftext":"Sys admin ready to leave the world of application packaging, printers, endpoint hardening, and vulnerability management.  \n\nI have an AAS in Information Security from 2015. Landed my first real IT job in 2018. Started out as help desk/desktop support. Moved up into AD/SCCM/Intune/Jamf. I primarily work in  Intune and Jamf creating app packages, config profiles, and monitoring vulnerabilities (nessus/absolute). \n\nI'm ready to get my bachelors and move up into a manager position, and eventually into a C-level job.  \n\nWith AI on the horizon and everything becoming more automated, what bachelors is worthwhile? AI machine learning? Security? Computer science l? When I look at these online schools, the options are endless.  I would prefer security, but will it be relevant 5 to 10 years from now?\n\nWas hoping to get some insight from people who have been in the game longer than me. \n\nThanks! \n","url":"https://www.reddit.com/r/sysadmin/comments/1p60q0z/looking_for_guidance_from_fellow_sysadmins/","permalink":"/r/sysadmin/comments/1p60q0z/looking_for_guidance_from_fellow_sysadmins/","score":2,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764037633.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6spfc","name":"t3_1p6spfc","subreddit":"sysadmin","author":"Maclovin-it","title":"Remote desktop apps and session host","selftext":"I have the dumb, and can't remember how I did this in the past.\n\nI have 3 servers, a broker, and 2 RDP servers.\n\nI have a single remote app, and it works fine from a windows device.  Balances across servers and all.\n\nI have dumb terminals in the building, and need to share a session host. I'd like it to be load balanced between the 2 RDP servers.  \nHow do I add both the app, and session host?","url":"https://www.reddit.com/r/sysadmin/comments/1p6spfc/remote_desktop_apps_and_session_host/","permalink":"/r/sysadmin/comments/1p6spfc/remote_desktop_apps_and_session_host/","score":1,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764115032.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6rvhp","name":"t3_1p6rvhp","subreddit":"sysadmin","author":"NoelCanter","title":"Anyone now have MS Edge blocking favorite imports from files?","selftext":"We started getting some reports today in our enterprise that people couldn’t import favorites anymore. We would export to a file and then import that file on other workstations/laptops/AVD profiles, but now in MS Edge 142 when they go to “choose file” it is disabled. \n\nWe follow DISA STIG settings and do have importing browser history and data disabled, but I was able to pull up an old virtual desktop with Edge 140 on it and everything worked fine. As soon as that machine session updates to 142 it’s broken. It feels like whatever changes they made (like I noticed import from Firefox is in there) it maybe is taking the user ability to import and lumping it into the disabled GPO policy where it didn’t before. \n\nI haven’t been able to locate documentation of this change. Has anyone been dealing with it? Does anyone know of documentation I can refer to?","url":"https://www.reddit.com/r/sysadmin/comments/1p6rvhp/anyone_now_have_ms_edge_blocking_favorite_imports/","permalink":"/r/sysadmin/comments/1p6rvhp/anyone_now_have_ms_edge_blocking_favorite_imports/","score":1,"num_comments":3,"over_18":false,"stickied":false,"created_utc":1764112857.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6o5cs","name":"t3_1p6o5cs","subreddit":"sysadmin","author":"Bad_Mechanic","title":"Recommend a free/low cost CRM for internal IT use?","selftext":"I'd like to bring in a low cost or free CRM for me to use to help manage and sustain my relationship with key stakeholders in my company. I'm very much an introvert, generic IT guy, so having something empirical to help manage my  key relationships would be useful to me. I don't need powerful, and simpler would be (much) better.","url":"https://www.reddit.com/r/sysadmin/comments/1p6o5cs/recommend_a_freelow_cost_crm_for_internal_it_use/","permalink":"/r/sysadmin/comments/1p6o5cs/recommend_a_freelow_cost_crm_for_internal_it_use/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764103973.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6lgrj","name":"t3_1p6lgrj","subreddit":"sysadmin","author":"modem_19","title":"What is needed to setup an Azure AD / Entra AD Before Joining Clients?","selftext":"Hopefully this is the right group to post in.\n\nI'm helping someone out with a small office setup get more secure and move away from their local admin logins (no server logins currently). I would like to get them on Azure AD.  I am familiar with joining client PC's to an Azure AD with ProfWiz and a pre-created .xml file.  But my main question is what do I need to do on the back end to get Azure AD setup?\n\nThis client already has a Microsoft 365 business tenant with users already setup on Exchange, Business Std licenses and so forth. They obviously have Entra/Azure as part of that subscription.\n\nI'd just like to know how to know what things I need to do on the back end in order for Azure AD to accept clients joining to it?  The IT office I work at during the day stated Azure AD has to be configured on the back end first, but never mentioned what needed configuring.\n\nThanks!","url":"https://www.reddit.com/r/sysadmin/comments/1p6lgrj/what_is_needed_to_setup_an_azure_ad_entra_ad/","permalink":"/r/sysadmin/comments/1p6lgrj/what_is_needed_to_setup_an_azure_ad_entra_ad/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764097938.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6jcjw","name":"t3_1p6jcjw","subreddit":"sysadmin","author":"Majestic_Annual_5956","title":"Conditional Access Issues","selftext":"I'm running into a Conditional Access issue that I can't seem to untangle. I'm trying to block access to Office 365 web portals from unmanaged devices, but my managed Windows devices are still getting blocked because they're showing up as “Unknown” in the CA sign-in logs.\n\nDetails:\n\n• The policy is set to block unmanaged devices  \n• I’m using a device filter to exclude Azure AD Joined, Hybrid AD Joined, and Intune-compliant devices  \n• The filter looks like:  \n`device.trustType -eq \"AzureAd\" -or device.trustType -eq \"ServerAd\" -or device.isCompliant -eq True`  \n• Despite this, browser access to [Office.com](http://Office.com) / O365 portals still gets blocked  \n• The Conditional Access sign-in logs show “Unknown” under device info  \n• The workstation is correctly Azure AD Joined, has a valid PRT, but wasn’t Workplace Joined  \n• We are testing this mainly in Google Chrome. \n\nWhat I’m trying to accomplish:\n\n• Block all unmanaged devices  \n• Allow Azure AD Joined, Hybrid Joined, and Intune-compliant devices to access O365 web portals  \n• No BYOD or personal device access\n\nHas anyone run into CA policies ignoring device filters, or devices appearing as Unknown even when the join/PRT state looks correct? Any idea what else could force the block despite an exclude filter?\n\nAny guidance would be appreciated — I’m clearly missing something in CA evaluation order.","url":"https://www.reddit.com/r/sysadmin/comments/1p6jcjw/conditional_access_issues/","permalink":"/r/sysadmin/comments/1p6jcjw/conditional_access_issues/","score":1,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764093364.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6g6wf","name":"t3_1p6g6wf","subreddit":"sysadmin","author":"sysbadger","title":"Career advice","selftext":"Hi all,\n\n  \nI'm about to start looking for a new role, but unsure what position I should be aiming for.  I'm the IT manager for a small/medium business of 70 employees.  I cover several areas including Operations, cybersecurity and compliance.  A typical day includes:\n\n* Acting as 3rd line support if the two service desk guys can't fix it.\n* Performing an internal audits in preparation for the ISO 27001 audit, re-writing policies and designing new technical controls.\n* Creating new InTune compliance and app protection polices to meet best practice and pass Cyber Essentials.\n* Running training sessions with my two guys to help them pass their exams.\n* Updating firewall rules.\n* Setting up low-code automation to perform various cybersecurity and ISO checks in the absence of a 'proper solution'.\n* Completing tender documentation relating to our information security practices.\n* Doing all the usual admin across a 365 tenant and admin centres.\n* Powershell, Python scripting.\n* Running various projects.\n\n  \nI have my OSCP and CISSP certifications and should have CISM in the next month or two.  I've been working in IT for 20 years.  I want to move into a senior leadership role with a different employer, focusing more on cybersecurity rather than the mix of responsibilities I have now. However I'm concerned about the following:\n\n* The company I work for is small and has a very restricted budget.  Consequently, I lack the exposure of the technologies that larger organisations use.  SIEM, SOAR 'threat intelligence'.  Yes I've heard of them, but I have no direct exposure.\n* I've tried to compensate my lack of exposure for certifications.  The CISSP is relevant to my current job due to the ISO 27001 and Cyber Essentials requirements.  OSCP, not so much.\n\nAm I going to be 'found out'?  For having the paperwork but not the exposure to all the technologies listed on the job adverts?  I'm unsure what job role I should be applying for as I feel like I have a very mixed bag of skills rather than a pure cyber security focus.\n\nAll advice appreciated, sorry for the ramble!","url":"https://www.reddit.com/r/sysadmin/comments/1p6g6wf/career_advice/","permalink":"/r/sysadmin/comments/1p6g6wf/career_advice/","score":1,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764086406.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6f06f","name":"t3_1p6f06f","subreddit":"sysadmin","author":"Deadly-Unicorn","title":"Migrate VMWare to HyperV - Information","selftext":"Hi Everyone,\n\n  \nI am looking for information/guide on migrating my VMWare environment 6 hosts to HyperV. I also have 3 SANs. Long story short based on the cost of my renewal it would only make sense to go to HyperV otherwise I might as well pay VMWare the premium and stick with them. Anything else would save me maybe 20-30% which I would prefer to just pay for the devil I already know. HyperV would be free because I have datacenter licensing. \n\n  \nThe first issue I have had getting this quoted as a service. Its been strange. Usually MSPs are happy to send out a quote but I have mentioned this project to at least 4 or 5 different ones over the course of a year and they all seem excited but then go totally quiet. I have never seen this before honestly. Has anyone else had this experience? I would've thought with everything going on they'd all be ready and waiting to take on easily justifiable jobs, as in if my renewal is $50000, and migrating me was $15000, its an easy yes. I'd appreciate insight from anyone at an MSP on this.\n\n  \nI could also take care of this myself if it came down to it but I have this sense of discomfort about it, sort of like when you want to buy a new car and you are really sure but not totally sure yet. This is because I feel I don't have a full picture on what hyperV will look like. From what I've gathered for my use case which is basic (VMware standard), HyperV will do everything I need. Do I just install windows OS on each host and then the VMs live on the host or does HyperV have its own ESXi equivalent host OS? Is there a VCSA like appliance in HyperV that would act as a manager? If I install HyperV 2025, do I get patched and everything until 2025 is EOS/EOL?\n\nDoes anyone have a good guide that shows installing on multiple hosts with a SAN? I have watched through many guides but they are all a bit different somehow. Have any other former VMWare users had apprehensions and found a resource that helped clear it up?","url":"https://www.reddit.com/r/sysadmin/comments/1p6f06f/migrate_vmware_to_hyperv_information/","permalink":"/r/sysadmin/comments/1p6f06f/migrate_vmware_to_hyperv_information/","score":1,"num_comments":11,"over_18":false,"stickied":false,"created_utc":1764083710.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6eeos","name":"t3_1p6eeos","subreddit":"sysadmin","author":"pvtskidmark","title":"EXO - Add-MailboxFolderPermission to User's Calendar Fails - \"wasn't found in the store.\"","selftext":"Wondering if anyone has successfully figured out the path to resolving and/or why in rare cases, Add-MailboxFolderPermission to a User's Calendar might fail?\n\n`Add-MailboxFolderPermission han.solo@rebels.org:\\Calendar -User luke.skywalker@rebels.org -AccessRights limiteddetails`\n\nIt's not a threshold thing for this person as they have 48 people already added.  Their \"Calendar\" is spelled correctly and it's not some weirdly renamed primary Calendar folder.\n\nMicrosoft Support suggested \"New-MailboxRepairRequest,\" which is kind of funny as that does not apply to EXO.  They then suggested \"New-MailboxFolder -Parent \"$Mailbox:\\\\Top of Information Store\" -Name Calendar\" which documentation says \"Administrators can't use this cmdlet to create folders in other mailboxes.\"\n\nThis seems like a situation in which only Microsoft could resolve?  In the past, I have a couple of tickets like that.  One in which a User's AutoDiscover stopped working and one in which a User couldn't open their email at all, whether it was from the Desktop Outlook Client or OWA in https://myapps.microsoft.com.\n\nThe error I receive:\n\n>PS>Add-MailboxFolderPermission han.solo@rebels.org:\\\\Calendar -AccessRights limiteddetails -User luke.skywalker@rebels.org\n\n>PS>TerminatingError(Invoke-WebRequest): \"{\"error\":{\"code\":\"InternalServerError\",\"message\":\"Error executing cmdlet\",\"details\":\\[{\"code\":\"0\",\"target\":\"\",\"message\":\"{\\\\\"Properties\\\\\":{\\\\\"message\\\\\":{\\\\\"Value\\\\\":\\\\\"An item with the specified id 'LgAAAAAH4ezDpEt8S4Q3MPhz7oL6AQDGfl1Lg7anRpEiL+sOqfecAAAAwz3+AAAB' wasn't found in the store.\\\\\",\\\\\"TypeAnnotation\\\\\":null},\\\\\"type\\\\\":{\\\\\"Value\\\\\":\\\\\"Microsoft.Exchange.Data.StoreObjects.ObjectNotFoundException\\\\\",\\\\\"TypeAnnotation\\\\\":null},\\\\\"stacktrace\\\\\":{\\\\\"TypeAnnotation\\\\\":null}},\\\\\"Message\\\\\":\\\\\"An item with the specified id 'LgAAAAAH4ezDpEt8S4Q3MPhz7oL6AQDGfl1Lg7anRpEiL+sOqfecAAAAwz3+AAAB' wasn't found in the store.\\\\\",\\\\\"TypeName\\\\\":\\\\\"Microsoft.Exchange.Data.StoreObjects.ObjectNotFoundException\\\\\",\\\\\"StackTrace\\\\\":null,\\\\\"InnerError\\\\\":{\\\\\"Properties\\\\\":{\\\\\"message\\\\\":{\\\\\"Value\\\\\":\\\\\"Item not found.\\\\\",\\\\\"TypeAnnotation\\\\\":null},\\\\\"type\\\\\":{\\\\\"Value\\\\\":\\\\\"Microsoft.Exchange.Data.StoreObjects.ObjectNotFoundException\\\\\",\\\\\"TypeAnnotation\\\\\":null},\\\\\"stacktrace\\\\\":{\\\\\"TypeAnnotation\\\\\":null}},\\\\\"Message\\\\\":\\\\\"Item not found.\\\\\",\\\\\"TypeName\\\\\":\\\\\"Microsoft.Exchange.Data.StoreObjects.ObjectNotFoundException\\\\\",\\\\\"StackTrace\\\\\":null,\\\\\"InnerError\\\\\":null}}\"}\\],\"innererror\":{\"message\":\"Error executing cmdlet\",\"type\":\"Microsoft.Exchange.Admin.OData.Core.ODataServiceException\",\"stacktrace\":\"\",\"internalexception\":{\"message\":\"Exception of type 'Microsoft.Exchange.Management.PSDirectInvoke.DirectInvokeCmdletExecutionException' was thrown.\",\"type\":\"Microsoft.Exchange.Management.PSDirectInvoke.DirectInvokeCmdletExecutionException\",\"stacktrace\":\"\"}},\"adminapi.warnings@odata.type\":\"#Collection(String)\",\"@adminapi.warnings\":\\[\\]}}\"\n\n>Write-ErrorMessage : ||An item with the specified id 'LgAAAAAH4ezDpEt8S4Q3MPhz7oL6AQDGfl1Lg7anRpEiL+sOqfecAAAAwz3+AAAB' \n\n>wasn't found in the store.\n\n>  \nPS>$error\\[0\\] | fl \\* -force\n\n>WriteErrorStream      : True\n\n>PSMessageDetails      :\n\n>Exception             : System.Exception: ||An item with the specified id 'LgAAAAAH4ezDpEt8S4Q3MPhz7oL6AQDGfl1Lg7anRpEiL+sOqfecAAAAwz3+AAAB' wasn't found in the store.\n\n>TargetObject          :\n\n>CategoryInfo          : NotSpecified: (:) \\[Add-MailboxFolderPermission\\], ObjectNotFoundException\n\n>FullyQualifiedErrorId : \\[Server=SA9PR09MB5630,RequestId=0d76c521-ec20-c186-6850-8cd90009bbbc,TimeStamp=Thu, 20 Nov 2025 21:06:05 GMT\\],Write-ErrorMessage\n\n>ErrorDetails          :\n\n>InvocationInfo        : System.Management.Automation.InvocationInfo","url":"https://www.reddit.com/r/sysadmin/comments/1p6eeos/exo_addmailboxfolderpermission_to_users_calendar/","permalink":"/r/sysadmin/comments/1p6eeos/exo_addmailboxfolderpermission_to_users_calendar/","score":1,"num_comments":11,"over_18":false,"stickied":false,"created_utc":1764082316.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6dth9","name":"t3_1p6dth9","subreddit":"sysadmin","author":"sccmguy","title":"Wake-on-LAN not working on newer Dell OptiPlex models w/ Intel I219-LM — anyone else seeing this?","selftext":"Looking for some feedback because I’ve been banging my head on this for a while and Dell Support hasn’t been very helpful.\n\nWe’re having **Wake-on-LAN failures on the newer Dell OptiPlex systems**, specifically the **OptiPlex 7020** using the **Intel I219-LM** NIC. All of our endpoints run **Windows 11 24H2 Enterprise**.\n\nThe issue:\n\n* If the machine is shut down normally (Start → Power → Shut down), the **NIC light goes completely off** and the system no longer listens for WOL packets.\n* If we perform a *hard power-off* (holding the power button), **WOL works perfectly**.\n* WOL works without any issues on **OptiPlex 3000 series and earlier** models in the same environment.\n\n**What we've tried:**\n\n* Disabled **Fast Startup**.\n* Verified all the usual NIC properties:\n   * *Wake on Magic Packet* enabled\n   * *Wake on pattern match* disabled\n   * *Allow this device to wake the computer* enabled\n   * *Only allow magic packet* enabled\n* Disabled **Energy-Efficient Ethernet** and other power savings features.\n* Checked BIOS settings:\n   * WOL enabled for both AC and DC power\n   * Deep Sleep Control disabled\n   * All power management/WOL-related settings confirmed to match older OptiPlex models that work\n   * Updated BIOS\n* Verified the system receives magic packets when powered off (it does).\n* Same network, same switches, same SCCM/WoL infrastructure—older Dell models are fine.\n\n# My suspicion\n\nIntel and Dell seem to be adopting newer energy-saving standards on the latest NICs, and something about modern shutdown states may be putting the NIC into a deeper off state than before. However, Dell Support hasn’t been able to confirm anything, and their guidance has mostly been generic “enable WOL in BIOS” and “reinstall drivers.”\n\n# Question for the community\n\n**Has anyone else run into this issue on the newer Dell models (OptiPlex 7020, 7010, Latitude 5000/7000 series, etc.) using the I219-LM NIC on Windows 11?**\n\nIf so:\n\n* Did you find a workaround or BIOS setting that fixes it?\n* Is this an Intel driver/firmware bug?\n* Is this tied to Modern Standby or newer ACPI states in Win11?\n* Did Dell provide any real solution?\n\nAny insights or shared experiences would be hugely appreciated. This is the last major blocker for fully using WoL on our newest hardware.\n\nThanks in advance!","url":"https://www.reddit.com/r/sysadmin/comments/1p6dth9/wakeonlan_not_working_on_newer_dell_optiplex/","permalink":"/r/sysadmin/comments/1p6dth9/wakeonlan_not_working_on_newer_dell_optiplex/","score":1,"num_comments":1,"over_18":false,"stickied":false,"created_utc":1764080875.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6d2n2","name":"t3_1p6d2n2","subreddit":"sysadmin","author":"richie65","title":"o365 admin portal search for user question","selftext":"To start off with - Yes - I know I can use the search box on the page, to find users...\n\nI was hoping one of you knows a way to search via the URL - So (presuming I already have authenticated in another tab) I can form the URL via a (PoSh) script with a first and / or last name, and open a browser window with those search results already done, so I can just click and open the desired user.\n\nAs an example (I know this wont work):\n\n`Start \"https://admin.microsoft.com/Adminportal/Home#/Users?Rogers\"`\n\nHere is what the 'Search' Inputbox element looks like:\n\n<input elementtiming=\"1289\" data-is-focusable=\"false\" data-automation-id=\"UserListV2,CommandBarSearchInputBox\" id=\"SearchBox338\" class=\"ms-SearchBox-field field-611\" placeholder=\"Search active users list \" role=\"searchbox\" aria-label=\"Press Enter key to search active users list\" value=\"Rogers\" tabindex=\"-1\">\n\n\nI never really got good enough with HTML (et. al.) to understand how to fully dissect the page elements...","url":"https://www.reddit.com/r/sysadmin/comments/1p6d2n2/o365_admin_portal_search_for_user_question/","permalink":"/r/sysadmin/comments/1p6d2n2/o365_admin_portal_search_for_user_question/","score":1,"num_comments":6,"over_18":false,"stickied":false,"created_utc":1764079001.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p65bzv","name":"t3_1p65bzv","subreddit":"sysadmin","author":"IndividualToday3799","title":"Looking for a ticketing tool thats not too expensive for a small business.","selftext":"  \n\n\nSo I work in IT for a global retail company, we had change of owners recently and the new owners want each market (country) to manage their market and take decisions that suit the country.\n\nPreviously, we were relying on our global IT for everything (service desk, ServcieNow for ITSM, Microsoft and everything). With that we are seperating our IT, business and POS systems. We are almost done with a lot of seperation projects and now we are setting up for BAU. Our's is a small team (only 2) and we both are not IT gurus (yes, we are learning as we go).\n\nWe don't want to go down route of MSP for a lot of reasons, so we are looking to outsource SOC, and based on product there are companies that can support. Between me and the other IT staff, we both can triage and support where we can. We want to have a ticketing tool to manage incidents, take requests (using customer portal), where multiple teams or lince managers can approve things. Can someone suggest a ticketing tool, that can support with above, need a flat price, not based on agents, need something that can integrate with Microsoft, have multiple channels to raise tickets (emails, chat, phone, customer portal).","url":"https://www.reddit.com/r/sysadmin/comments/1p65bzv/looking_for_a_ticketing_tool_thats_not_too/","permalink":"/r/sysadmin/comments/1p65bzv/looking_for_a_ticketing_tool_thats_not_too/","score":1,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764052130.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p63pr7","name":"t3_1p63pr7","subreddit":"sysadmin","author":"rezer3","title":"Security for small business?","selftext":"What are some services I can use to protect customer data for my online small business? I've turned on 2 Factor Verification for my CRM, email, Docusign, and all other services I put customer data in.\n\nI saw Zoho was offering something called eProtect to catch phishing emails. Any similar services? Any other security recommendations?","url":"https://www.reddit.com/r/sysadmin/comments/1p63pr7/security_for_small_business/","permalink":"/r/sysadmin/comments/1p63pr7/security_for_small_business/","score":1,"num_comments":14,"over_18":false,"stickied":false,"created_utc":1764046626.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6se16","name":"t3_1p6se16","subreddit":"sysadmin","author":"mike6545","title":"Setting up iPad (kiosk style) to use at unmanned photobooth - Apple Configurator Help Needed","selftext":"I'm at my wits end. I'm so close with help from chatGPT but now stalled on a single issue! I have an outdoor photo booth that needs to run 24/7 without anyone working near it.\n\nI've gone through many iterations to get the ipad to stay on one app 24/7 and if it crashes, reboot to the same app, and not let anyone enter the password wrong too many times to brick it. (guided access, assisted access, single app mode)\n\nipad is supervised and in Single App Mode via apple configurator. Most gestures disabled to prevent swiping into notification center or control center. **The only issue i have left is that when the battery dies to 0% on a very cold night, when the ipad reboots it reboots to a lock screen instead of back to the single app.** Any way to disable this because chatgpt spun me in circles and then said it's not possible.\n\n* Currently when this happens, i can't swipe up cause i disabled those gestures so i need to unlock it with a keyboard.\n* When i do unlock it, it shows me some setup steps for ipadOS 26.1 for some reason. (wifi, setup apple intelligence, a couple other random ones) even though i've already set this up. So even if swipe-up was enabled, the random users would have to go through this setup.\n\nBelow are all the random payload keys that i either put in through configurator or chatgpt had me add in manually to the file. (formatting in reddit is a bit off)\n\n**Is there any way to make this work for me?**\n\n    <key>PayloadVersion</key>\n    <integer>1</integer>\n                <key>SkipWiFi</key>\n                <true/>\n                <key>SkipiCloudSetup</key>\n                <true/>\n                <key>SkipSiri</key>\n                <true/>\n                <key>SkipScreenTime</key>\n                <true/>\n                <key>SkipDiagnostics</key>\n                <true/>\n                <key>SkipRestore</key>\n                <true/>\n                <key>SkipAppleID</key>\n                <true/>\n                <key>SkipAccessibility</key>\n                <true/>\n    <key>allowActivityContinuation</key>\n    <true/>\n    <key>allowAddingGameCenterFriends</key>\n    <true/>\n    <key>allowAirPlayIncomingRequests</key>\n    <false/>\n    <key>allowAirPrint</key>\n    <false/>\n    <key>allowAirPrintCredentialsStorage</key>\n    <false/>\n    <key>allowAirPrintiBeaconDiscovery</key>\n    <true/>\n    <key>allowAppCellularDataModification</key>\n    <true/>\n    <key>allowAppClips</key>\n    <true/>\n    <key>allowAppInstallation</key>\n    <true/>\n    <key>allowAppRemoval</key>\n    <true/>\n    <key>allowApplePersonalizedAdvertising</key>\n    <true/>\n    <key>allowAssistant</key>\n    <false/>\n    <key>allowAssistantWhileLocked</key>\n    <true/>\n    <key>allowAutoCorrection</key>\n    <true/>\n    <key>allowAutoUnlock</key>\n    <true/>\n    <key>allowAutomaticAppDownloads</key>\n    <true/>\n    <key>allowBluetoothModification</key>\n    <true/>\n    <key>allowBookstore</key>\n    <false/>\n    <key>allowBookstoreErotica</key>\n    <true/>\n    <key>allowCamera</key>\n    <true/>\n    <key>allowCellularPlanModification</key>\n    <true/>\n    <key>allowChat</key>\n    <false/>\n    <key>allowCloudBackup</key>\n    <true/>\n    <key>allowCloudDocumentSync</key>\n    <false/>\n    <key>allowCloudKeychainSync</key>\n    <false/>\n    <key>allowCloudPhotoLibrary</key>\n    <false/>\n    <key>allowContinuousPathKeyboard</key>\n    <true/>\n    <key>allowDefinitionLookup</key>\n    <true/>\n    <key>allowDeviceNameModification</key>\n    <true/>\n    <key>allowDeviceSleep</key>\n    <false/>\n    <key>allowDictation</key>\n    <true/>\n    <key>allowESIMModification</key>\n    <true/>\n    <key>allowESIMOutgoingTransfers</key>\n    <true/>\n    <key>allowEnablingRestrictions</key>\n    <false/>\n    <key>allowEnterpriseAppTrust</key>\n    <true/>\n    <key>allowEnterpriseBookBackup</key>\n    <true/>\n    <key>allowEnterpriseBookMetadataSync</key>\n    <true/>\n    <key>allowEraseContentAndSettings</key>\n    <true/>\n    <key>allowExplicitContent</key>\n    <true/>\n    <key>allowFilesNetworkDriveAccess</key>\n    <true/>\n    <key>allowFilesUSBDriveAccess</key>\n    <true/>\n    <key>allowFindMyDevice</key>\n    <true/>\n    <key>allowFindMyFriends</key>\n    <true/>\n                <key>allowSlideOver</key>\n                <false/>\n    <key>allowFingerprintForUnlock</key>\n    <true/>\n    <key>allowFingerprintModification</key>\n    <true/>\n    <key>allowGameCenter</key>\n    <false/>\n    <key>allowGlobalBackgroundFetchWhenRoaming</key>\n    <true/>\n    <key>allowImagePlayground</key>\n    <false/>\n    <key>allowInAppPurchases</key>\n    <false/>\n    <key>allowKeyboardShortcuts</key>\n    <false/>\n    <key>allowLiveVoicemail</key>\n    <false/>\n    <key>allowLockScreenControlCenter</key>\n    <false/>\n                <key>allowControlCenter</key>\n                <false/>\n    <key>allowLockScreenNotificationsView</key>\n    <false/>\n                <key>allowNotificationCenter</key>\n                <false/>\n    <key>allowLockScreenTodayView</key>\n    <false/>\n                <key>allowLockScreen</key>\n                <false/>\n                <key>allowPasscodeModification</key>\n                <false/>\n                <key>forceAirDropUnmanaged</key>\n                <false/>\n    <key>allowManagedAppsCloudSync</key>\n    <true/>\n                <key>skipUnlockOnBoot</key>\n                <true/>\n                <key>allowAutoLock</key>\n                <false/>\n    <key>allowMarketplaceAppInstallation</key>\n    <true/>\n    <key>allowMultiplayerGaming</key>\n    <true/>\n    <key>allowMusicService</key>\n    <false/>\n    <key>allowNews</key>\n    <false/>\n    <key>allowNotificationsModification</key>\n    <true/>\n    <key>allowOpenFromManagedToUnmanaged</key>\n    <true/>\n    <key>allowOpenFromUnmanagedToManaged</key>\n    <true/>\n    <key>allowPairedWatch</key>\n    <false/>\n    <key>allowPassbookWhileLocked</key>\n    <false/>\n    <key>allowPasswordAutoFill</key>\n    <false/>\n    <key>allowPasswordProximityRequests</key>\n    <false/>\n    <key>allowPasswordSharing</key>\n    <false/>\n    <key>allowPersonalHotspotModification</key>\n    <true/>\n    <key>allowPersonalizedHandwritingResults</key>\n    <false/>\n    <key>allowPhotoStream</key>\n    <false/>\n    <key>allowPodcasts</key>\n    <true/>\n    <key>allowPredictiveKeyboard</key>\n    <false/>\n                <key>forceAutomaticKeyboard</key>\n                <false/>\n    <key>allowProximitySetupToNewDevice</key>\n    <false/>\n    <key>allowRadioService</key>\n    <false/>\n    <key>allowRemoteAppPairing</key>\n    <false/>\n    <key>allowRemoteScreenObservation</key>\n    <true/>\n    <key>allowSafari</key>\n    <true/>\n    <key>allowScreenShot</key>\n    <true/>\n    <key>allowSharedStream</key>\n    <false/>\n    <key>allowSpellCheck</key>\n    <true/>\n    <key>allowSpotlightInternetResults</key>\n    <false/>\n    <key>allowSystemAppRemoval</key>\n    <true/>\n    <key>allowUIAppInstallation</key>\n    <true/>\n    <key>allowUIConfigurationProfileInstallation</key>\n    <true/>\n    <key>allowUSBRestrictedMode</key>\n    <true/>\n    <key>allowUnpairedExternalBootToRecovery</key>\n    <false/>\n    <key>allowUntrustedTLSPrompt</key>\n    <true/>\n    <key>allowVPNCreation</key>\n    <true/>\n    <key>allowVideoConferencing</key>\n    <false/>\n    <key>allowVoiceDialing</key>\n    <false/>\n    <key>allowWallpaperModification</key>\n    <true/>\n    <key>allowiTunes</key>\n    <false/>\n    <key>forceAirPrintTrustedTLSRequirement</key>\n    <false/>\n    <key>forceAssistantProfanityFilter</key>\n    <false/>\n    <key>forceAuthenticationBeforeAutoFill</key>\n    <false/>\n    <key>forceAutomaticDateAndTime</key>\n    <false/>\n    <key>forceClassroomAutomaticallyJoinClasses</key>\n    <false/>\n    <key>forceClassroomRequestPermissionToLeaveClasses</key>\n    <false/>\n    <key>forceClassroomUnpromptedAppAndDeviceLock</key>\n    <false/>\n    <key>forceClassroomUnpromptedScreenObservation</key>\n    <false/>\n    <key>forceDelayedSoftwareUpdates</key>\n    <false/>\n    <key>forceEncryptedBackup</key>\n    <false/>\n    <key>forceITunesStorePasswordEntry</key>\n    <false/>\n    <key>forceLimitAdTracking</key>\n    <false/>\n    <key>forcePreserveESIMOnErase</key>\n    <false/>\n    <key>forceWatchWristDetection</key>\n    <false/>\n    <key>forceWiFiPowerOn</key>\n    <false/>\n    <key>forceWiFiWhitelisting</key>\n    <false/>\n    <key>ratingApps</key>\n    <integer>1000</integer>\n    <key>ratingMovies</key>\n    <integer>1000</integer>\n    <key>ratingRegion</key>\n    <string>us</string>\n    <key>ratingTVShows</key>\n    <integer>1000</integer>\n    <key>safariAcceptCookies</key>\n    <real>2</real>\n    <key>safariAllowAutoFill</key>\n    <true/>\n    <key>safariAllowJavaScript</key>\n    <true/>\n    <key>safariAllowPopups</key>\n    <true/>\n    <key>safariForceFraudWarning</key>\n    <false/>\n                <key>allowNotificationCenterShortcuts</key>\n                <false/>\n                <key>allowNotificationCenterWhileLocked</key>\n                <false/>\n                <key>allowControlCenterShortcuts</key>\n                <false/>\n                <key>allowControlCenterWhileLocked</key>\n                <false/>\n                <key>allowTodayView</key>\n                <false/>\n                <key>allowTodayViewWhileLocked</key>\n                <false/>\n                <key>allowAppSwitcher</key>\n                <false/>\n                <key>allowMultitaskingGestures</key>\n                <false/>\n                <key>allowSpotlightSearching</key>\n                <false/>\n                <key>allowSplitView</key>\n                <false/>","url":"https://www.reddit.com/r/sysadmin/comments/1p6se16/setting_up_ipad_kiosk_style_to_use_at_unmanned/","permalink":"/r/sysadmin/comments/1p6se16/setting_up_ipad_kiosk_style_to_use_at_unmanned/","score":0,"num_comments":0,"over_18":false,"stickied":false,"created_utc":1764114202.0,"edited":0.0,"link_flair_text":"ChatGPT","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6jd8i","name":"t3_1p6jd8i","subreddit":"sysadmin","author":"andyr0272","title":"Questions about using Windows Hello for Business for local domain user MFA.","selftext":"I have a client who wants to implement MFA for domain users log ins on their local AD network on all the workstations. They have no inhouse IT at all thus I am it. Although most of the users only use their own physical workstation in the office at times some may log in with their domain user account on other workstation in the office.   \n  \nAn issue that I am seeing is if we implement that on a users workstation and set it up to for MFA using their cellphone or biometrics that becomes an IT issue. Many times rather than logging into a user computers via the domain admin account sometimes I need to log in under their domain user account to work on various issues. If the MFA is tied to their phone or a fingerprint reader I have no way to complete the MFA without the user being present in front of the computer thus I am locked out their user account. I'd love to know if there is a way to have more than one MFA option, for example the I could use MS Authenticator or even an SMS when logging into it and the user would be able to use a secondary PIN.   \n  \nDoes Hello offer any way to implement more than one MFA option that the user can choose?. That way in addition to the PIN there is a choice to use MS Auth or SMS right there like we see with many website MFA procedures including on M365 users which I am able to implement more than one MFA choice using Entra but of course that only applies to Microsofts various online services not local AD stuff.   \n  \nIts just not clear if Hello for Business can do what I need and uncertain if a product like DUO offers that capability with its MFA features. Any advice would be appreciated.","url":"https://www.reddit.com/r/sysadmin/comments/1p6jd8i/questions_about_using_windows_hello_for_business/","permalink":"/r/sysadmin/comments/1p6jd8i/questions_about_using_windows_hello_for_business/","score":0,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764093406.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6bewi","name":"t3_1p6bewi","subreddit":"sysadmin","author":"BrainBubbly4398","title":"AutoEndTasks doesn't work any more in Windows 11","selftext":"Hi,  \ni've made the experience that Windows 11 seems to ignore AutoEndTasks setting in the registry. (Windows 11 IOT Enterprise 2024 LTSC)  \n\n\nPreviously in Win10, apps were killed after some time when they prevented the restart.\n\nI've set following keys:\n\n|Path|Key|Value (DWORD)|\n|:-|:-|:-|\n|HKEY\\_CURRENT\\_USER\\\\Control Panel\\\\Desktop|AutoEndTasks |1|\n|HKEY\\_CURRENT\\_USER\\\\Control Panel\\\\Desktop|HungAppTimeout|2000|\n|HKEY\\_CURRENT\\_USER\\\\Control Panel\\\\Desktop|WaitToKillAppTimeout|5000|\n|HKEY\\_LOCAL\\_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Control|WaitToKillServiceTimeout|5000|\n\nWhen i start notepad.exe, enter some text, don't save, and want to restart the PC the warning   \n**This app is preventing you from restart** arises.  \nAfter some time (about 20 seconds) the lockscreen appears, and the user has to re-login.  \nWhen logging-in, the half of the OS is dead/already shutdown and a restart is even more necessary. (Some services don't run any more, the search doesn't work, ...)\n\n  \nHas anybody made similar experiences/Can i avoid this behavior?\n\nI know that data will be lost in this case.","url":"https://www.reddit.com/r/sysadmin/comments/1p6bewi/autoendtasks_doesnt_work_any_more_in_windows_11/","permalink":"/r/sysadmin/comments/1p6bewi/autoendtasks_doesnt_work_any_more_in_windows_11/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764074406.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6b89w","name":"t3_1p6b89w","subreddit":"sysadmin","author":"dahakadmin","title":"Exchange 2019 - Odd Error Remote Server returned '530 Authentication required","selftext":"**Edit - Well turns out it was something on their end, just got word back. All is working**\n\nI had this over in r/exchangeserver and figured I would post it here to get some more eyes on it\n\nSo here is an odd one, a couple of our users are getting this bounce back\n\n    Generating server: Myserver.mydomain.com \n    remoteuser@remotedomain\n    Requested\n    Remote Server returned '530 Authentication required'\n\nwhen sending to a specific domain, but from everything that I can see it does not seem to be my end, onprem Exchange 2019, leaves our firewall, our ip is not on any blacklists. Our users can send emails to others fine without issue.\n\nnormally I see this from the client side cannot connect to the server, but not from the server trying to send to and external server.\n\nAm I missing something?","url":"https://www.reddit.com/r/sysadmin/comments/1p6b89w/exchange_2019_odd_error_remote_server_returned/","permalink":"/r/sysadmin/comments/1p6b89w/exchange_2019_odd_error_remote_server_returned/","score":0,"num_comments":4,"over_18":false,"stickied":false,"created_utc":1764073854.0,"edited":1764076352.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6c0ig","name":"t3_1p6c0ig","subreddit":"sysadmin","author":"EducationAlert5209","title":"Applications installation","selftext":"Hi All \n\nServer administrators are installing applications and not removing after. Some of these apps are not supported by our org \n\nNotepad++, 7Zip , Wireshark, Adobe etc etc\n\nQualys are complaining about these applications.\n\nWe have a SCCM server. \n\nHow do I control these app install on our servers? \n\n","url":"https://www.reddit.com/r/sysadmin/comments/1p6c0ig/applications_installation/","permalink":"/r/sysadmin/comments/1p6c0ig/applications_installation/","score":0,"num_comments":10,"over_18":false,"stickied":false,"created_utc":1764076163.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6hlx9","name":"t3_1p6hlx9","subreddit":"sysadmin","author":"Anything-Traditional","title":"Multiple servers rebooted unexpectedly","selftext":"Yesterday we had a bunch of servers reboot at 4am with no explanation.  Bit out of my wheelhouse, as I don't manage these, but I checked event viewer logs and I don't see much of anything other then the systems unexpected shutdown event. Is there anywhere else I can check to see why these where restarted or crashed?","url":"https://www.reddit.com/r/sysadmin/comments/1p6hlx9/multiple_servers_rebooted_unexpectedly/","permalink":"/r/sysadmin/comments/1p6hlx9/multiple_servers_rebooted_unexpectedly/","score":0,"num_comments":8,"over_18":false,"stickied":false,"created_utc":1764089529.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ex21","name":"t3_1p6ex21","subreddit":"sysadmin","author":"przemekkuczynski","title":"CEPH","selftext":"Does anybody have contact with reddit support team ? [https://www.reddit.com/r/ceph/](https://www.reddit.com/r/ceph/) is not working and I am sadge ","url":"https://www.reddit.com/r/sysadmin/comments/1p6ex21/ceph/","permalink":"/r/sysadmin/comments/1p6ex21/ceph/","score":0,"num_comments":2,"over_18":false,"stickied":false,"created_utc":1764083509.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6s3wm","name":"t3_1p6s3wm","subreddit":"sysadmin","author":"Fluffy-Twist-4652","title":"Anyone stress-testing AI phone agents with background noise?","selftext":"Real customers don’t call from quiet rooms. They call while driving, walking outside, cooking, or yelling at kids.\n\nWe learned the hard way.\n\nIs there a good framework or tool to systematically test with noise like car hum, airport sounds, wind, background conversations instead of relying on random live calls?","url":"https://www.reddit.com/r/sysadmin/comments/1p6s3wm/anyone_stresstesting_ai_phone_agents_with/","permalink":"/r/sysadmin/comments/1p6s3wm/anyone_stresstesting_ai_phone_agents_with/","score":0,"num_comments":5,"over_18":false,"stickied":false,"created_utc":1764113456.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6mlgq","name":"t3_1p6mlgq","subreddit":"sysadmin","author":"Chazus","title":"How do I implement AI into my workflow? Should I?","selftext":"I'd like to try an integrate AI stuff into my workflow, to make things easier. I also feel like by not using it and not understanding it, I'm somehow 'falling behind' on technology. I love learning but I've largely been AI averse for so many reasons.\n\nMy workflow includes normal ticket queue stuff, passwords, printers, etc. I also handle full O365 and Azure management, employee onboarding/offboarding, huntress escalations for vpns, passwords, installs. Each ticket is time documented and we usually email the client afterwards (which also gets added to ticket). AD stuff for clients who still have on prem, routers, meraki, sonicwall management.\n\nI'm just trying to figure out how AI can help me because right now it just feels like a glorified email writer and I hate that.","url":"https://www.reddit.com/r/sysadmin/comments/1p6mlgq/how_do_i_implement_ai_into_my_workflow_should_i/","permalink":"/r/sysadmin/comments/1p6mlgq/how_do_i_implement_ai_into_my_workflow_should_i/","score":0,"num_comments":18,"over_18":false,"stickied":false,"created_utc":1764100443.0,"edited":0.0,"link_flair_text":"General Discussion","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6r7es","name":"t3_1p6r7es","subreddit":"sysadmin","author":"iusethisatworkk","title":"What exactly is \"Business Internet\"","selftext":"Purchasing person here\n\nI recently instituted a policy that I want to see all contract renewals.\n\nThe one that landed on my Desk today was from our ISP. We are small factory in Denver Colorado and we are currently paying $2000 per month for 100MBPS Speed. This seem Really high. The explanation from the ISP is that we have \"Dedicated internet access (DIA).\" and that's why its so expensive but could not articulate in a way I understood why I need that. \n\n  \nIs this totally insane?\n\n  \nAnd\n\n  \nIf you are in Denver who are you using and what are you paying? \n\n  ","url":"https://www.reddit.com/r/sysadmin/comments/1p6r7es/what_exactly_is_business_internet/","permalink":"/r/sysadmin/comments/1p6r7es/what_exactly_is_business_internet/","score":0,"num_comments":38,"over_18":false,"stickied":false,"created_utc":1764111163.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6rtbp","name":"t3_1p6rtbp","subreddit":"sysadmin","author":"ehbowen","title":"Which IPv4 subnets should a church in the USA block, completely?","selftext":"I find it hard to believe that someone who is, officially, behind the Great fireWall of China is connecting to learn more about evangelism, missions, and the Gospel. And our current blacklist provider is calling it quits effective the end of this year.","url":"https://www.reddit.com/r/sysadmin/comments/1p6rtbp/which_ipv4_subnets_should_a_church_in_the_usa/","permalink":"/r/sysadmin/comments/1p6rtbp/which_ipv4_subnets_should_a_church_in_the_usa/","score":0,"num_comments":17,"over_18":false,"stickied":false,"created_utc":1764112706.0,"edited":0.0,"link_flair_text":"Question","is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6ikr4","name":"t3_1p6ikr4","subreddit":"sysadmin","author":"DekuTreeFallen","title":"Unsolicited Attitude from Cogent","selftext":"Edit: This thread was a major L for me.\n\nSo many people in this sub over the years have talked about email, DNS records, etc. Considering a number of you pay decent money for anti-spam software/services, I thought this thread would have gone a different direction. It didn't.\n\nIf you are a small fish in a big pond and attempt to call out a company for not including an unsubscribe link in their unsolicited marketing, expect to be punched down on by other sysadmins who are bigger than you.","url":"https://www.reddit.com/r/sysadmin/comments/1p6ikr4/unsolicited_attitude_from_cogent/","permalink":"/r/sysadmin/comments/1p6ikr4/unsolicited_attitude_from_cogent/","score":0,"num_comments":29,"over_18":false,"stickied":false,"created_utc":1764091652.0,"edited":1764109748.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
{"id":"1p6tk5r","name":"t3_1p6tk5r","subreddit":"sysadmin","author":"Ok_Nothing_8381","title":"Hello frends i have 100mbps internet package and recived 100 mbps without Any issue but when i connect vpn then speed test meter showing 190mbps speed can vpn give fake inetrnet speed or its original?","selftext":"This is my first post here sorry if i write something wrong","url":"https://www.reddit.com/r/sysadmin/comments/1p6tk5r/hello_frends_i_have_100mbps_internet_package_and/","permalink":"/r/sysadmin/comments/1p6tk5r/hello_frends_i_have_100mbps_internet_package_and/","score":0,"num_comments":7,"over_18":false,"stickied":false,"created_utc":1764117304.0,"edited":0.0,"link_flair_text":null,"is_self":true,"spoiler":false,"locked":false,"thumbnail":"self"}
