{"comment_id":"no80o1q","post_id":"1otyqwd","author":"AutoModerator","body":"¡Hola! Gracias por tu envio a r/espanol.\n\nRecuerda que este es un espacio para que hispanohablantes de todo el mundo conversen sobre temas que nos interesan a todos. Por favor, recuerda seguir nuestras [reglas del subreddit](https://www.reddit.com/r/Espanol/about/rules/), así como las normas generales de [reddiqueta](https://support.reddithelp.com/hc/es-es/articles/205926439-Reddiqueta) para mantener una comunidad respetuosa y amigable.\n\nTu participación es muy importante, así que no dudes en unirte a la conversación y compartir tus ideas. Si ves algo que no cumple con las reglas, te animamos a [reportarlo](https://support.reddithelp.com/hc/es-es/articles/360058309512--C%C3%B3mo-se-reporta-una-publicaci%C3%B3n-o-un-comentario) para que podamos revisarlo lo antes posible.\n\n¡Gracias por ser parte de nuestra comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/espanol) if you have any questions or concerns.*","created_utc":1762831146.0,"parent_id":"t3_1otyqwd","link_id":"t3_1otyqwd","score":1,"is_submitter":false}
{"comment_id":"no8h31c","post_id":"1otyqwd","author":"Public-Schedule4479","body":"no wey no es tu culpa, es decir pq la sería?, eras un niño de 11 años pasando el rato, tu hermana es la culpable en todo caso, quien la manda a envolver su celular en TU TOALLA, algo de tu pertenencia, ella no t pidió permiso para poner su celular ahí, tmpoco t dijo q lo ha ia dejado y q tengas cuidado, literalmente cualquier persona habría echo lo q hiciste, pq simplemente tu no eres culpable de nada, pero me parece que al nubca reprochar nada tu hermana o padres tienen una versión diferente de la real, es decir pueden penswr qué lo hiciste al propósito, de todas formas eso viene a ser lo de menos pese al tiempo que ya pasó, solo se consciente que no es tu culpa","created_utc":1762837808.0,"parent_id":"t3_1otyqwd","link_id":"t3_1otyqwd","score":2,"is_submitter":false}
{"comment_id":"no8h01k","post_id":"1otyqwd","author":"Ok_Mycologist347","body":"No, pero pienso que de todas formas siempre te hubiesen dado los teléfonos de descarte. Si quieres uno nuevo empieza a horrar y comprátelo vos misma,","created_utc":1762837768.0,"parent_id":"t3_1otyqwd","link_id":"t3_1otyqwd","score":1,"is_submitter":false}
{"comment_id":"noa5yo3","post_id":"1otyqwd","author":"Signal-Patient1586","body":"La respuesta está en tu propia narración... dijiste que no sabías que el celular estaba envuelto en tu toalla... hay que ponerse firme cuando esas cosas pasan, lo primero que hay que decir es \"ella ni nadie me advirtió o avisó que pondrían un celular en MI toalla\"... podrías volver a sacar el tema con tus padres...","created_utc":1762869772.0,"parent_id":"t3_1otyqwd","link_id":"t3_1otyqwd","score":1,"is_submitter":false}
