{"comment_id":"ng8x5r9","post_id":"1nqnm44","author":"turkoid","body":"Now, this is the type of syntactic sugar I can get behind.\n\n* Intuitive\n* Simple\n* No extra keywords","created_utc":1758858013.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":49,"is_submitter":false}
{"comment_id":"ng8y81h","post_id":"1nqnm44","author":"lostinfury","body":"I doubt more than a handful of people have really complained about this, but thanks for the syntactic sugar!","created_utc":1758858475.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":18,"is_submitter":false}
{"comment_id":"ng9j8ir","post_id":"1nqnm44","author":"jirka642","body":"YES! I have been really annoyed by this.","created_utc":1758869170.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":5,"is_submitter":false}
{"comment_id":"ng8ggos","post_id":"1nqnm44","author":"YoshiUnfriendly","body":"Nice","created_utc":1758851544.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":6,"is_submitter":false}
{"comment_id":"ng9tvpb","post_id":"1nqnm44","author":"HommeMusical","body":"Very weakly opposed. \n\n* I have never seen this problem in any code I read, or certainly in code I wrote.\n* Python has too much \"stuff\" in it already.\n* The proposal doesn't fix any actual problem or add a new feature: it simply reduces keystrokes.\n\nThat said, it should probably have been done this way initially. But it's such an edge case.\n\nEDIT: I agree with the suggestion elsewhere on this page, \"Instead of syntactic sugar, I think a wrapper in `contextlib` that takes a sync context-manager and allows it to be used in an async context would be best. \"","created_utc":1758875486.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":4,"is_submitter":false}
{"comment_id":"ng8z9sf","post_id":"1nqnm44","author":"move_machine","body":"IMO, this will encourage bad form like in the examples.\n\nIO should be made async. Creating temp dirs/files and then doing file IO should all be async.\n\nMixing sync and async like this renders the benefits of using async moot as work gets serialized instead of an interweaving of tasks by not yielding to the event loop on file IO.\n\nThere *should* be friction when doing something you shouldn't be doing, like mixing sync IO with async IO without punting that sync IO to a threadpool.","created_utc":1758858934.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":4,"is_submitter":false}
{"comment_id":"ng92gg2","post_id":"1nqnm44","author":"sunyata98","body":"I think the async markers are key here. Without them, this would suck imo, but I think this is fabulous the way you laid it out.","created_utc":1758860398.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ng9t6hq","post_id":"1nqnm44","author":"james_pic","body":"It's a pity we don't have a time machine, and can make it so it was always `with async`. Having `async with` and `with async` both mean the same thing is awkward, but I suppose still a win (and still better than \"mean subtly different things where the subtlety is safe to ignore 99% of the time but will break everything if you ignore it that 1%\")","created_utc":1758875054.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ng9wue4","post_id":"1nqnm44","author":"antennen","body":"I actually ran in to this precise issue yesterday. I see some comments this reduces keystrokes but I think the main benefit is really indendation if you need nested with statements in a class method everything inside will be very constrained on horizontal space.\n\nThe PEP points to AsyncExitStack as a complex workaround. I'm not sure I agree with this.\n\n> However, AsyncExitStack introduces significant complexity and potential for errors - it’s easy to violate properties that syntactic use of context managers would guarantee, such as ‘last-in, first-out’ order.\n\nI think it would be useful to provide an example of why `AsyncExitStack` is not an adequate workaround and examples of situations where it misbehaves. In my mind the biggest issue with it is discoverability not the implementation itself.","created_utc":1758877294.0,"parent_id":"t3_1nqnm44","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ng9k5tn","post_id":"1nqnm44","author":"jdehesa","body":"I think it's a good addition, but it's also slightly awkward in that now you can have either `async with something ():` and `with async something():`. On the one hand, it seems as if the former syntax was a bit of a mistake, since the new order covers all cases and is more explicit. On the other hand, `async` is added before in other cases (`async def`, `async for`), so the new syntax may look backwards. But anyway, I don't think it is a big deal, and it is outweighed by the benefits.","created_utc":1758869679.0,"parent_id":"t1_ng8x5r9","link_id":"t3_1nqnm44","score":5,"is_submitter":false}
{"comment_id":"ngbh3my","post_id":"1nqnm44","author":"FlyingQuokka","body":"The PEP talks about a simple wrapper you could write, but imo it feels awkward to have to add a wrapper just to make a sync context manager async. You could argue that the async keyword ahead like the PEP proposes is effectively the same thing, but it's moreso about explicitness.","created_utc":1758899313.0,"parent_id":"t1_ng9tvpb","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ngbiwl4","post_id":"1nqnm44","author":"gdchinacat","body":"There are LOTS of problems that I've never read or encountered in code I wrote. That doesn't negate the need for a solution.\n\nThis isn't about reducing keystrokes, but reducing deeply nested with statements and allowing a language feature (stacked context managers) to be used with both sync and async context managers. This will improve readability. Yes, it reduces keystrokes, but that is not the motivation, but rather a side effect.\n\nre EDIT: this is one of the rejected ideas in the proposal.","created_utc":1758899842.0,"parent_id":"t1_ng9tvpb","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ng9hhkv","post_id":"1nqnm44","author":"--ps--","body":"I think this is not great example for the proposal.\nYou could have sync context manager that has nothing to do with IO. Still it could be usefull to have syntax allowing mixing both sync and async.","created_utc":1758868195.0,"parent_id":"t1_ng8z9sf","link_id":"t3_1nqnm44","score":5,"is_submitter":false}
{"comment_id":"ngaepou","post_id":"1nqnm44","author":"Tinche_","body":"Yeah Zac is not doing himself a service by using file operations in the examples. The motivating use cases are probably the trio cancel scope context managers, which are sync.\n\nThat said, I support the PEP (I happen to be the author of aiofiles and some other asyncio libs).","created_utc":1758886499.0,"parent_id":"t1_ng8z9sf","link_id":"t3_1nqnm44","score":2,"is_submitter":false}
{"comment_id":"ngblbj4","post_id":"1nqnm44","author":"gdchinacat","body":"I don't think supporting both 'with async' and 'async' with is any worse than 'x not in' and 'not x in', and that doesn't cause problems in practice. 'not in' helps readability, as does 'with async'. I'd say 'with async' taking multiple mixed context managers is a much larger readability improvement that 'not in' is over negating 'in'.","created_utc":1758900562.0,"parent_id":"t1_ng9t6hq","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ngbgmxq","post_id":"1nqnm44","author":"FlyingQuokka","body":"The end of the PEP kind of discusses this and it seems they're leaning towards banning it when you aren't mixing sync and async context managers.","created_utc":1758899176.0,"parent_id":"t1_ng9k5tn","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ngbr0gx","post_id":"1nqnm44","author":"HommeMusical","body":"I read a lot of code. Examples of code in existing projects which would be improved by this would help.\n\nYes, it's a readability improvement. That's maybe not enough.\n\nIf someone has a solution for this ready to go it wouldn't really affect anyone negatively.","created_utc":1758902234.0,"parent_id":"t1_ngbiwl4","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
{"comment_id":"ng9i30w","post_id":"1nqnm44","author":"move_machine","body":"Even the Rationale uses a terrible example, it's exactly what you should not be doing with async Python:\n\n> Rationale\n\n> Mixed sync/async context managers are common in modern Python applications, such as async database connections or API clients and synchronous file operations. \n\nInstead of syntactic sugar, I think a wrapper in `contextlib` that takes a sync context-manager and allows it to be used in an async context would be best. \n\nDocs can explain the pros/cons, and it also allows for an additional wrapper that can automatically punt sync IO off to a threadpool if needed, which this syntax won't.","created_utc":1758868529.0,"parent_id":"t1_ng9hhkv","link_id":"t3_1nqnm44","score":4,"is_submitter":false}
{"comment_id":"ng9tyt5","post_id":"1nqnm44","author":"HommeMusical","body":">  I think a wrapper in contextlib that takes a sync context-manager and allows it to be used in an async context would be best. \n\nQuoted for truth.","created_utc":1758875540.0,"parent_id":"t1_ng9i30w","link_id":"t3_1nqnm44","score":1,"is_submitter":false}
