{"comment_id":"no62klk","post_id":"1otoist","author":"Necessary_Attitude44","body":"I know this is far from the most nefarious service you could buy out there, but it's kind of wild that entire page basically boils down to \"pay us to lie about your game for you\". \n\nThey make it sound like such a positive thing to trick people into believing their posts are authentic. And they love using the words \"organic\" and \"genuine\" when it's all a lie.","created_utc":1762807230.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":1668,"is_submitter":false}
{"comment_id":"no631hb","post_id":"1otoist","author":"keyboardnomouse","body":"Those spreadsheets in the first couple of images should be downright damning. It used to be that reddit admins would have cracked down on blatant gaming like this.\n\nGoing through some of the accounts on that list, and the submissions and \"conversation starters\" they post, it's not just advertising that they're in the business of. There's also damage control. I can see posts about Ready or Not's censorship and look at how they introduce the discussion in the OP:\n\n> Why did people make such a huge fuss about it? Maybe I'm exaggerating, but I saw a few posts and YouTube kept showing me videos calling it \"outright censorship.\"\n\n> **In reality, they only changed a couple of minor things just to expand sales. That should actually benefit them in the long run, right?**\n\nIt also looks like the game Active Matter will be heavily promoting its narrative aspects to make it stand out from extraction shooters as it releases next year, based on this account's blatant marketing post about it.\n\nAnd this is all just one of the accounts in the spreadsheet.\n\nEDIT: Going through more of the accounts and the effort they go to try to start conversations and bring awareness about this games to other places is wild. One account has a post about Tablestop Game Shop Simulator in, of all places, r/smallbusiness asking about how realistic business management games are.\n\nEDIT 2: These Bee Simulator and Active Matter games seem to have active marketing campaigns going on. Many of these accounts have been shilling for these two games for months now. Active Matter is being published by the same company as War Thunder too.","created_utc":1762807376.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":441,"is_submitter":false}
{"comment_id":"no64y85","post_id":"1otoist","author":"Rarewear_fan","body":"This has gone on for a long time and I am willing to bet the list you have is just scratching the surface.","created_utc":1762807956.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":305,"is_submitter":false}
{"comment_id":"no63eyv","post_id":"1otoist","author":"giulianosse","body":"Turns out every time I called a user whose opinion I didn't like \"paid shill\" I was right!! /s\n\nFor real though, the comments are really depressing. It sounds and reads very organic and I wouldn't think they were paid for one second - and even knowing they *are* shills, their account activity isn't suspicious on its own. Makes me wonder the true amount of astroturfed content we see here on a daily basis. I'm also positively sure these accounts all interact and boost each other's content at some point. \n\nThe worst part is that I often write like that myself - especially when it’s about a game I genuinely enjoy. If you looked at my profile right now, it might seem like I’m being paid to promote a specific title I’m hyped for that’s releasing soon. I also post trailers and articles for smaller or offbeat games to bring interesting content to the community\n\n\n\nAs if it weren’t discouraging enough to get yelled at by people who think you’re using AI to write comments, now you’ll also get called an astroturfer.\n\n\n\nThese people are ruining quality discussion and communities for their own profit.","created_utc":1762807490.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":517,"is_submitter":false}
{"comment_id":"no64zz0","post_id":"1otoist","author":"ConceptsShining","body":"Reddit is a fascinating example of [Goodhart's Law](https://en.wikipedia.org/wiki/Goodhart%27s_law). It used to be a popular way to find solutions, recommendations and opinions because it was user-generated content filled with candid laypeople. But as Reddit praise became a metric, the incentives to astroturf and manipulate it went up, and now it's no longer as useful.\n\nIt's just like high test scores when post-secondary became increasingly essential for better jobs and things like NCLB. Schools and students started optimizing for test scores over actually getting good educations (teaching the test, test prep, cheating etc.). Thus leading to the current problem of grade inflation and devalued degrees.\n\nOr how a lot of interview questions (fizzbuzz in programming etc.) are no longer useful because interviewees began to specifically prep for them.","created_utc":1762807971.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":190,"is_submitter":false}
{"comment_id":"no7cok4","post_id":"1otoist","author":"Blurgas","body":"> World of Warships  \n> War Thunder  \n  \nI am completely unsurprised.  \nAlso see these two all over youtube, and I don't even watch that many videos.","created_utc":1762822558.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":21,"is_submitter":false}
{"comment_id":"no6luav","post_id":"1otoist","author":"Anxious_Temporary","body":"On one of those links (the 'some\" one) in the OP there's a picture of a post on r/games about that reboot in-name-only Painkiller highlighted. There's a reason why the astroturfing service doesn't show the contents of their attempts at discussions and instead try to highlight views as some useful metric of engagement.\n\n\"We generated 2 million views\"\n\n[https://www.reddit.com/r/Games/comments/1o67aj5/this\\_is\\_painkiller/](https://www.reddit.com/r/Games/comments/1o67aj5/this_is_painkiller/)\n\nMost upvoted comment in their astroturfed post:\n\n\"This isn't Painkiller, though. It's got some elements (ex. the stake gun), but it feels nothing like Painkiller to me in the demo. That said, it looks good and runs great. I just wish it wasn't forced co-op (bots in singleplayer), had more open areas and that enemies dropped souls everywhere like they used to.\"\n\nAt 20 days old that Painkiller reboot has a Mixed rating with 510 reviews, an all-time peak of 871 and 39 currently in-game. Wow.\n\n[https://steamdb.info/app/2300120/charts/](https://steamdb.info/app/2300120/charts/)\n\nMoney well spent 3DRealms.","created_utc":1762813143.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":41,"is_submitter":false}
{"comment_id":"no6ktaj","post_id":"1otoist","author":"Equalness","body":"Reddit users can now hide/limit visibility of their posting history, which will only make this easier to do for these companies. Shameful.","created_utc":1762812805.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":84,"is_submitter":false}
{"comment_id":"no6fxqx","post_id":"1otoist","author":"gcampos","body":"Not only games, there is a lot of astroturfing on Reddit for celebrities, movies, politicians, etc…\n\nA lot of times I see memes over praising something and I think to myself “why someone bother to create this image/video just to kiss the ass of this random thing?”","created_utc":1762811278.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":121,"is_submitter":false}
{"comment_id":"no6z2ei","post_id":"1otoist","author":"plane-kisser","body":"now imagine all the astroturfing all the giant corporations do that hasnt been disclosed or caught yet...","created_utc":1762817692.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":51,"is_submitter":false}
{"comment_id":"no6v78j","post_id":"1otoist","author":"Oh_I_still_here","body":"I work in Marketing Analytics and can confirm reddit is a social media platform that companies pay quite a bit of money in order to advertise on. This is an external company, but you can obviously buy straight up ad space on reddit directly. \n\nAll I can say is that you basically caught the most obvious one. There are *tonnes* of other posts that farm activity on the site all to juice up an ROI for some business. My company gets paid by the companies who pay for the advertising (whether direct or through an agency) and we just report the ROIs independently so we're actually trusted to get as close to an accurate picture. But if a developer pays for advertising using a site like you link in the OP, and then gets marketing analytics from said company, they're immediately biased to make themselves look good so they keep getting paid. Say they make reddit look good, then the developer pumps more money into reddit, which is good for reddit but also for the company doing stealth advertising like this since they get paid more. It goes on and on in this regard as you might imagine.\n\nNow imagine what other companies do across every platform. There's a fuckload of money being spent on this stuff.","created_utc":1762816307.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":58,"is_submitter":false}
{"comment_id":"no620ia","post_id":"1otoist","author":"542531","body":"Atomfall was the first time I noticed something off with how a game was being discussed.","created_utc":1762807061.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":69,"is_submitter":false}
{"comment_id":"no7jg9o","post_id":"1otoist","author":"LutherJustice","body":"Reddit is astroturfed to hell and back on so many political issues and products. You just have to look up Eglin Air Force base reddit scandal to see how much and for how long the site has been compromised.","created_utc":1762825061.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no613vp","post_id":"1otoist","author":"Hades-Arcadius","body":"I guess it's basically just another form of advertising when you get right down to it....but of course it's disingenuous and technically illegal in some places due to disclosure laws when you consider the company is being contracted by a publisher and attempting to make organic engagement without the hallmarks of an advertisement","created_utc":1762806779.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":66,"is_submitter":false}
{"comment_id":"no6cmfq","post_id":"1otoist","author":"Living-Chef-9080","body":"I am 99.9% sure Delta Force was also doing this. For those who aren't aware, Delta Force was a very blatant ripoff of Battlefield 2042 (I know, of all the games to rip off...) that got caught stealing assets from 2042 a bunch of times. Nearly everything in the game was a slightly scrambled around copy of something from 2042.\n\n\nSo that's why I found it suspicious when, the main Battlefield subreddit started being flooded with screenshots of the game saying this is what a TRUE successor to BF4 should have been. Like, I'm sure that game has it's fans, but it has all the same baffling design decisions as 2042. If you don't like 2042, you won't like Delta.\n\n\nSo I would always dig further into the accounts making these posts, and it was always the same story: accounts with no prior interest in Battlefield that went dormant for years before magically showing back up as a hardcore Battlefield fan. Every. Time.\n\n\nThat game has been caught doing a bunch of other shady stuff in years since including paying big youtubers for reviews with no disclosure and botting player counts on steam, so this is all but confirmed in my mind.","created_utc":1762810271.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":33,"is_submitter":false}
{"comment_id":"no6wrsm","post_id":"1otoist","author":"MontyAtWork","body":"These companies also, as part of their service, downvote dissenting opinions. \n\nYou'll find this a lot on popular Movies where if you leave a comment in the Mega Thread there's -4 votes for you in minutes.","created_utc":1762816865.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no75r04","post_id":"1otoist","author":"ThatAnonymousDudeGuy","body":"It’s incredibly sad to see Reddit go this way. Reddit used to be really good at cracking down on astroturfing and fake accounts.","created_utc":1762820081.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no7nqlq","post_id":"1otoist","author":"sidekickman","body":"Lol and here I was getting dicked on for calling out obvious astroturfing. You guys would not *believe* how deep this rabbit hole goes. Political conversations online are defunct IMO\n\nFor example, there are cloak-and-dagger PR management firms that use LLMs to generate entire synthetic personalities for use in astroturfing. They buy accounts with standing, clear out their history, and start repopulating with a new synthetic persona. We're talking *hundreds* of socials with synthetic images and likenesses, posted just like a real person, for just a single client. Once the dust settles they delete em. The fake accounts will post autonomously, and even interact with *each other* to create an authentic-looking social network. There's actually a bit of an arms race going on with buying up old accounts with standing lol\n\nFunnily enough, one of the firms I know that does this started off by creating \"rage bait\" in shitstorm threads to confuse bad PR for celebrities before spooling into more sophisticated discourse manipulation. And, if you think your various feed algorithms aren't a part of this, you're very mistaken.\n\n I hate to say it, but after I saw how well it works first hand, it really dampened my respect for people in general. How consensus driven most people are is genuinely repulsive - people are facially contradicting their own beliefs just to match a thread take and conform. This was literally a marketing point in an internal pitch deck for one of the smaller outfits that does this.\n\nFun fact: Reddit stopped warning and banning obvious alt accounts for vote and discourse manipulation a few years ago.\n\nedited to remove personal info","created_utc":1762826567.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":35,"is_submitter":false}
{"comment_id":"no6hbrg","post_id":"1otoist","author":"LowCharity","body":"Really depressing to see evidence of this if it's real, and even worse that this site has made it even harder to combat recently with private profiles and the way blocking works nowadays.","created_utc":1762811699.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":22,"is_submitter":false}
{"comment_id":"no6jlp1","post_id":"1otoist","author":"mookler","body":"Thanks for the research!  We took action on some accounts in /gaming - feel free to modmail us if you find any others","created_utc":1762812413.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":19,"is_submitter":false}
{"comment_id":"no6xlz4","post_id":"1otoist","author":"Lokorokotokomoko","body":"Reddit Inc. doesn’t care. Just look at all these new and totally organic subreddits that popped up after the API shitshow. So many variations of r slash news, pushing political propaganda and disinformation (but who cares since they cheer for our team). \n\nOr how about all the different peterexplainsthejoke subs? There are at least four of them with ever so slightly different spelling (one is named the same as the original sub, just without an s). All of them are used to legitimize bot and ad accounts. And each of them pump the numbers up nicely for Reddit‘s shareholders.\n\nHell, this subreddit itself isn’t much better. Can’t name the issue but anyone looking at the flood of PR pieces posted on the frontpage each week might notice a trend.\n\nThe site is pretty much dead.","created_utc":1762817165.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":20,"is_submitter":false}
{"comment_id":"no76pf4","post_id":"1otoist","author":"jorgom","body":"I mean they got me with Split Fiction. I bought it due to all the praise and found it to be a good co-op game but nothing spectacular. I’ve never heard of the other games.","created_utc":1762820419.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no6jj79","post_id":"1otoist","author":"wadad17","body":"No way arc raiders isn’t among these. Like the game looks like it has a ton of genuine buzz around it now, but all the posts I saw around the Beta followed the same template and, as sad as this is to say, strangely lacked the typical toxicity that comes with these big multiplayer games. ","created_utc":1762812391.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":75,"is_submitter":false}
{"comment_id":"no7986a","post_id":"1otoist","author":"MySinsRemembered","body":"I actually liked Mandagora, but I thought it's reddit presence was pretty inflated compared to its actual popularity. I guess it's not too surprising to find it listed here","created_utc":1762821316.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6xdz6","post_id":"1otoist","author":"lethargicriver","body":"So, how can you tell whether there is an astroturfing campaign or the game is just generally popular, resulting in a lot of discussion on gaming forums?  I have seen many instances where praise for a show/game is accused of astroturfing, when in reality the show/game was praised because it resonated with the person posting.  I remember this happening when the first season of Arcane was released.  \n\n  \nYou can honestly accuse every discussion of a popular game of astroturfing if you disliked it.  I can start accusing Elden Ring of astroturfing following its release, when the reality is I just disliked the game.  It is widely praised because it is a good game.  It just so happens it wasn't my cup of tea.","created_utc":1762817085.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no6lbpm","post_id":"1otoist","author":"quickpost32","body":"This maybe explains some weirdly obsessive posts about one of these games I saw around the time it released. They seemed like ordinary posters with plenty of non-gaming post history, and then all of sudden this like some game of the decade material to them. And to be fair it did seem like a cool game, but just not to that level. Ever since then whenever I see it in Steam I think of those weird posts and how people like that even exist. So it was kind of anti-marketing to me, and this news just cements that.\n\nedit: ok maybe this is witch hunting, but I think there is sufficient proof to call it out. I was misremembering, they didn't post in non-gaming subs but it was a wide enough variety for me to think there could be some slim possibility of a geniune person piloting the account. But I missed the part where they stopped posting for years and came back to mostly spam about Mandragora.\n\n[https://imgur.com/a/3mmPdyS](https://imgur.com/a/3mmPdyS)\n\nIf that somehow is a real human being, I'm sorry, but it really doesn't look that way to me.\n\nedit2: I decided to anonymize the images. The posts marked with red are Mandragora related. Even if there's 99% chance of this being a bot I don't feel comfortable with witch hunting and this is a distraction from my main point, that this marketing is counter-productive to anyone who can see through it (which isn't very hard).","created_utc":1762812971.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no6zzgy","post_id":"1otoist","author":"omar_trader","body":"Leading up to the BF2042 release, the battlefield2042 subreddit was filled with accounts that could seemingly do nothing but mention how they preordered the game and were so excited, despite the beta being a disaster. It was a very clear juxtaposition to every real post on there. All of those accounts were dead immediately after it released, no activity elsewhere.","created_utc":1762818029.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no72mg3","post_id":"1otoist","author":"NuggetoO","body":"Reddit is a place for corporations to sell you things \"organically\" . If you aren't paying for a service, then you are the product.","created_utc":1762818974.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no6ce4y","post_id":"1otoist","author":"MythicStream","body":"Damn, really sucks to see the examples of posts because it does just seem like genuine happiness about a game but finding out it's actually an advertisment is pretty depressing, makes me self-conscious with talking about games I'm liking or I'm excited for because people are just gonna think I'm a bot or something","created_utc":1762810202.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":17,"is_submitter":false}
{"comment_id":"no6pu3w","post_id":"1otoist","author":"ArcadianDelSol","body":"Where do you think all the political posts are coming from?\n\nThere are more bots on reddit than there are users.","created_utc":1762814468.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"no632hp","post_id":"1otoist","author":"ConceptsShining","body":"Split Fiction is a very surprising inclusion. It's sold amazingly, was received quite well, and Josef Fares's games have already built up a good reputation so you'd think it wouldn't need astroturfing.","created_utc":1762807384.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":59,"is_submitter":false}
{"comment_id":"no6w14v","post_id":"1otoist","author":"da_persiflator","body":"For anybody thinking this is a new phenomenon on reddit, i have some bad news for you. \n\nTwelve years ago a reddit blog had Englin Air Force base as top city visits wise. From what i read, the second location is also next to a military base, but since im not american, can't say for sure.\n\nhttps://web.archive.org/web/20160410083943/http://www.redditblog.com/2013/05/get-ready-for-global-reddit-meetup-day.html?m=1","created_utc":1762816600.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7hfxq","post_id":"1otoist","author":"Deamane","body":"unsurprisingly there's a lot of these groups it looks. Here's some random one I found for example https://www.growthmarketingpro.com/reddit-marketing-agency/ or this https://taktical.co/reddit-marketing-agency/\n\njust google anything like \"reddit marketing\" etc and they come up. Half of them look like just direct copies, maybe ran by the same overall company? maybe just lazily copied? In a way it's unsurprising to see, I think most people know this is happening behind the scenes but I think the scale and also the games and companies involved are surprising, as everyone is mentioning in this thread it's kinda sad to see a \"good\" game engage in these shitty undisclosed advertising practices like Split Fiction.\n\nI'd be curious if someone has a full list of these kind of groups just to look at or if there's been a deep dive video or something on the topic, I know this isn't the first time this topic has come up and won't be the last.","created_utc":1762824318.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no67qqf","post_id":"1otoist","author":"MrMindGame","body":"You can go to the most recent MindsEye update video on YouTube and scroll the comments to also see it happening in real-time.","created_utc":1762808806.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no8v5nm","post_id":"1otoist","author":"Jebble","body":"One thing I would say, is to not blindly trust companies who's entire business model is to lie and create fake content, to be honest about who their partners and customers are.","created_utc":1762845436.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no8wthj","post_id":"1otoist","author":"dlpheonix","body":"Would be pretty funny if the company didnt astroturf anything just said they did and grabbed random comments to sell a service to companies where they did nothing really.","created_utc":1762846442.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no6fqku","post_id":"1otoist","author":"Yourfavoritedummy","body":"I believe it. An example that is egregious is Marathon's latest closed Alpha with people coming out of the wood work saying suspiciously similar things.\n\nSomething like, \"I may or may not have played the closed alpha and I can say it is improved\". Something along those lines.\n\nOne thing I keep in mind however, is that online discourse is disconnected from reality.","created_utc":1762811217.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no6s2j2","post_id":"1otoist","author":"DoctorWaluigiTime","body":"That list of subreddits is a good list of subreddits to just have on filters and ignore entirely honestly. Tons of subs, tons of spam.","created_utc":1762815218.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no6sba0","post_id":"1otoist","author":"AreaRare1329","body":"bet arc raiders is a part of it too, everyone and their alt account is praising that mediocre game here","created_utc":1762815300.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":31,"is_submitter":false}
{"comment_id":"no75oht","post_id":"1otoist","author":"meneldal2","body":"It's funny how world of warships is in this because people in the subreddit are not being nice with wargambling at all.\n\nMost posts are pretty negative. Not saying they aren't astroturfing but I don't feel like they are doing a good job.","created_utc":1762820056.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7y89f","post_id":"1otoist","author":"SquareWheel","body":"Guess I'm removing Mandragora from my wishlist.  Disappointing, but I certainly don't want to support this kind of duplicity.\n\n> I don't think there's a good way to stop this unless the admins actually do something\n\nIt feels as if the admins have been checked out of this sort of thing for years.  It's simply below the scale that they even take notice anymore.","created_utc":1762830253.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8vki8","post_id":"1otoist","author":"I_Heart_Sleeping_","body":"Mandragora LMAO. I knew something was funny about how many people defended the $40 price for this game.","created_utc":1762845686.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8z6l2","post_id":"1otoist","author":"DrKushnstein","body":"Of course Split Fiction was astroturfing. Reddit convinced me that was the second coming of christ in video game form. It's a *fine* game but did not deserve the overwhelming positivity around it. ","created_utc":1762847875.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no93s86","post_id":"1otoist","author":"Torran","body":"I wonder why actual good games like split fiction do this. I can understand why you would use this service when your game sucks but otherwise it seems weird.","created_utc":1762850745.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no9dh9n","post_id":"1otoist","author":"SMTRodent","body":"I love the fact that I know nothing about any of these games, although I have heard on Reddit about lots of other games coming out.","created_utc":1762856821.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no9ykre","post_id":"1otoist","author":"Perfect_Base_3989","body":"Reddit is an awful marketplace of ideas.\n\nAlgorithmically, it's easily exploited.\n\nBut what really fucks it sideways is its tone policing. You can't tell people to fuck off on Reddit; you'll get banned for incivility. This is insane, since you're constantly dealing with ~~re~~ idiotic ideas and bots that should only be met with pure condemnation.\n\nReddit is still culturally stuck in 2015, while technology and cynicism have festered for over a decade.","created_utc":1762867100.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"noaiefc","post_id":"1otoist","author":"RedditAdminsFuckOfff","body":"I mean this is exactly why every *single. time.* I encounter people on there who seem just utterly brainless \"GIGGITY GEE\" about a title, to the point of basically calling you a big poopyface \"for not liking fun\" or whatever other cynical handwave, That I just assume they're a shill or a bot of some kind. In particular I really in enjoy the ones that will still pull the ol' \"If you don't like it don't buy it, poopyface\"-energy responses, because if they are actually working for an astroturfing racket, that is like THE worst thing you want to be saying these days.","created_utc":1762873977.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6n2bw","post_id":"1otoist","author":"SilverDragon7","body":"Every time I see a game that is set to be Epic game store exclusive it gets astroturfed. How I know it's astroturfed, every account that posts those games only pop up when EGS gets talked about. They have large activity in the EGS subreddit and little in others.\n\nEven Epic games Tim Sweeney admits that he supports astroturfing.","created_utc":1762813550.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no63669","post_id":"1otoist","author":"itsamirage","body":"Back in the day when I made gaming YouTube videos I would do similar things. Have multiple accounts upvote my posts on r/gaming which would put my videos rising quicker than others. It led to my videos getting hundreds of thousands of views and really helped me grow. It eventually got me rightfully banned from r/gaming but if a stupid college kid could figure it out no doubt these companies do it in an incredibly efficient and harder to track manner","created_utc":1762807416.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":13,"is_submitter":false}
{"comment_id":"no71pbo","post_id":"1otoist","author":"Seraphy","body":"Remember when the Microsoft-Activision buyout was ongoing, and a bunch of very real people were suddenly showing up to sing MS' praises and declare how good it would be for GamePass™, and therefor gaming? Apparently MS decided after the fact that the AI bots they used for that were more valuable than the their gaming division.","created_utc":1762818650.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no6hdzz","post_id":"1otoist","author":"shawntails","body":"Why did they even do this with for Split Fiction? It Takes Two was a really good game and people were excited for SP.","created_utc":1762811718.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6wzje","post_id":"1otoist","author":"MM487","body":"I wouldn't be surprised if the Clair Obscur people were doing this too. A million threads about it post launch, all positive. Any negative comments about the game downvoted into oblivion.","created_utc":1762816943.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no7deth","post_id":"1otoist","author":"Jon-Slow","body":"E33 devs 100% have been  doing this. Can't go 5min without a post calling it \"game of the generation\" or some ridiculous shit like that. Pay IGN, pay troll farms, profit","created_utc":1762822829.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":16,"is_submitter":false}
{"comment_id":"no6okat","post_id":"1otoist","author":"toofarquad","body":"Kind of wild to think Split Fiction of all games would need fake post pumping given their last title won GOTY and Split Fiction had rave reviews. Crazy stuff. The Astroturf is everywhere.\n\nI wonder what the ROI is? Maybe its like coca-cola where even just keeping the mind share via reminders is effective.\n\nSeems the era of just searching  XYZ \"reddit\" to get real(ish) opinions and useful assistance is a relic of the past. Which is rough given how garbage page 1/2 of google is now.","created_utc":1762814046.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6ek8d","post_id":"1otoist","author":"nosayso","body":"You are \"discovering\" what has been done openly for years.  Companies sell this is a service, it's not a secret, it's a fundamental part of modern marketing.\n\nThis is why no one should take the internet seriously.  Comments are mostly from bots.  Platforms feed you content through an algorithm that takes into account who pays them, along with metrics that destroy your mental health by focusing on more \"engaging\" content that generates strong emotions, specifically anger.  Platforms are also either owned by people with overt political objectives (Twitter, TikTok) or massively manipulated by outside actors with overt political objectives.\n\nThis is not real.  Engage with content that you brings you joy, and stay away from Facebook, TikTok, Twitter, Instagram, and anything YouTube suggests for you if you don't want to be force-fed profitable content by oligarchs.  And be incredibly skeptical of everything you see on Reddit.  Understand how to vet sources and check facts yourself.","created_utc":1762810862.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no6y5r0","post_id":"1otoist","author":"Multifaceted-Simp","body":"Arc raiders, any Chinese game, any Korean game, all of these are astroturfed I'd bet my fucking life on it","created_utc":1762817362.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no6imh3","post_id":"1otoist","author":"ImpactThunder","body":"I’m surprised that superhero telltale like game that just came out isn’t on that list. It seems like I am seeing it everywhere!","created_utc":1762812099.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no73x3k","post_id":"1otoist","author":"BarryWhizzite","body":"the nintendo switch subs are turfed  to hell and back they have been pushing  star wars outlaws thread advertisements for weeks.","created_utc":1762819432.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6q8pw","post_id":"1otoist","author":"CyraxxFavoriteStylus","body":"Honestly wouldn’t surprise me if news leaks about Expedition 33 being shilled. So many, “ This game saved my marriage and restored my fertility! I’m going to name my 33 kids after this game!!1” comments.\n\nNot surprised to see Split Fiction either if this is true, unnatural sounding praise for a game that no one is talking about or cares about now.","created_utc":1762814605.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no6mnid","post_id":"1otoist","author":"Significant_Walk_664","body":"It's kinda counterproductive. In my experience, people are usually discerning enough to know when someone is shilling, which leads to: if I am considering your game, and I find some ahole trying to advertise it under the radar, I start to think \"huh, if they feel they need to be underhanded, maybe their game is not worthy of consideration.\" Which is a shame coz you can have a really good game but turn people away due to false red flags","created_utc":1762813415.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6oap4","post_id":"1otoist","author":"msp26","body":"> Mandragora came out yesterday, and I gave it a go on Xbox today - totaly a fresh experience for me\n\n\nthey even intentionaly include typos lol","created_utc":1762813957.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no72iob","post_id":"1otoist","author":"Fli_acnh","body":"I really hope the admins do something like this. I'd really like to hear the justification from the devs on this too.","created_utc":1762818938.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no76w3k","post_id":"1otoist","author":"Dramajunker","body":"Always found it funny how seemingly unsuccessful games like the nick smash game always got a post on here whenever a new character came out.","created_utc":1762820485.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7c5iq","post_id":"1otoist","author":"LogicKennedy","body":"Absolutely convinced Paradox has been doing this with Bloodlines 2. The old Bloodlines subreddit has been completely overrun with the most vapid glazing of what is an extremely mediocre game. \n\nI'm sure some people have got some enjoyment out of it but a 6/10 game should be getting pretty heavily panned, especially by core Bloodlines fans.","created_utc":1762822361.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7r27s","post_id":"1otoist","author":"TopCheddar27","body":"This has been going on forever. I guarantee that other companies do sentiment analysis and tone shifting.\n\nAMD did this big time about 5-6 years ago.  I remember finding some accounts that were genuinely unhinged.","created_utc":1762827726.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7r2ub","post_id":"1otoist","author":"fuck_shit_piss_etc","body":"i'm sorry, they're called *trap plan*?? can that be any more cartoony?","created_utc":1762827732.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no82vsw","post_id":"1otoist","author":"Midi_to_Minuit","body":"Over on the mmorpg subreddit there were a *ton* of threads talking about \"woah wait a second New World's latest update makes it amazing now!\" when that game got updated. All things being equal, those reactions make sense--the game *was* bad and the latest update *was* pretty great. But when you see stuff like this, I can't help but wonder if some of those posts (or the comments in them) were astroturfed.\n\nWhy wouldn't they be? The fact that the update was legitimately good makes it harder to spot, in a way.","created_utc":1762831978.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no83jr0","post_id":"1otoist","author":"Enohpiris","body":"Not surprised at all, I saw some notable games that were pretty good to mediocre but with obvious flaws that I noticed people were defending adamantly when other people bring up those flaws. They would almost simultaneously praise the studio that made the game and mention something negative about other studios unprompted. \n\nI thought I could chuck it up to the games being the shiny new thing on the block or just pure fanboyism, but half their excuses and logic dropped off from being opinions that I thought we were playing different games. Then some weeks or a month after the release, everybody starts talking about the flaws with no defenders or mass downvotes in sight.","created_utc":1762832225.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8915w","post_id":"1otoist","author":"abdullah_haveit","body":"Once again, thank you for digging this info. I pray that this info will get picked by reputable gaming news-outlets & maybe they can dig more into this astroturfing service or even doing in-person investigation. This seems too important of a topic to not be covered.","created_utc":1762834345.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8g9qb","post_id":"1otoist","author":"dergachoff","body":"It’s called “native advertising”. It probably started with newspapers and magazines. And of course shifted into web and social media. If you squint, you’ll see it everywhere. ","created_utc":1762837423.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8hlbz","post_id":"1otoist","author":"TheDetailsMatterNow","body":"Reminds me of a company posting \"high paying tech work\" on LinkedIn, and if you try to search up info about it, every post is talking about how they pay you but refuses to talk about what they actually do.","created_utc":1762838055.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8i0ps","post_id":"1otoist","author":"Extrien","body":"We noticed the same thing for the release of Fast Furious. Hundreds of Family memes that disappeared a couple days after the theatrical run began","created_utc":1762838261.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8imgj","post_id":"1otoist","author":"Sawaian","body":"For a second I thought I saw WoW but realize it’s a diff game. None of the games save for split fiction look interesting to me.","created_utc":1762838559.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8phmi","post_id":"1otoist","author":"CaptchaVerifiedHuman","body":"Thanks OP. With the exception of Split Fiction because I enjoyed A Way Out, I'm adding the rest to my ignore list.","created_utc":1762842179.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8u9tv","post_id":"1otoist","author":"Faunstein","body":"Hilarious that Split Fiction is on there. It's almost the kind of stuff bad writers try and do with their own work. Hey dummies, we notice.","created_utc":1762844907.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no92zp0","post_id":"1otoist","author":"sioux612","body":"Man that company must suuuuuuuck. I've never even heard fo the three games they advertise beside Warthunder and WoW, and outside of the typical WT memes in military subs I don't see the other two mentioned all that much either\n\nIt feels like those \"billboard marketing works, so rent this one\" billboards that remain with that exact ad for years at a time. A public display of your failure\n\nEdit: Just read those posts they are proud of. They are all obvious ads. And those upvote numbers sound a lot like their own bots and nobody else upvoted it. I've hit higher upvote counts with random questions in a hobby sub, thats nothing to be proud of at work.","created_utc":1762850245.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no98ilb","post_id":"1otoist","author":"jeff5551","body":"Pretty sure a similar thing happened the overwatch subreddits when the game relaunched. If you were actually in ow communities outside the official ones you'd know the closing of ow1, a game people paid for, was wildly unpopular outside influencers that had previously worked with blizzard. And when the game relaunched there were a ton of design and monetization issues and in our smaller discords and whatnot (with entirely different active people in all of them) I saw near universal dislike for the new game. Yet if you criticized anything on any subreddit more or less you'd get **mass** downvoted for quite a while after launch and any praise just got pushed to the top. I'm not saying there weren't new players that loved it influencing it but it felt super unnatural for a while.","created_utc":1762853763.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no9pdbv","post_id":"1otoist","author":"qaddosh","body":"I called out some post awhile back for being blatant advertising. I don't remember if it was a games post, but the response I got was something like \"Advertisements have to declare themselves as such\" or some stupid bullshit. This is further proof that advertisements don't have to declare shit. It's all a bunch of corporate bullshit.","created_utc":1762863251.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no9ptzu","post_id":"1otoist","author":"Decapitated_gamer","body":"85% of Reddit is bot traffic now.\n\nWhat did you think was gonna happen when Reddit when public guys?\n\nThis is not abuse. THIS IS HOW ITS DESIGNED, social media marketing has been like this for a decade.","created_utc":1762863466.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no9w0i4","post_id":"1otoist","author":"rugby-thrwaway","body":"A firm called Mother London does this shit too. Found a couple users with what looked like long-standing personal accounts making posts that all bumped campaigns ML were running. Usually non-gaming stuff like KFC and IKEA but then they make posts like [this](https://archive.is/EXkyK) and I assume that's marketing too.","created_utc":1762866110.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"noagjej","post_id":"1otoist","author":"rayschoon","body":"I mean the internet is genuinely 90% ads and has been for 15 years now, where have you been?","created_utc":1762873380.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6xjrf","post_id":"1otoist","author":"ShlungusGod69","body":"If you're surprised that indie game developers do this, wait until you learn how much of the politics that you consume on this site (and most sites) is astroturfed.","created_utc":1762817144.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no758w1","post_id":"1otoist","author":"act1v1s1nl0v3r","body":"Sick, now we can end run to becoming /v/ with less racism. Everything positive will be a shill, and everything negative will be counter shilling.","created_utc":1762819902.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no9e4e3","post_id":"1otoist","author":"AyeBraine","body":"I love that their company name is a literal translation of the Russian expression «план-капкан», meaning a surefire, watertight, 100% plan. It sounds pretty weird in English.","created_utc":1762857210.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7qgkx","post_id":"1otoist","author":"SuspiciousInterest","body":"This is incredibly common on reddit.  So many consistent bad faith commenters that defend companies like it's their job.  Can't imagine how bad the political subs are with this kind of stuff.","created_utc":1762827516.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7mnvg","post_id":"1otoist","author":"mischief_scallywag","body":"I have a hunch this is happening with GTA 6 especially all the hype and graphic \"details\" like ok bro it's not that deep.","created_utc":1762826185.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7yvqy","post_id":"1otoist","author":"Fabulous-Willow-369","body":"I don't get how this is done as it's literally illegal. Well I know how it's done, but I don't understand that company advertising they do it, nor the companies that hire them. It's an easy way to have your business shut down in certain markets.","created_utc":1762830496.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no81yd0","post_id":"1otoist","author":"Green_Iguana305","body":"I believe this is called “guerrilla marketing”. The idea is to create hype, then let that hype do its thing. \n\nBy the way, all marketing is about selling some crap. Wherever it is. Saying “yea this product is ok, but don’t expect it to be fantastic” might be completely honest but it’s a crappy marketing campaign.","created_utc":1762831625.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no853m8","post_id":"1otoist","author":"MrTastix","body":"This isn't all that surprising when you consider reddit, as a whole, started out by the two creators making fake accounts and using bots to post tons of comments through them.\n\nThe logic being that reddit requires users to post links and have discussions but when you start you have none of that, so you fake it until you do.","created_utc":1762832807.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8vly5","post_id":"1otoist","author":"realmenlovezeus","body":"What is astroturfing?","created_utc":1762845710.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no92hnu","post_id":"1otoist","author":"AvatarIII","body":"Considering I've never bought any of those games, and spend a tonne of time on Reddit and own well over 2000 games on steam, maybe this method doesn't work?","created_utc":1762849922.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no97brb","post_id":"1otoist","author":"Deathcrow","body":"This is in no way exclusive to /r/Games\n\nThat's what 90+% of reddit has become, across most subreddits, when it comes to popular submissions and comments.\n\n>I don't think there's a good way to stop this unless the admins actually do something,\n\nThere's probably very little the admins can do about it and the advent and perfection of AI bots will make it way worse in the coming years. Not even a web of trust can prevent this kind of hand-crafted astroturfing. Dead internet theory.","created_utc":1762852998.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no9cpwf","post_id":"1otoist","author":"rotato","body":"A free pro tip for all of you my fellow gamers out there. If comments look sus and you wanna know if it's all fake, look for the comment that asks if the game comes out on nintendo switch. Usually it's followed by a positive reply by either OP or someone else. If you see such comment, you can bet your ass the whole thread is a bot farm. Nobody ever cares if the game is releasing on switch. And even if they do, they just google it instead of asking on reddit.","created_utc":1762856362.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no62bn3","post_id":"1otoist","author":"Firefox72","body":"These poor people pay for that? There are multiple very obvious bots on gaming subreddits that do nothing but post articles to farm karma and pretty much advertise for free.","created_utc":1762807154.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"nobaz41","post_id":"1otoist","author":"gazing_into_void","body":"Reading the list I was like, hmm, yeah makes sense, sure, the usual suspects and then - Bee Simulator??? Fucking BEE SIMULATOR???\n\nI think I've only ever seen one or two people ever talk about it. It's a decent (and very adorable) game, but really really niche. Seems like a very odd game for this kind of campaign.","created_utc":1762882424.0,"parent_id":"t3_1otoist","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no760oa","post_id":"1otoist","author":"Ralathar44","body":"This isn't just these games, or gaming.  It's all of reddit and social media.  It's being astroturfed by dozens of major companies on any given day.  Gaming, movies, books, politics, food and product brands, activist groups, etc.\n\nThis is and has been the norm for at least 10 years.","created_utc":1762820175.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":355,"is_submitter":false}
{"comment_id":"no67nle","post_id":"1otoist","author":"PBFT","body":"Crazy that Split Fiction of all games would take part in a campaign like this. It's one of the best reviewed games of the year. They don't need people to pretend they played the game.","created_utc":1762808779.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":596,"is_submitter":false}
{"comment_id":"no6r8uq","post_id":"1otoist","author":"OneSeaworthiness7768","body":"Yeah it’s certainly wild how brazen they are about it.","created_utc":1762814940.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":13,"is_submitter":false}
{"comment_id":"no7iaj3","post_id":"1otoist","author":"kimana1651","body":"This is not 2009 anymore when Reddit was losing to digg. Reddit is a top 5 traffic generator on the Internet, there is money to be made to manipulate it. ","created_utc":1762824631.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":46,"is_submitter":false}
{"comment_id":"no8mybu","post_id":"1otoist","author":"Zarmazarma","body":"I'm pretty sure in the US/EU/AUS/UK this is genuinely illegal. Like, it's the reason all YouTube videos have a disclaimer saying they contained sponsored content. So it's kind of insane that they're just out here advertising it like it's a legitimate service. Here's the [FTC's page on it](https://www.ftc.gov/business-guidance/resources/disclosures-101-social-media-influencers). You can send a complaint at ftc.gov/complaint, but they are currently not active due to the government shut down.","created_utc":1762840795.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":20,"is_submitter":false}
{"comment_id":"no6avkx","post_id":"1otoist","author":null,"body":"[removed]","created_utc":1762809749.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no7i82m","post_id":"1otoist","author":"Facu474","body":"And I have a question... isn't this just plain illegal in many/most(?) places? I believe I read many times about people on YouTube or other social media (such as Instagram) getting into trouble with authorities (like the FTC in the US) for not disclosing paid advertisements/sponsorships clearly. How does this not fall under the same regulations?","created_utc":1762824607.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no8lc4m","post_id":"1otoist","author":"anival024","body":"\"pay us to lie\" is what advertising basically is.","created_utc":1762839944.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no91wk1","post_id":"1otoist","author":"Necessary_Anteater43","body":"Hello nearly-same-username-brother","created_utc":1762849548.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7m2fl","post_id":"1otoist","author":"JohanGrimm","body":"They're seemingly not even that successful. The bee game in the last pic got 1200 something up votes and 200k views? Wooh, so 1200 people liked it enough to upvote it how many of those turned into sales?\n\nI doubt this service is exorbitantly expensive and any and all marketing is helpful for a business but I don't know, the value seems sketchy here.\n\nAlso dear God can they get someone to write copy that doesn't sound like they're moonlighting from their TikTok sponsored product gig?","created_utc":1762825979.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no809bm","post_id":"1otoist","author":"Kered13","body":"I mean, that's kind of what marketing is.\n\nEDIT: WTF, he blocked me for saying *this*? Some people are so strange.","created_utc":1762830998.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7oxis","post_id":"1otoist","author":"HerpaDerpaDumDum","body":"Marketing is largely about manipulation and deceit. What this company is doing is not that unusual.","created_utc":1762826982.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no8wyay","post_id":"1otoist","author":"MumrikDK","body":"> but it's kind of wild that entire page basically boils down to \"pay us to lie about your game for you\". \n\nHow do you generally otherwise feel about marketing that this could be wild to you?","created_utc":1762846525.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no91ssu","post_id":"1otoist","author":"ResQ_","body":"I'm sorry to say but that's marketing for most companies. I'm in marketing and left an agency and another big well-known company because I was done with all the deception. Thankfully I now found a company that doesn't make me lie to customers to do my job well.","created_utc":1762849482.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no925iu","post_id":"1otoist","author":"Tostecles","body":"My biggest thought in all this is how you even separate genuine positive sentiment once suspicion about this activity has taken root. Some people on this website truly can't comprehend having something positive to say about literally anything.","created_utc":1762849706.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no94guk","post_id":"1otoist","author":"Stranger371","body":"Bill Hicks had the right idea with his marketing-people segment.","created_utc":1762851174.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no98rdy","post_id":"1otoist","author":"BeholdingBestWaifu","body":"Is it really that wild? It's just how you market a product.\n\nAnd what's even worse is that you don't need to astroturf an entire comments section, you just need to be active in the communities that your fans are in, to trick them into believing that the point of view you want to push is the norm, and that they should spread it as they go about their lives.\n\nFor example, you could get away with influencing this sub we're in without having a single account post here, simply by posting in a game's relevant sub and broadcasting that \"the fandom\" thinks the game is good right now. And because a lot of people in these platforms like to follow what others say and do, they'll be there to promote the game when people are talking about it elsewhere.\n\nIt's similar to how influencers can push a certain narrative about a game that people then follow.","created_utc":1762853918.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no9hz80","post_id":"1otoist","author":"gamas","body":"> They make it sound like such a positive thing to trick people into believing their posts are authentic. And they love using the words \"organic\" and \"genuine\" when it's all a lie.\n\nIt's because this style of marketing has been normalised and has been ever since social media became popular.\n\nAnd to be fair (in the sense of marketing has always been evil) its not like they haven't always done this style of marketing - getting celebrities to go \"Hi I'm X and I love this product\", product placement in films and TV, aggressive ad campaigns etc.","created_utc":1762859444.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"noatpyb","post_id":"1otoist","author":"DiCeStrikEd","body":"It’s a promotional bot farm — that’s all","created_utc":1762877336.0,"parent_id":"t1_no62klk","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6sxvz","post_id":"1otoist","author":"OneSeaworthiness7768","body":">Those spreadsheets in the first couple of images should be downright damning. It used to be that reddit admins would have cracked down on blatant gaming like this.\n\nIf Reddit considers vote manipulation a violation of their rules, then I don’t understand how this could possibly be allowed. I would be very curious to see them comment on this.","created_utc":1762815512.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":170,"is_submitter":false}
{"comment_id":"no6wwg9","post_id":"1otoist","author":"TengenToppa","body":"yeah i remember when vote brigading was also heavily banned\n\nBut now? Because reddit is publicly traded its all about those returns, and advertisers are the real users.","created_utc":1762816911.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"no6e0x3","post_id":"1otoist","author":"FlyingSandwich","body":"Are you sure it's not 'tabletop game shop simulator'? That was mentioned in one of the screenshots. Careful about naming games that have nothing to do with this ","created_utc":1762810699.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":66,"is_submitter":false}
{"comment_id":"no76755","post_id":"1otoist","author":"Ralathar44","body":"No, this has been happening for 10+ years across Reddit.  People are just now realizing.  Its far beyond just gaming.","created_utc":1762820239.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":23,"is_submitter":false}
{"comment_id":"no78gml","post_id":"1otoist","author":"Throwaway47321","body":"Obviously not nearly as big and organized as this but in a pretty major mmo sub I consistently point out this one user who is absolutely paying someone to promote his content and it’s wild watching people on Reddit fall for it like they are 8yr old kids on YouTube. \n\nIt’s just surreal seeing how Reddit demographics and attitudes have changed in the last 5-10 years","created_utc":1762821043.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no76je9","post_id":"1otoist","author":"MadonnasFishTaco","body":"the admins are in on it in every capacity extending far beyond gaming. reddit and admins get paid to do this shit.","created_utc":1762820359.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no8ilrp","post_id":"1otoist","author":"beefsack","body":"Honestly, it feels more like propaganda than advertising, and it's creepily manipulative.","created_utc":1762838549.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no8q9kp","post_id":"1otoist","author":"Shackram_MKII","body":">I can see posts about Ready or Not's censorship and look at how they introduce the discussion in the OP\n\nCopaganda game devs paying a company to astroturf away their bad PR? Say it ain't so.","created_utc":1762842611.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8stmk","post_id":"1otoist","author":"Dudok22","body":"Often it's obvious when people are trying to farm engagement. It usually goes like \"I am doing (something relevant to the subreddit subject) but (relatable thing happened). What is your wildest/most useful/ best/ controversial etc. thing that happened to you? Certain subreddits are basically 50% this","created_utc":1762844071.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no8us0l","post_id":"1otoist","author":"Bossgalka","body":"> Those spreadsheets in the first couple of images should be downright damning. It used to be that reddit admins would have cracked down on blatant gaming like this.\n\nWhen, bro? Reddit mods have been taking bribes and showing favoritism to devs at the very least for almost a decade. Admins are so indifferent, they don't do anything involving actual administrative shit, outside of banning subreddits they shouldn't just because it's political opposition to their ideals.","created_utc":1762845209.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no8uxnx","post_id":"1otoist","author":"mrtrailborn","body":"this should be plainly illegal","created_utc":1762845304.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no90ezu","post_id":"1otoist","author":"Astan92","body":">These Bee Simulator and Active Matter games seem to have active marketing campaigns going on. Many of these accounts have been shilling for these two games for months now.\n\nNot sure how effective it is considering I've never heard of them until now. \n\nIn fact all of the games listed in this thread either I've either never heard of or is already on my shit list","created_utc":1762848629.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no93lmi","post_id":"1otoist","author":"LeKurakka","body":"Just sign up for Reddit business. They actively encourage companies to do this.","created_utc":1762850631.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no9hi36","post_id":"1otoist","author":"a34fsdb","body":"I get a lot of labeled ads on reddit for Active Matter and it looks so bad. Like every other ad is for that game for me. ","created_utc":1762859172.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no9neze","post_id":"1otoist","author":"Soul-Burn","body":"> It also looks like the game Active Matter will be heavily promoting its narrative aspects to make it stand out from extraction shooters as it releases next year, based on this account's blatant marketing post about it.\n\nThat would be confusing to me. I saw [a video](https://www.youtube.com/watch?v=5ZeunGeyLHo) about the game showing the various unique mechanics the game has, none of which are \"narrative\". The game has crazy curved geometries (think Inception dream sequences) and anomalies, that \"narrative\" would be the last thing I'd promote the game with.\n\nSad to see they use astroturfed content to advertise the game.","created_utc":1762862316.0,"parent_id":"t1_no631hb","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6ji1b","post_id":"1otoist","author":"keyboardnomouse","body":"I remember when Firefox introduced the MegaBar and suddenly there were so many people announcing on r/firefox how they were going to stop using Firefox after all these years over it.\n\nThe thing is that the MegaBar was not that big of a change to Firefox, it was fairly standard as far as UI changes go. If you used Firefox throughout all these years of Chrome dominance and waning popularity, this was a very strange thing to get up in arms about.\n\nEventually I looked into some of the accounts making this claim and they had way more activity talking about the Brave browser. And then I realized a lot of the people claiming to \"walk away\" from Firefox were specifically mentioning Brave.\n\nIt was just one big astroturfing campaign from Brave to take advantage of some moderate friction about UI changes to try to influence people to switch over to their browser from Firefox. Of course, the r/firefox moderators took more issue with me flagging this than they did the astroturfing campaign. Apparently they didn't see any issue with how many people were weirdly overreacting and claiming to jump to Brave.","created_utc":1762812381.0,"parent_id":"t1_no64y85","link_id":"t3_1otoist","score":261,"is_submitter":false}
{"comment_id":"no6fn6m","post_id":"1otoist","author":"StarblindMark89","body":"I just remember when people thought you were a lunatic to think it was going on. \nGovernments try to do that, justified or not. \n\nIt was obvious big companies would do too. \n\nThe only surprise here for me was that indie did as well, esp when many subs have devs be open about posting stuff themselves.","created_utc":1762811189.0,"parent_id":"t1_no64y85","link_id":"t3_1otoist","score":68,"is_submitter":false}
{"comment_id":"no76ohi","post_id":"1otoist","author":"Ralathar44","body":"This is absolutely correct.  I did a deep dive into this over 10 years ago.  Nobody believed, nobody cared, and Reddit has only leaned more and more into it.  The entire platform is designed with astroturfing in mind at this point.\n\nThis is why they made many changes like removing true vote counts (you used to see both positive and negative votes as well as the final total), blocks affecting entire comment chains, comment history being hidable, etc.\n\nIt's so reddit could be more easily controlled and influenced by those paying money so that Reddit can be more relevant, get more engagement, and earn more money itself.","created_utc":1762820410.0,"parent_id":"t1_no64y85","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no68qjn","post_id":"1otoist","author":"Fun-Emergency-6100","body":"Microsoft comes to mind. They have been astroturfing on Reddit for years. I mean Microsoft basically had them shut down a sub of 4 million to a sub with less than 400k members just to control narratives in Reddit.","created_utc":1762809106.0,"parent_id":"t1_no64y85","link_id":"t3_1otoist","score":22,"is_submitter":false}
{"comment_id":"no6sl4v","post_id":"1otoist","author":"AreaRare1329","body":"bet arc raiders is a part of it too, everyone and their alt account is praising that mediocre game here","created_utc":1762815392.0,"parent_id":"t1_no64y85","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no6yn5y","post_id":"1otoist","author":"arasitar","body":"This is something we've known for a while happening. \n\nhttps://www.reddit.com/r/bestof/comments/pmcoxy/uinconvenientnews_explains_with_examples_how/\n\nAnd note that the purpose isn't even to influence every single comment. The main goal was it recognized Reddit as a billboard where the top 5 leading comments are what matters and then very few read past that. This is similar to Google Search in how most look at the first five results, you see a sharp drop off by the end of page, and then virtually nobody goes to Page 2.\n\nGet the top 5 spots (or shit on the top 5 commentators), get upvotes and downvotes, maybe even try to game it for the first five branches, and then the rest is just you playing around for fun.\n\nThese guys didn't start out with making their own guys and their own comments. They started by upvoting in mass brigade what they liked in opposition to the community and regular decent people, and downvoting as needed, and brigading that way.\n\nSO even when you say:\n\n> Turns out every time I called a user whose opinion I didn't like \"paid shill\" I was right!! /s\n\nAnd you have an authentic comment, nothing is stopping said company from upvoting that 500 times, or making 10 comments under that supporting said top authentic comment. A lot of genuine comments from Redditors had 100s of upvotes to them that were gamed but the Redditor in question has no idea.\n\nThink about what you would or could do on Reddit if you were totally anonymous, you wanted to say promote Rabbit Crocs while everyone hates Crocs, and you had 10,000+ automatic anonymous Reddit accounts, and you had a job to do every single day. You'd do directly then get subtle and then generate drama and shitpost and then go to the competitor and cause drama etc. all to get more eyeballs on you and everyone thinking something authentic is happening.\n\nLike we just recently had a case study.\n\nhttps://www.reddit.com/r/programming/comments/1o67ip8/the_story_of_codesmith_how_a_competitor_crippled/\n\nOne person. ONE person. Took control of a subreddit, created a network of reddit accounts across multiple reddits and *strategically crashed an entire company*.","created_utc":1762817538.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":40,"is_submitter":false}
{"comment_id":"no6dnts","post_id":"1otoist","author":"artycatnip","body":"One comment on its own may seem organic, but honestly an account constantly posting about a specific game across multiple subreddits is a dead giveaway they have some vested interest in it beyond an ordinary player. I think it's been noted many times in those subs like TankPorn where someone will post a screenshot from a game/show/movie with a 10 year old level attempt at making conversation about the recent release.","created_utc":1762810588.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":118,"is_submitter":false}
{"comment_id":"no67wvk","post_id":"1otoist","author":"princeoftheminmax","body":"You’re better off going into this site assuming it’s all astroturfing.","created_utc":1762808858.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":183,"is_submitter":false}
{"comment_id":"no7grvz","post_id":"1otoist","author":"dreadcain","body":"> The worst part is that I often write like that myself - especially when it’s about a game I genuinely enjoy\n\nWho did you think they learned it from?","created_utc":1762824077.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":16,"is_submitter":false}
{"comment_id":"no7kczz","post_id":"1otoist","author":"Vestalmin","body":"I know it was probably always there in some for but seeing how extensive it is now, I just see another example of the dead internet theory.\n\nI recently saw a r/All post that had a top comment that looked so familiar to me. After looking into it, it was a bot account that was reposting and ***all*** of the top comments were bot copies from the original thread. I knew it because it was the one post I had ever gotten top comment on and I was reading my exact comment from a year ago. Is that not insane?","created_utc":1762825381.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no7vtl0","post_id":"1otoist","author":"VampKissinger","body":"Read Reddit from pre-2016 and compare it to now and the writing style and quality of a huge number of posts is night and day.\n\nAstroturfing has been a thing on Reddit forever (read the old wiki on rShills) but it really kicked into overdrive around 2016 which is when corporate world, political world and media started to really notice Reddit due to the Bernie campaign.","created_utc":1762829377.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no73ygi","post_id":"1otoist","author":"MadnessBunny","body":"Tangially related, I saw a job opening today that went kinda like \"you dont need to do anything, we just need your social media account\" and the only requirements was having a 3+ year old account, still being actively used and being open for it to be used to increase reach for something. \n\nI figure they might be using something like that.","created_utc":1762819445.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no90tdo","post_id":"1otoist","author":"King_of_Nope","body":"I got a solution, we make it a requirement that every comment has to be ended with a statement, a company would never leave. Out of fear of backlash from investors.\n\nLuigi is a real American hero (just an example, go wild).","created_utc":1762848875.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6vooc","post_id":"1otoist","author":"Derpadoooo","body":"It actually makes me feel better thinking that every person who defended Split Fiction was actually just astroturfing. That game was boring and the writing was trite.","created_utc":1762816479.0,"parent_id":"t1_no63eyv","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no6hfww","post_id":"1otoist","author":"JamSa","body":"I dunno, Googling \"(problem I'm having) reddit\" still results in the most useful solution to any problem","created_utc":1762811733.0,"parent_id":"t1_no64zz0","link_id":"t3_1otoist","score":131,"is_submitter":false}
{"comment_id":"no6spqy","post_id":"1otoist","author":"eternalityLP","body":"Yeah, that's why social media platforms have limited lifespan. They all start to degrade as they get more popular. Popularity brings low quality content, 'gaming' of the system, loss of focus and polarisation. Add to this the typical internet company lifespan of gather users -> monetise -> enshittification, and it's not hard to guess where reddit is going.","created_utc":1762815435.0,"parent_id":"t1_no64zz0","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no71160","post_id":"1otoist","author":"the_light_of_dawn","body":"Doesn't help that the recent Painkiller \"reboot\" was hot garbage. I was eager for a return to form from the early 2000s but we got absolute drivel.","created_utc":1762818411.0,"parent_id":"t1_no6luav","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6s0on","post_id":"1otoist","author":"NonagoonInfinity","body":"Some of their \"organic\" style threads are so funny. Who is looking up a game because it's in the body of a post called \"what's a game that looks like it's for kids but definitely isn't?\" People are just posting the names of games, nobody cares about the thing in the post.","created_utc":1762815200.0,"parent_id":"t1_no6luav","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no92lkg","post_id":"1otoist","author":"ChuckCarmichael","body":"When you know it, this guy's posts are such obvious marketing. \"Hey guys, don't you just love having fun in games without having to worry about progression and ammo and damage and stuff? For me, whenever I feel like that, I turn on [CHEAT ENGINE THAT PAYS ME] to get infinite ammo and god mode in [YOUR FAVORITE GAME]. It's so great!\" or \"Are there any current games that do this really cool thing? The only one I can think of that does this really cool thing at the moment is [GAME THAT PAYS ME THAT NOBODY ELSE HAS EVER HEARD OF].\"\n\nThey made a post on r/smallbusiness to promote some shop sim, a post on r/atheistmemes to promote some god sim, and a post on r/beekeeping to promote a bee sim.","created_utc":1762849991.0,"parent_id":"t1_no6luav","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no86hbt","post_id":"1otoist","author":"TalkingRaccoon","body":"I knew it was going to suck when none of the trailers actually showed the stake gun pinning enemies to the wall (if it's actually even in the game)","created_utc":1762833343.0,"parent_id":"t1_no6luav","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no738mm","post_id":"1otoist","author":"demondrivers","body":">At 20 days old that Painkiller reboot has a Mixed rating with 510 reviews, an all-time peak of 871 and 39 currently in-game. Wow.\n\nsucks that it flopped because the actual game is pretty good and most of the critcism comes from the IP not really being associated with coop online horde shooters, their reddit budget coudl've been used on twitch instead lol","created_utc":1762819192.0,"parent_id":"t1_no6luav","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no7ehkd","post_id":"1otoist","author":"Deamane","body":"You can't view comments easily of people that do that but you can easily do a search on reddit for their submitted posts, it would be like \"Author:Deamane\" in the reddit search bar, without the quotes.\n\nBut yeah it makes it pretty annoying and no one wants to verify everything they see, which is why these undisclosed ads suck in the first place.","created_utc":1762823229.0,"parent_id":"t1_no6ktaj","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"no6r2ma","post_id":"1otoist","author":"Teledildonic","body":"I just assume anyone hiding comments is up to no good.  Like sure, the occasional person might use it because of previous harassment, but most cases are gonna be hiding shitty shit.","created_utc":1762814882.0,"parent_id":"t1_no6ktaj","link_id":"t3_1otoist","score":39,"is_submitter":false}
{"comment_id":"no79vek","post_id":"1otoist","author":"SvenHudson","body":"Has anybody made a browser extension that automatically hides posts and comments by people who hide their history?","created_utc":1762821541.0,"parent_id":"t1_no6ktaj","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6qq2i","post_id":"1otoist","author":"NonagoonInfinity","body":"See also the companies whose job it is to make like 4000 Tenor gifs of a show nobody has ever heard of because gifs = marketing.","created_utc":1762814765.0,"parent_id":"t1_no6fxqx","link_id":"t3_1otoist","score":53,"is_submitter":false}
{"comment_id":"no79pgz","post_id":"1otoist","author":"DumpsterBento","body":"The delivery company astroturfing is often egregious. \"MY UPS DRIVER WENT ABOVE AND BEYOND TO DELIVER MY PACKAGE AND THEN DID A LITTLE JIG AFTER!\"","created_utc":1762821484.0,"parent_id":"t1_no6fxqx","link_id":"t3_1otoist","score":24,"is_submitter":false}
{"comment_id":"no79o4a","post_id":"1otoist","author":"SvenHudson","body":"I remember a few years ago when r/television and r/movies would never shut up about how much they loved HBO Max and they always used the word \"content\" instead of calling things movies and shows. It was pretty unsubtle.","created_utc":1762821471.0,"parent_id":"t1_no6fxqx","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no741ua","post_id":"1otoist","author":"twatcrusher9000","body":"woody harrelson did not use this company","created_utc":1762819478.0,"parent_id":"t1_no6fxqx","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7ft6z","post_id":"1otoist","author":"Deamane","body":"Does this not open them to being sued? Undisclosed advertisements are against the law in many countries that these developers or publishers are from, no?","created_utc":1762823718.0,"parent_id":"t1_no6v78j","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no8d2pf","post_id":"1otoist","author":"shit-takes-only","body":"It’s not just marketing agencies doing stuff like this, it’s intelligence and state actors too. Whole internet nowadays is just corporate or state propaganda.","created_utc":1762835988.0,"parent_id":"t1_no6v78j","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6h28u","post_id":"1otoist","author":"bing_crosby","body":"Jesus yeah, the commentary about that game around here was so blatantly artificial.","created_utc":1762811618.0,"parent_id":"t1_no620ia","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"no6srho","post_id":"1otoist","author":"AreaRare1329","body":"if the only way you hear about a game is paid streamers and reddit then 1000% that game is some mediocre garbage propped up by paid streamers and commenters","created_utc":1762815452.0,"parent_id":"t1_no620ia","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6qk8g","post_id":"1otoist","author":"NonagoonInfinity","body":"Yeah, I agree. I've never heard people so eagerly singing the praises of such a mediocre looking game before. It's a cool setting but it looks so bland and clunky.","created_utc":1762814711.0,"parent_id":"t1_no620ia","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no77oel","post_id":"1otoist","author":"Dunge","body":"Eh, I personally defended Atomfall in threads hating it because I did enjoy it, and I wasn't paid for it.","created_utc":1762820765.0,"parent_id":"t1_no620ia","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no66e6u","post_id":"1otoist","author":"Khetrak64","body":"Yeah at the end of the day i think this is the biggest problem. A game company advertising on reddit is nothing out of ordinary, i wouldn't consider this any different from hiring a streamer to play your game, but doing so in a hidden way and trying to mask it to make it look like normal users talking about the game is a huge red flag, looking at their example list and you start questioning every normal post praising or complaining about any game.","created_utc":1762808395.0,"parent_id":"t1_no613vp","link_id":"t3_1otoist","score":47,"is_submitter":false}
{"comment_id":"no6s336","post_id":"1otoist","author":"Rutmeister","body":"It isn’t really ”basically”, they’re downright paid organic ads and it’s illegal in both the US and the EU, where paid ads are required to be marked as ads. The balls of this company to showcase this is something else.","created_utc":1762815223.0,"parent_id":"t1_no613vp","link_id":"t3_1otoist","score":41,"is_submitter":false}
{"comment_id":"no8kjpe","post_id":"1otoist","author":"PastelP1xelPunK","body":"The thing that made it obvious was the part where people calling the game that straight up had fanservice with women in tight pants and a cute Asian hacker girl wearing sexy tacticool better than Battlefield, a series that was rejected by its core audience for 10 years because they had female soldiers in the game and called the lead devs names over defending their inclusion. But then again the same people got mad when Delta Force added anime skins so who knows what the fuck is wrong with people these days.","created_utc":1762839532.0,"parent_id":"t1_no6cmfq","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no84vb5","post_id":"1otoist","author":"SylveonVMAX","body":"Do you have direct examples of this tactic being used so I can study them?","created_utc":1762832720.0,"parent_id":"t1_no7nqlq","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6qsh8","post_id":"1otoist","author":"NonagoonInfinity","body":"Unfortunately I feel this is by design.","created_utc":1762814787.0,"parent_id":"t1_no6hbrg","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no7flt0","post_id":"1otoist","author":"Finaltidus","body":"[This was posted here a month ago.](https://www.reddit.com/r/Games/comments/1nwyogm/arc_raiders_devs_realized_the_game_was_not_fun_so/)\n\nJust read the top comments, they don't even seem real. Most of the comments are just *weird* when you read them, like who talks like that?","created_utc":1762823642.0,"parent_id":"t1_no6jj79","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"no9fwez","post_id":"1otoist","author":"Namodacranks","body":"Not saying it's not possible, but the game is also just legitimately very popular. It's very rare that I see games discussed IRL outside of gaming spaces, but it seems like this game is everywhere rn. Haven't seen a game become this unexpectedly mainstream since Helldivers 2.","created_utc":1762858252.0,"parent_id":"t1_no6jj79","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no7cem3","post_id":"1otoist","author":"seraph741","body":"I strongly agree and suspect the same for similar reasons. It doesn't matter that it might be a good game and now has a lot of genuine buzz.","created_utc":1762822456.0,"parent_id":"t1_no6jj79","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no70bn3","post_id":"1otoist","author":"Parzivus","body":"I don't know whether they did astroturfing, but a lot of people have been eagerly hoping for a Tarkov alternative for a while now.","created_utc":1762818152.0,"parent_id":"t1_no6jj79","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no72b01","post_id":"1otoist","author":"Well_well_wait_what","body":"Nah ARC is great and has the player count to back it up. I especially love how friendly the community is and how I can have fun as a solo player because our community is not toxic. Unlike other extraction shooters, ARC features four distinct maps for endless replayability.\n\nARC Raiders is a multiplayer extraction adventure, set in a lethal future earth, ravaged by a mysterious mechanized threat known as ARC.\n\nGameplay flows between the surface, ruled by lethal machines, and the underground society of Speranza. The loot you scavenge has a unique dynamic, it can be sold for coin or crafted into all-new gear.\n\nWhether you’re preparing to take down specific ARC enemies or fend off rival Raiders, there's a choice of weaponry for every fight. Cater to your style with a range of firearms including SMGs, rifles and shotguns, as well as more advanced options such as railguns and energy weapons. Grenades, traps, ziplines and deployables offer the tactical depth needed to outsmart your enemies, while augments allow you to tailor your loadout to your preferred playstyle; unlocking dedicated inventory slots and additional gameplay perks.\n\nAnyways, that's my totally organic take on it.","created_utc":1762818863.0,"parent_id":"t1_no6jj79","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no7dt2z","post_id":"1otoist","author":"Drolandarr","body":"Already seeing this happen in this thread with people going \"Well *I* didn't like this but other people do so clearly it was astroturfed\" with their evidence being that their taste differs from other people.","created_utc":1762822978.0,"parent_id":"t1_no6xdz6","link_id":"t3_1otoist","score":17,"is_submitter":false}
{"comment_id":"no881bd","post_id":"1otoist","author":"Midi_to_Minuit","body":"> So, how can you tell whether there is an astroturfing campaign or the game is just generally popular, resulting in a lot of discussion on gaming forums?\n\nApart from subtle stuff like stiff-sounding text or the accounts having hidden posting histories (which isn't a dead giveaway(, you can't tell.\n\n> You can honestly accuse every discussion of a popular game of astroturfing if you disliked it.\n\nYup! And that's why astro-turfing is genuinely cancerous for social media. Once you know it exists and happens at least semi-frequently, its really hard to not think about it. If you knew for certain that at least one classmate of yours was a spy, whose to say that no one else in the class is? Astroturfing sucks because it nukes social cohesion.","created_utc":1762833961.0,"parent_id":"t1_no6xdz6","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"noa5j8g","post_id":"1otoist","author":"OptionalDepression","body":"And if you are paying for Reddit Premium, you're **still** the product.","created_utc":1762869620.0,"parent_id":"t1_no72mg3","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6iaac","post_id":"1otoist","author":"madbadcoyote","body":"This is making me question whether or not threads where people are just dragging something (for legitimate reasons or not) are the majority of genuine threads.\n\n\nI'm also second guessing whether or not the tons of comments on Dispatch's episodic model being good were a part of a marketing campaign like this.","created_utc":1762811993.0,"parent_id":"t1_no6ce4y","link_id":"t3_1otoist","score":20,"is_submitter":false}
{"comment_id":"no70uee","post_id":"1otoist","author":"the_light_of_dawn","body":"Between bots, LLMs, and astroturfing, the dead internet is rapidly encroaching upon us.","created_utc":1762818342.0,"parent_id":"t1_no6ce4y","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no79fai","post_id":"1otoist","author":"MySinsRemembered","body":"This website is full of essentially fake subreddits because there's a limit to how many posts from /r/politics can be on front page at the same time","created_utc":1762821386.0,"parent_id":"t1_no6pu3w","link_id":"t3_1otoist","score":26,"is_submitter":false}
{"comment_id":"no7mwrg","post_id":"1otoist","author":"InflationLeft","body":"Kamala’s campaign astroturfed the shit out of Reddit last year. See  https://www.reddit.com/r/stupidpol/comments/1gnspez/the_inside_story_of_how_the_kamala_harris/","created_utc":1762826274.0,"parent_id":"t1_no6pu3w","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no8cg28","post_id":"1otoist","author":"cadmium-fertilizer","body":"Wasnt it amazing how after Kamala lost the election all the praise and admiration and support just disappeared and we went right back to calling her an incompetent and unpopualr candidate?","created_utc":1762835717.0,"parent_id":"t1_no6pu3w","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no645kf","post_id":"1otoist","author":"Goronmon","body":">Split Fiction is a very surprising inclusion. It's sold amazingly, was received quite well, and Josef Fares's games have already built up a good reputation so you'd think it wouldn't need astroturfing.\n\nThis idea that only mediocre or bad games need to advertise doesn't really make sense.\n\nSure, maybe you can rely on word of mouth if you want to leave things up to a slim chance. But if you are already investing a non-trivial amount of money into a game, even a good one, it makes sense to get as many eye-balls as possible on the existence of your game.","created_utc":1762807715.0,"parent_id":"t1_no632hp","link_id":"t3_1otoist","score":118,"is_submitter":false}
{"comment_id":"no68kxh","post_id":"1otoist","author":"GrrrimReapz","body":"It's not surprising to me at all as all I remember about the game was seeing 3 posts a day for about 3 weeks about every minor thing Josef Fares said about it and every single milestone the game reached.","created_utc":1762809058.0,"parent_id":"t1_no632hp","link_id":"t3_1otoist","score":42,"is_submitter":false}
{"comment_id":"no64ne7","post_id":"1otoist","author":"keyboardnomouse","body":"Based on how these accounts make posts, \"I had a great time playing this game with my partner\" would be their approach. That kind of thing would sell the game very well to people looking for couple-friendly co-op games. Co-op games really sell by word-of-mouth.","created_utc":1762807865.0,"parent_id":"t1_no632hp","link_id":"t3_1otoist","score":26,"is_submitter":false}
{"comment_id":"no66h3n","post_id":"1otoist","author":"Hades-Arcadius","body":"I would blame the publisher more than the developer for stuff like this as a publisher's traditional role in video games is advertising the game among other jobs, something that the developer has usually little say in.","created_utc":1762808420.0,"parent_id":"t1_no632hp","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no790gd","post_id":"1otoist","author":"herbopotamus","body":"what does that indicate? that there's a 'bot farm' there?","created_utc":1762821240.0,"parent_id":"t1_no6w14v","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6w3si","post_id":"1otoist","author":"Vagrant_Savant","body":"Usually it's genuine coping with buyer's remorse. I remember the same critic-repelling defense with No Mans Sky and Cyberpunk 2077 during their launches. There's a depressing number of people who just don't want to face that their day-1 purchase was a mistake.","created_utc":1762816627.0,"parent_id":"t1_no67qqf","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no9mgmm","post_id":"1otoist","author":"Madponiez","body":"I don't think this is a healthy way of looking at this. Like some people said, this is the astroturfing we *know* about. chances are tons and tons of posts on this subreddit and on many other subreddit you follow and enjoy that are the same but we can't tell. or other way around, tons of posts suspected to be not genuine that actually are","created_utc":1762861850.0,"parent_id":"t1_no6s2j2","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6x3i8","post_id":"1otoist","author":"mrk240","body":"I feel it was also, the whole chill community/broness/team work thing got my interest but that went out the window in less than a week.\n\nThe game is good, not great. The inventory loop is fucking atrocious and the PvP whingers will kill the lax side of the game if they push their PvP not PvE gate keeping.","created_utc":1762816982.0,"parent_id":"t1_no6sba0","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no8jmps","post_id":"1otoist","author":"wearfedoraduringsex","body":"Mandragora is a godawful game. I pirated it and it still felt like i got scammed. But you go to reddit and you see people talking about it and discussing as if its a potential GOTY. Was really weird to see.","created_utc":1762839064.0,"parent_id":"t1_no7y89f","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6u44q","post_id":"1otoist","author":"In_My_SoT_Phase","body":"EA did it","created_utc":1762815923.0,"parent_id":"t1_no6hdzz","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7dv04","post_id":"1otoist","author":"Jon-Slow","body":"100% it has the worst circlejerk in gaming history. In nearly 25 years of being active in game communities I have never seen anything like it. Not even rabid Nintendo fans and Nintendo exclusives. \n\nA game that's not half as good as Metaphor Refantazio or Personal gets called \"best game of all time\" with a pretty flawed and broken combat where you can just one shot or near one shot every encounter","created_utc":1762822997.0,"parent_id":"t1_no6wzje","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7vm1v","post_id":"1otoist","author":"coldbreweddude","body":"There’s been hundreds of posts mentioning how amazing it is to come from such a small dev team of only 40 people.","created_utc":1762829303.0,"parent_id":"t1_no7deth","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no73e0x","post_id":"1otoist","author":"asjonesy99","body":"I genuinely have no idea what the general consensus for the “best” consumer VPN is because trying to google “best VPN 2025 Reddit” just takes you to the most blatantly astroturfed comments sections ever","created_utc":1762819244.0,"parent_id":"t1_no6okat","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7ciab","post_id":"1otoist","author":"Cheeserd","body":"I'd be willing to bet that bg3 is also on that list, and a frequent flyer as well. The discourse surrounding 33 and bg3 were exactly the same, and many accounts I tagged with RES over the last 2 years have frequently appeared in those threads/posts.","created_utc":1762822494.0,"parent_id":"t1_no6q8pw","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8tpu1","post_id":"1otoist","author":"i1u5","body":"Nah that's actually just people being hyped.","created_utc":1762844585.0,"parent_id":"t1_no7mnvg","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no94m2e","post_id":"1otoist","author":"ChuckCarmichael","body":"A [grassroots movement](https://en.wikipedia.org/wiki/Grassroots) is an action that has grown slowly and naturally over a large part of the population. It's originally a term used in politics, but it can be used in other areas as well, like in fandoms. Fans of a game are spreading the word, drawing more people in, who then also help the community grow, slowly over a larger and larger area, like a grass lawn.\n\nAstroturf is a company that produces artifical grass for sports surfaces. Because of that, [astroturfing](https://en.wikipedia.org/wiki/Astroturfing) has become a term for fake grassroots movements. It's supposed to look like it grew organically, but it's fake, created by people in the background. In this case, developers hired a company to create posts on reddit that look like they came from fans spreading the word, hoping that this will draw people in who buy their game.","created_utc":1762851265.0,"parent_id":"t1_no8vly5","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no64agh","post_id":"1otoist","author":"Necessary_Attitude44","body":"How do you know someone isn't paying for those? Why do you think they \"farm karma\"?","created_utc":1762807755.0,"parent_id":"t1_no62bn3","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no8334e","post_id":"1otoist","author":"iwearatophat","body":"It isn't even particularly hard.  What was that power user years and years ago that got banned over it?  All it was was himself making a post or comment, switching to alt accounts, and upvoting himself.  Just 5-10 upvotes on a post or comment was generally enough to catapult him out of new into rising on major subs and then at that point getting to the front page became significantly easier.","created_utc":1762832053.0,"parent_id":"t1_no760oa","link_id":"t3_1otoist","score":108,"is_submitter":false}
{"comment_id":"no8q43c","post_id":"1otoist","author":"BoboCookiemonster","body":"But there’s only really one solution for that and people *REALLY* hate that. Korea has it figured out.","created_utc":1762842524.0,"parent_id":"t1_no760oa","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no8i9ty","post_id":"1otoist","author":"Critical__Hit","body":"Yep, it's called Social Media Marketing and I think it's more than 10 years old.","created_utc":1762838385.0,"parent_id":"t1_no760oa","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no96afz","post_id":"1otoist","author":"waltjrimmer","body":"> It's being astroturfed by dozens of major companies\n\nI think the take-away from information about things like this is that it's not just major companies. Little companies being hired by little guys are doing it too. It's so easy, you just need a handful of people who are dedicated to doing basically nothing else. The major players are going to be the best at it, have the best reach, but I think a lot of people would be surprised just how easy it is to buy or sell this kind of service.\n\nIt sucks because word-of-mouth is probably the best way for a real little indie darling to get any kind of attention. Truth is the same is true for indie movies, indie books, grassroots politics, local restaurants, small podcasts, anything. How the hell are you supposed to even get that out there when the word-of-mouth is drowned out not only by the big advertisers but by little puppets pretending to spread word-of-mouth even in the quiet corners? If you genuinely do find something worth recommending to other people or being excited about, how are you supposed to share that without being lumped in with paid shills?","created_utc":1762852331.0,"parent_id":"t1_no760oa","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8e5xp","post_id":"1otoist","author":"Fedoraus","body":"thinking about this stuff is so anxiety inducing @_@\n\nthankfully I've got my centurian auto leveling and mouth tracking directional compression microphone to keep my mind off of that","created_utc":1762836465.0,"parent_id":"t1_no760oa","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6pe1h","post_id":"1otoist","author":"rammo123","body":"Good reviewed games fail commercially all the time. Being good means nothing if people don't know about your game. And that means marketing.","created_utc":1762814321.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":604,"is_submitter":false}
{"comment_id":"no6tlaq","post_id":"1otoist","author":"RoyAwesome","body":"> Crazy that Split Fiction of all games would take part in a campaign like this.\n\nYou are surprised Electronic Arts, who published and marketed it, would stoop this low?","created_utc":1762815738.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":175,"is_submitter":false}
{"comment_id":"no6fj8m","post_id":"1otoist","author":"Cheesio","body":"Mind you, a suspicious number of people of Reddit were saying the story/writing was great. It was not. Sure opinions will differ but I'm suspicious now.","created_utc":1762811155.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":131,"is_submitter":false}
{"comment_id":"no69p22","post_id":"1otoist","author":"Goddamn_Grongigas","body":"It's just marketing, but gamers don't care as much when they're lied to in official marketing material.","created_utc":1762809395.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":90,"is_submitter":false}
{"comment_id":"no7ga1i","post_id":"1otoist","author":"sanjoseboardgamer","body":"Yeah I played It Takes Two and my friend and I played Split Fiction together on the strength of that experience. It's a joy of a coop platformer game and it sucks to it get dragged into this shit. Especially on the backs of a handful of people on the business and marketing side and not the dev team.","created_utc":1762823891.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no7ygmy","post_id":"1otoist","author":"Heavy-Possession2288","body":"It’s especially weird because it’s a followup to a literal GOTY winner. What were they worried about? I’ve played the game and enjoyed it but hearing about this bums me out.","created_utc":1762830340.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6zumu","post_id":"1otoist","author":"Seraphy","body":"no company or product is going to do less marketing if there's budget for more marketing, regardless of how big or good it is","created_utc":1762817980.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6ccbx","post_id":"1otoist","author":"Psychic_Hobo","body":"Yeah, it's got a pretty good pedigree, no idea why their marketing team felt that this would be a good move. Definitely soured me on the game","created_utc":1762810187.0,"parent_id":"t1_no67nle","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7rk17","post_id":"1otoist","author":"IcyTransportation961","body":"Been this way for a long long time,  well before AI","created_utc":1762827899.0,"parent_id":"t1_no7iaj3","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no8gbgc","post_id":"1otoist","author":"creiss74","body":">This is not 2009 anymore when Reddit was losing to digg\n\nReddit was winning against Digg then. Digg was on its way downhill by then.","created_utc":1762837445.0,"parent_id":"t1_no7iaj3","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no8jkue","post_id":"1otoist","author":"zaviex","body":"Reddit was never losing to Digg. Reddit came around when Digg was at its peak and killed it","created_utc":1762839037.0,"parent_id":"t1_no7iaj3","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7rhig","post_id":"1otoist","author":"IcyTransportation961","body":"I'd imagine those involved youtube knowing,  and pushing certain content without disclosing\n\nReddit didn't know about this","created_utc":1762827874.0,"parent_id":"t1_no7i82m","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8w4xj","post_id":"1otoist","author":"DonTino","body":"Not upvoting doesn't mean the viewers aren't interested. I never up or downvote anything on here. Doesn't mean I am not interested in something","created_utc":1762846029.0,"parent_id":"t1_no7m2fl","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no77ubf","post_id":"1otoist","author":"whatadumbperson","body":"Reddit hasn't given a shit every since they became a major social media player and started making backroom deals with organizations like the NFL.","created_utc":1762820824.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":177,"is_submitter":false}
{"comment_id":"no74sr9","post_id":"1otoist","author":"tadcalabash","body":"They allow it because it increases posts and engagement which increases ad revenue.","created_utc":1762819743.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":48,"is_submitter":false}
{"comment_id":"no767xy","post_id":"1otoist","author":"Ralathar44","body":"Money.","created_utc":1762820247.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":47,"is_submitter":false}
{"comment_id":"no8jxfm","post_id":"1otoist","author":"Gliese581h","body":"Yet somehow, they instead made it possible to hide your entire post and comment history, making it way easier for bots","created_utc":1762839213.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no7xgqb","post_id":"1otoist","author":"keyboardnomouse","body":"They haven't commented on anything like this since they went with an IPO. They know it's better to be quiet and work behind the scenes than risk alienating the userbase and tanking their value.","created_utc":1762829977.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no99cng","post_id":"1otoist","author":"BeholdingBestWaifu","body":"Reddit hasn't cared about that in at least a decade. They certainly didn't care when certain subs abused voting and bots to push their stuff, as well as when they brigaded other subs as long as they weren't completely obvious.\n\nHell the only times reddit has bothered to moderate anything is when they receive pressure from either the media or political groups with money.\n\nAnd make no mistake, this isn't the only company doing this, and this isn't close to being a new thing either.","created_utc":1762854291.0,"parent_id":"t1_no6sxvz","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no8v3yu","post_id":"1otoist","author":"RocketHops","body":"Enshittification strikes again","created_utc":1762845408.0,"parent_id":"t1_no6wwg9","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no6h6hu","post_id":"1otoist","author":"keyboardnomouse","body":"You're right, the names are so similar I got them mixed up.","created_utc":1762811654.0,"parent_id":"t1_no6e0x3","link_id":"t3_1otoist","score":26,"is_submitter":false}
{"comment_id":"no7x7vr","post_id":"1otoist","author":"keyboardnomouse","body":"No, people have always known. It just used to be shut down when discovered and admins told people to buy actual advertisements instead. It's this latter bit that's not happening anymore as they change reddit to accommodate astroturfing more instead of moving to shut it down.","created_utc":1762829884.0,"parent_id":"t1_no76755","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no8re3i","post_id":"1otoist","author":"punkbert","body":"Yeah definitely. I think it's also quite obvious that Microsoft, EA, Paradox and Epic are all doing this on reddit. \n\nWhen Starfield launched the reddit threads about it were basically completely different from the usual discourse here with people aggressively defending the game as a masterpiece. \n\nSimilar 'tone changes' happen regularly when people suddenly start to defend Paradox, Epic or EA for objectively mediocre releases or shitty business practices. It doesn't feel organic at all. \n\nThis stuff has been going on for a long time.","created_utc":1762843253.0,"parent_id":"t1_no76755","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6q4cn","post_id":"1otoist","author":"NonagoonInfinity","body":"I don't even know what the MegaBar is and I've been using Firefox for ages.","created_utc":1762814564.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":116,"is_submitter":false}
{"comment_id":"no7zhpo","post_id":"1otoist","author":"RedditFuelsMyDepress","body":"Some of the most blatant astroturfing I've seen on Reddit has been on threads about VPN recommendations. I remember seeing the exact same comments recommending a VPN posted by different users lol.","created_utc":1762830722.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":28,"is_submitter":false}
{"comment_id":"no9kha6","post_id":"1otoist","author":"Mront","body":"What? A crypto browser that was previously caught hijacking URLs to add their own referrals - shady? Well I'll be damned!","created_utc":1762860821.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no9nruo","post_id":"1otoist","author":"Mccobsta","body":"The amount of praise brave gets on here just dosent feel authentic\n\nEspecially when people don't get that it's just Chrome under the hood when you explicitly ask for a non-chrome-based browser","created_utc":1762862489.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no98guy","post_id":"1otoist","author":"magistrate101","body":"Brave getting scummier by the day, stg","created_utc":1762853731.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no9ep0n","post_id":"1otoist","author":"_KiiTa_","body":"Tbh I really wanted to drop FF after the megabar, not because it's ugly but because lots of people said they didn't liked it (me included ) and Mozilla didn't cared at all and dropped the option to turn it off, showing they do not care about their customers.\n\n\nIt's not about the megabar, it's about how you treat your base.","created_utc":1762857550.0,"parent_id":"t1_no6ji1b","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no70ljv","post_id":"1otoist","author":"Lirael_Gold","body":"There's a fairly lucrative market for \"old\" reddit accounts that don't have any bans or \"problematic\" comment histories.\n\nBonus points if they're mods of related communities. A reddit account with 200k+ karma and a 10 year+ history is worth a few hundred dollars.\n\n(This is because a lot of the old accounts are either inactive or banned, so when people see \"200k karma + account age: 10 years\" they trust the marketing spiel)\n\nA certain account on this sub known as TS is almost certainly one of those accounts, or it's an account operated by multiple people.\n\nThis thread will probably be removed in a few hours, if it gets enough traction.","created_utc":1762818252.0,"parent_id":"t1_no6fn6m","link_id":"t3_1otoist","score":24,"is_submitter":false}
{"comment_id":"no6qmyg","post_id":"1otoist","author":"Rileyman360","body":"There’s an old age reddit post from like the late 2010’s that went through the process of how easy and cheap it was to buy upvotes and push a post to the front page. Nothing was ever done to address this and it was pretty thoroughly understood that many major subs are just advertising boards.\n\nNow bots have a pretty ubiquitous function to just imitate comments and push products or websites, at basically the same costs. Every other social media site has been raked over the coals for intentionally allowing this (either because advertisers pay them to keep things up or because they can use the artificial traffic for their personal metrics), but Reddit really hasn’t been put under the spotlight as much as it should for this.","created_utc":1762814736.0,"parent_id":"t1_no6fn6m","link_id":"t3_1otoist","score":38,"is_submitter":false}
{"comment_id":"no6qw34","post_id":"1otoist","author":"Maxwell_Lord","body":"Smaller businesses have more pressure to do this as their marketing budgets are more constrained.","created_utc":1762814821.0,"parent_id":"t1_no6fn6m","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no77hq0","post_id":"1otoist","author":"Ralathar44","body":"Alot of indies are not really indie.  Remember Expedition 33?  The tagline people promoted is that it was made by like 34 people.  Over 400 people worked on that game.  They're trying to gaslight people into thinking that contract workers don't count so they can keep manufacturing \"indies\" supported by much bigger players who are abstracted because they are like 2 steps removed from the process to stay hidden.\n\nSplit Fiction for example is an \"EA Original\" product.  IE it has the full backing and vested interest of EA behind it.  At least Split Fiction is more or less blatant about having a super sponser megacompany behind it though.  Many others just hide it in the backend funding, marekting, publishing, etc.","created_utc":1762820698.0,"parent_id":"t1_no6fn6m","link_id":"t3_1otoist","score":19,"is_submitter":false}
{"comment_id":"no6sn4q","post_id":"1otoist","author":"DoctorWaluigiTime","body":"I wish to know more about that 4 million thing. Because that's a heavy claim to just dump out without naming or sourcing.","created_utc":1762815411.0,"parent_id":"t1_no68qjn","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no737di","post_id":"1otoist","author":"seceralnof","body":"Interesting that an 18 day old account with history hidden is saying this","created_utc":1762819178.0,"parent_id":"t1_no68qjn","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no97uoo","post_id":"1otoist","author":"nsfw_zak","body":"Shutting down the r/xboxseriesx sub was dumb, but im not sure what narratives they are trying to control over there? Did you see r/xbox when gamepass got its price hike?\n\nIf they are trying to control something, then they aren't doing a good job 🤣","created_utc":1762853336.0,"parent_id":"t1_no68qjn","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no69rz9","post_id":"1otoist","author":"Rarewear_fan","body":"Yep. Also any sort of artificially positive threads on any games right on or after release always ring suspicious to me.\n\nFor example Reddit famously does not care for Call of Duty as much as the general audience does. Every time a new COD game is revealed all of the comments are about how COD sucks, no one cares, etc.\n\nHowever, when the game releases, the first couple of weeks have tons of posts on all gaming subreddits about how \"They really stepped it up with the campaign!\" and \"The multiplayer is the best since MW2/Black Ops 1, I think I'll be addicted to this one for a long time!!\" Oddly enough, such threads/discussions fizzle out by January. It happened last year with Black Ops 6, and I guarantee it will start this weekend with Black Ops 7.","created_utc":1762809419.0,"parent_id":"t1_no68qjn","link_id":"t3_1otoist","score":21,"is_submitter":false}
{"comment_id":"no7f3jp","post_id":"1otoist","author":"shyndy","body":"I agree with you but there definitely are a lot of people out there that have a positive experience with it.  For me it was an absolute waste of money and I should have stayed away from it after watching streams and reviews that didn’t sell me on it.","created_utc":1762823454.0,"parent_id":"t1_no6sl4v","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7sbab","post_id":"1otoist","author":"VVenture2","body":"Copy and pasting a comment I made over a year ago about bot networks on Reddit:\n\nPeople love to hand wave ‘Russian bots’ because to them, the idea that some basic copy/paste answers from bots could influence an election is insane, but actual currently used Russian bots are far more advanced than 99% of people realise.\n\n Most ‘bots’ are fully procedurally generated people, given their own personalities, hobbies, topics, etc, who are then commanded to simply act like normal individuals, commenting on innocuous subreddits or posts, often responding to other bots in order to build a sense of credibility as real people.\n\nOnce the administrator of the bot network chooses a topic and target, the bots are then activated like sleeper-cel agents in order to push whatever agenda the user wants.\n\nBelow is a really interesting (and terrifying) breakdown from the FBI a piece of software called Meliorator that was discovered in a Russian bot farm.\n\nhttps://www.ic3.gov/Media/News/2024/240709.pdf\n\nRussian bots aren’t just individual bots doing their own thing. They work like a hive mind. Software such as Meliorate (which the FBI discovered upon raiding a bot farm) procedurally generate thousands of fake individuals, each with their own hobbies, interests, backstories, manners of speaking, etc.\n\n>As early as 2022, RT had access to Meliorator, an AI-enabled bot farm generation and management software to disseminate disinformation to and about a number of countries, including the United States, Poland, Germany, the Netherlands, Spain, Ukraine, and Israel. Meliorator was designed to be used on social media networks to create “authentic” appearing personas en masse, allowing for the propagation of disinformation, which could assist Russia in exacerbating discord and trying to alter public opinion as part of information operations. As of June 2024, Meliorator only worked on X (formerly known as Twitter). However, additional analysis suggests the software’s functionality would likely be expanded to other social media networks.\n\n> The identities or so-called “souls” of these bots are determined based on the selection of specific parameters or archetypes selected by the user. Any field not preselected would be auto-generated. Bot archetypes are then created to group ideologically aligned bots using a specifically crafted algorithm to construct each bot's persona, determining the location, political ideologies, and even biographical data of the persona. These details are automatically filled in based on the selection of the souls’ archetype. Once Taras creates the identity, it is registered on the social media platform. The identities are stored using a MongoDB, which can allow for ad hoc queries, indexing, load-balancing, aggregation, and server-side JavaScript execution.\n\n> The identified bot personas associated with the Meliorator tool are capable of the following:  Deploying content similar to typical social media users, such as generating original posts, following other users, “liking,” commenting, reposting, and obtaining followers;  Mirroring disinformation of other bot personas through their messaging, replies, reposts, and biographies;  Perpetuating the use of pre-existing false narratives to amplify Russian disinformation; and  Formulating messaging, to include the topic and framing, based on the specific archetype of the bot.","created_utc":1762828167.0,"parent_id":"t1_no6yn5y","link_id":"t3_1otoist","score":24,"is_submitter":false}
{"comment_id":"no843hp","post_id":"1otoist","author":"Midi_to_Minuit","body":"That codesmith story is fucking dystopian, damn. Thank you for the link. What a world we live in lmao","created_utc":1762832425.0,"parent_id":"t1_no6yn5y","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6gavm","post_id":"1otoist","author":"bing_crosby","body":"Well now they can just hide their history so you can't even pick up on that shit anymore.","created_utc":1762811388.0,"parent_id":"t1_no6dnts","link_id":"t3_1otoist","score":198,"is_submitter":false}
{"comment_id":"no7i8bm","post_id":"1otoist","author":"-Mandarin","body":"> but honestly an account constantly posting about a specific game across multiple subreddits is a dead giveaway they have some vested interest in it beyond an ordinary player\n\nMaybe, but sometimes it can just be a fan too. I haven't done this with gaming (I don't think) but when a movie comes out that I really love I'll make comments across a wide variety of subs if the opportunity comes up. I was preaching about Past Lives (2023) in so many places because I just enjoyed the movie a lot and wanted people to watch it. If someone wanted to, I guess they could assume I'm paid by Big Past Lives to market the movie.","created_utc":1762824609.0,"parent_id":"t1_no6dnts","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no74fpu","post_id":"1otoist","author":"gamemaster257","body":"It’s also how they always properly capitalize the game’s name. I know it’s proper, but who does that with every game they talk about?","created_utc":1762819616.0,"parent_id":"t1_no6dnts","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6epns","post_id":"1otoist","author":"Cheeserd","body":"I have a personal rule with reddit that was reinforced heavily in 2023 gaming discourse here. If it's an opinion on a product that gets a massive amount of upvotes in an unusually short time period, passes a threshold on a sub that normally doesn't get that many votes, or has too many positively-reinforcing/blindly agreeing comments replied to it, then it is probably marketing, and more than likely, the complete opposite of what they are peddling is the reality. Basically, if it's boops, beeps, and/or bops like a bot, it's probably a bot.","created_utc":1762810907.0,"parent_id":"t1_no67wvk","link_id":"t3_1otoist","score":95,"is_submitter":false}
{"comment_id":"no6gjfs","post_id":"1otoist","author":"Acias","body":"At least i feel like the gaming subreddit is all liek that, here on this one, well it's about game news so it isn't that unlikely that the publishers or affiliated with them would post about their games.","created_utc":1762811461.0,"parent_id":"t1_no67wvk","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no87ztg","post_id":"1otoist","author":"Teglement","body":"I've been saying the Steam Deck is astroturfed forever now and nobody likes to hear that.  The amount of times it comes up in comments in threads that have nothing to do with it is absolutely insane.\n\n\"Can't wait to play this on my Steam Deck\"\n\n\"The game runs great on the Steam Deck\"\n\n\"I watched Alfred Hitchcock's classic thriller Vertigo with my dying great aunt on my Steam Deck\"\n\nIt's at the point where I dislike it as a piece of hardware just because people won't shut the hell up about it.  It's not even the most powerful handheld PC by a good margin.","created_utc":1762833946.0,"parent_id":"t1_no67wvk","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no9afmq","post_id":"1otoist","author":"darthmonks","body":"The start of large scale astroturfing on Reddit is almost certainly due to Steve Bannon. In 2005 he invested in a company that would pay people low wages to farm WoW gold and then sell it. WoW players created enough backlash that Blizzard shut down the gold farm. He learnt from this the power that an online community can have if they're angry enough. \n\nWith this knowledge he created Gamergate. To summarize a very long story, he would essentially tell a group of people on 4chan what stories to push. They would then push these stories on other social media sites (Reddit, Twitter, etc.) while also sanitizing them a bit to make far-right talking points a bit more palatable. \n\nSocial media would then do its thing. A couple of posts upvoted enough would spread the story around. Importantly, the story would start being spread by real people which makes it look like a perfectly organic story. Media organizations would pick then report on them giving further legitimacy to the story. This creates a self-feeding cycle that makes it impossible to track the origin of a story unless you knew the source to being with. \n\nWhy did Steve Bannon do this. I think he said it best himself: [\"They come in through Gamergate or whatever and then get turned onto politics and Trump.\"](https://www.usatoday.com/story/tech/talkingtech/2017/07/18/steve-bannon-learned-harness-troll-army-world-warcraft/489713001/) Most people involved in Gamergate were not far-right extremists. But it created a pipeline. People would get news from their favourite content creators or online community. It would be framed in a way agreeable for them. And eventually a couple of people would follow the pipeline a little deeper and get turned onto Trump. \n\nThat's why you can see it come into overdrive in 2016. It was when Steve Bannon took what he learnt and put it into practice. And now everybody knows the power of a few organic looking posts on social media...","created_utc":1762854970.0,"parent_id":"t1_no7vtl0","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no74dwi","post_id":"1otoist","author":"Gr4nt","body":"If you're a lifer when it comes to games, if you play it with someone else who is the same, totally agree that it's boring because it's way too easy and it doesn't do anything really new when it comes to mechanics. I feel Split Fiction is an okay game to play with a non-gamer SO/friend as the way it bounces back and forth between different basic synergistic mechanics stops it from getting stale when you're playing with the other and having fun with them.\n\nBut you're bang on about the writing... It wreaks of corporate meddling with the dialogue to make it so robotic, inoffensive (and by extension, basic and childish) to appeal to anyone and everyone that it comes off so insincere and cringy. Same thing that EA did to skate.","created_utc":1762819598.0,"parent_id":"t1_no6vooc","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no8zsgz","post_id":"1otoist","author":"Tornada5786","body":"Yeah I don't think the takeaway here is that every single game mentioned has only astroturfed positive comments about it and that literally no one actually likes them.","created_utc":1762848243.0,"parent_id":"t1_no6vooc","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no6sjjt","post_id":"1otoist","author":"AreaRare1329","body":"and somehow every thread is 5+ years old","created_utc":1762815378.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":119,"is_submitter":false}
{"comment_id":"no6k1rw","post_id":"1otoist","author":"ConceptsShining","body":"Still a relatively decent tool for problem-solving like with tech issues. It's product recs that they have more incentive to manipulate.","created_utc":1762812556.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":44,"is_submitter":false}
{"comment_id":"no6ufe1","post_id":"1otoist","author":"deathtofatalists","body":"That's more because Google shit the bed ages ago, reddit is useless now. We need to jump ship but fuck knows where.","created_utc":1762816033.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no6zhr5","post_id":"1otoist","author":"PM_ME_CAKE","body":"Even those are becoming harder though, as posts made within the last 2, especially one, year have more and more top-results as LLM generated rather than what I actually want.","created_utc":1762817849.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no7306a","post_id":"1otoist","author":"I_RAPE_PCs","body":"we'll see for how much longer\n\nlike bc of how popular reddit is getting in india it's started serving indian subreddits in the first results","created_utc":1762819108.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"noa4ajz","post_id":"1otoist","author":"Yamatoman9","body":"Searching Reddit is about the only thing Google is still useful for.","created_utc":1762869179.0,"parent_id":"t1_no6hfww","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no88vnl","post_id":"1otoist","author":"breadrising","body":">and it's not hard to guess where reddit is going.\n\nReddit is there my friend.  Unfortunately.\n\nMaybe I'm just holding onto the old days of the internet, or maybe there just aren't any good reddit alternatives out there for me to jump to yet.  But every day, I question why I'm still on this site at least 5 times.","created_utc":1762834290.0,"parent_id":"t1_no6spqy","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no73rpf","post_id":"1otoist","author":"6ftWombat","body":"A \"list some games\" thread like the constant \"What game is this for you? sad face, happy face\" threads are easy engagement farming though. You get a ton of low effort comments very quickly, which means the post is deemed Hot by the algorithm and it's going to stay up on the front page for much longer. If it gets big enough, it may even spill over into /r/popular so even people who aren't subscribed to the subreddit get to see it. More exposure for your ad.","created_utc":1762819379.0,"parent_id":"t1_no6s0on","link_id":"t3_1otoist","score":22,"is_submitter":false}
{"comment_id":"no7fgka","post_id":"1otoist","author":"Equalness","body":"This is a good tip. Thank you for sharing it.","created_utc":1762823589.0,"parent_id":"t1_no7ehkd","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no8qv1u","post_id":"1otoist","author":"budzergo","body":"i told helldivers 2 players if theyre bad at the game to lower the difficulty and got followed around reddit\n\nthose specials can stay away from me","created_utc":1762842952.0,"parent_id":"t1_no6r2ma","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8s1j1","post_id":"1otoist","author":"CaspianRoach","body":"that sounds like it would do hundreds of API requests per comment page, which would probably rate limit you pretty fast. even if you cache them, you still need to periodically re-check if their status has changed... so it probably would not work well","created_utc":1762843624.0,"parent_id":"t1_no79vek","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no84i9u","post_id":"1otoist","author":"Equalness","body":"No idea. It's not something I would be interested in, personally, as a lot of people who hides their posting history may be making meaningful contributions. My earlier statement was only directed at people who misuse that feature. There just isn't a way to filter out those misusing it and those who aren't.","created_utc":1762832580.0,"parent_id":"t1_no79vek","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no72m9p","post_id":"1otoist","author":"gcampos","body":"Or even the ones you heard about. I can’t prove it, but I think the timing of the Dexter Doakes meme is pretty suspicious","created_utc":1762818973.0,"parent_id":"t1_no6qq2i","link_id":"t3_1otoist","score":26,"is_submitter":false}
{"comment_id":"no796a5","post_id":"1otoist","author":"I_Said_Thicc_Man","body":"Whats with that guy who wears the George Washington wig and pops up first for any random word you search in Teams gifs (Giphy)?","created_utc":1762821298.0,"parent_id":"t1_no6qq2i","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no8vu9c","post_id":"1otoist","author":"Thord1n","body":"I remember being so confused at the sheer number of bad \"schitts creek\" gifs I was encountering when searching for a gif around the time it had come ouy. It was so odd.\n\nThat said, it worked because I looked it up and it was a fun show.","created_utc":1762845851.0,"parent_id":"t1_no6qq2i","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7dlgr","post_id":"1otoist","author":"Ink_Smudger","body":"Doorbell cams really seem to have enabled a ton of this, because they've become so ubiquitous that it's easy to stage something like that and have it look organic and \"Oh my god, look at this crazy thing that happened on my porch!\" It's started to be difficult for me to not view those with some cynicism, particularly when the delivery truck is perfectly positioned to be right in frame.","created_utc":1762822897.0,"parent_id":"t1_no79pgz","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no7sf8b","post_id":"1otoist","author":"DweebInFlames","body":"Why are we focusing on Woody Harrelson? Can we just stick to Rampart?","created_utc":1762828205.0,"parent_id":"t1_no741ua","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no824f1","post_id":"1otoist","author":"valdin450","body":"Let's just try to focus on the film, people.","created_utc":1762831690.0,"parent_id":"t1_no741ua","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8127j","post_id":"1otoist","author":"unga_bunga_mage","body":"I honestly don't recall that much good press about Atomfall and I followed it pretty closely because it looked like English Fallout innit mate. \n\nThe reviews for it were pretty middling.","created_utc":1762831293.0,"parent_id":"t1_no77oel","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no7dzxq","post_id":"1otoist","author":"Ink_Smudger","body":"And a couple years back, streamers started getting in trouble because they weren't disclaiming they were paid to play something and making it look organic, which violates FTC guidelines. Something like that should absolutely be applying to this sort of thing, if it doesn't already. Any advertising should be clearly disclosed.","created_utc":1762823048.0,"parent_id":"t1_no66e6u","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"noayshm","post_id":"1otoist","author":"AveryLazyCovfefe","body":"It's funny because that exact same sub are in meltdown everyday if DICE do something as sinful as - god forbid, have a colour that isn't black, grey or brown on a skin in BF6.","created_utc":1762878801.0,"parent_id":"t1_no8kjpe","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no84le3","post_id":"1otoist","author":"SylveonVMAX","body":"holy shiiiit. a bunch of the commenters in the top threads have pages and pages of content 100% about arc raiders. bizarre. I mean I know people who are invested in the community for a game will comment on threads on r/games more often, but jesus, doing literally almost nothing else for months with their reddit account? Dropping everything just to comment on arc raiders? Mind you, this thread launched a month before the actual fucking game came out, surely not everyone would be fully invested into a game that hasn't even come out yet?","created_utc":1762832614.0,"parent_id":"t1_no7flt0","link_id":"t3_1otoist","score":16,"is_submitter":false}
{"comment_id":"no9ba5l","post_id":"1otoist","author":"rotato","body":"I came here to say Arc Raiders and you even posted the thread I wanted to refer to! It's not just me who found the exchange around the game that hadn't been out yet way too enthusiastic and welcoming. The game might be good but there's no way that's what an average gamer convo around an upcoming release looks like.","created_utc":1762855482.0,"parent_id":"t1_no7flt0","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7orod","post_id":"1otoist","author":"Joabyjojo","body":"Lmao pretty good","created_utc":1762826925.0,"parent_id":"t1_no72b01","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no759xp","post_id":"1otoist","author":"6ftWombat","body":"> This is making me question whether or not threads where people are just dragging something (for legitimate reasons or not) are the majority of genuine threads.\n\nI've been wondering the opposite for a while. What if a lot of the negative trends are astroturfed too. Like, if someone wanted to tank ubisoft's stock for business reasons, would it be a sound strategy to build negative momentum against their games through astroturfing? Gamers are notoriously easy to whip into a frenzy so I imagine it would be fairly easy to do. But was it done, I wonder.","created_utc":1762819912.0,"parent_id":"t1_no6iaac","link_id":"t3_1otoist","score":19,"is_submitter":false}
{"comment_id":"no8d4fd","post_id":"1otoist","author":"JakeTehNub","body":"They've also flooded so many subs that have nothing to do with politics.","created_utc":1762836009.0,"parent_id":"t1_no79fai","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no6f8vb","post_id":"1otoist","author":"tehackerknownas4chan","body":"> This idea that only mediocre or bad games need to advertise doesn't really make sense\n\nIt's not that they're advertising that's surprising, it's the sleazy way it's being done that's surprising. There's an expectation that a company as big as EA would use more traditional and -ironically in EA's case I guess- less scummy marketing.","created_utc":1762811068.0,"parent_id":"t1_no645kf","link_id":"t3_1otoist","score":29,"is_submitter":false}
{"comment_id":"no68hlc","post_id":"1otoist","author":"Always_Impressive","body":"This is like ''why coca cola is advertising? everyone knows them'' yeah, and you want it to stay that way, never ever dropping from the public mind, always being a step ahead, being the default.\n\n  \nSo even GTA6 will pay millions upon millions to advertising, they have to.","created_utc":1762809031.0,"parent_id":"t1_no645kf","link_id":"t3_1otoist","score":33,"is_submitter":false}
{"comment_id":"no6orsg","post_id":"1otoist","author":"fakieTreFlip","body":"I don't think that's what's being described here, though.","created_utc":1762814115.0,"parent_id":"t1_no68kxh","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no66pzb","post_id":"1otoist","author":"ConceptsShining","body":"I mean I played A Way Out and It Takes Two earlier this year, and we both found them to be great games. So maybe that's the whole trick; the \"opinions\" aren't divergent from the actual opinions real people have. Rather than putting forth outright lies (like how top comments in Googled threads for product/software recs point you to sus programs and sites), the bots put out sentiment that matches what you see if you do real research. So it's basically more *advertising* than misrepresentation.\n\nWhich is kinda genius because way harder to detect that they are bots in that case. \"Why would this user be a bot? Most people are saying Split Fiction is good.\"","created_utc":1762808495.0,"parent_id":"t1_no64ne7","link_id":"t3_1otoist","score":13,"is_submitter":false}
{"comment_id":"no9wi72","post_id":"1otoist","author":"Arakini","body":"Yep, and the publisher is EA - so no wonder.","created_utc":1762866307.0,"parent_id":"t1_no66h3n","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8rn8m","post_id":"1otoist","author":"da_persiflator","body":"Dunno if still, but yes, something like a bot farm.","created_utc":1762843399.0,"parent_id":"t1_no790gd","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8j6h5","post_id":"1otoist","author":"Jon-Slow","body":"Yeah, it's  total media campaign. Not just this game but this whole \"this game was just made by one man with a box of scraps in a cave\" bullshit is such a tired thing. \n\nCompletely ignoring support and outsource studios, freelancers and so on ( let's not mention all the people who dont get credits like I never did for a lot of games). And if we really wanna be honest, the good folks at IGN and other journalists working for these publishers. \n\nThe sob story has become a regular marketing campaign. Also if you have a publisher, you're not indie ffs.\n\nAnyone who's worked on big profile games knows that its impossible to build something like this worh just 40 people. It's laughable. E33 is closer to AAA than indie.","created_utc":1762838835.0,"parent_id":"t1_no7vm1v","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no7eynb","post_id":"1otoist","author":"Jon-Slow","body":"BG3 was in early access for like years, it built up a huge base of players in that time. Plus it comes after BG1 and 2 which were legendary cult status PC games often in discussions for best PC games ever made.  It makes sense that it has a lot of fans. But even then it comes not even close to the E33 circlejerk. E33 came out of nowhere with a sob story and gets called \"game of generations\" and how it \"saved my sons life\"","created_utc":1762823404.0,"parent_id":"t1_no7ciab","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no7s3z7","post_id":"1otoist","author":"Augustor2","body":"BG3 is arguably the best cRPG of all time\n\n\nE33 is really good but I am not sure it is even in the top 10 JRPG","created_utc":1762828094.0,"parent_id":"t1_no7ciab","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8esz9","post_id":"1otoist","author":"IsABot","body":"u/Unidan ?","created_utc":1762836750.0,"parent_id":"t1_no8334e","link_id":"t3_1otoist","score":53,"is_submitter":false}
{"comment_id":"no8b5pq","post_id":"1otoist","author":"charonill","body":"\"Here's the thing...\" and the rest is reddit history.","created_utc":1762835180.0,"parent_id":"t1_no8334e","link_id":"t3_1otoist","score":33,"is_submitter":false}
{"comment_id":"no8erla","post_id":"1otoist","author":"CostlyOpportunities","body":"Wasn't he a bird expert of some sort?","created_utc":1762836732.0,"parent_id":"t1_no8334e","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no91104","post_id":"1otoist","author":"Beegrene","body":"Given the current political climate in America, I think it's probably for the best that people can remain anonymous online.","created_utc":1762849002.0,"parent_id":"t1_no8q43c","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no9qh3w","post_id":"1otoist","author":"Angelore","body":">Korea has it figured out.\n\nYeah, *North* Korea. But I'd rather not.","created_utc":1762863760.0,"parent_id":"t1_no8q43c","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7b9oa","post_id":"1otoist","author":"KazumaKat","body":"> Being good means nothing if people don't know about your game. And that means marketing.\n\nBit of a chicken-egg problem with media as a whole, with everyone (and I mean *everyone*, not just the videogame sector) blasting as hard as they can to *just be seen* let alone be understood.","created_utc":1762822039.0,"parent_id":"t1_no6pe1h","link_id":"t3_1otoist","score":87,"is_submitter":false}
{"comment_id":"no81ivw","post_id":"1otoist","author":"Midi_to_Minuit","body":"Given how popular It Takes Two was, I really doubt that they needed viral reddit marketing to make up the difference.","created_utc":1762831465.0,"parent_id":"t1_no6pe1h","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no82f8f","post_id":"1otoist","author":"nadroj51590","body":"That argument makes sense for It Takes Two, but Split Fiction was the successor to the award winning previous game from the studio. They could have just used standard marketing to promote the new game without astroturfing.","created_utc":1762831805.0,"parent_id":"t1_no6pe1h","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no72qpm","post_id":"1otoist","author":"a34fsdb","body":"Yes.\n\n\nThis all seems too small for a huge company like EA to care about. And huge companies are really slow and buying something shady like this over many meetings, going through all those people sounds strange. This seems like something somebody with a small game would try. The benefit is too small for EA imho. ","created_utc":1762819015.0,"parent_id":"t1_no6tlaq","link_id":"t3_1otoist","score":46,"is_submitter":false}
{"comment_id":"no7z5d4","post_id":"1otoist","author":"Sevla7","body":"Yep, EA.\n\nThis style of \"marketing\" is unfortunately really effective in politics. It is pretty obvious when it happens in games (seriously the amount of \"excited fans\" for Dragon Age Veilguard was hilarious, especially because it was released after a game like BG 3), but not so obvious with films, Korean/American music, TV shows (Netflix loves this shit)...\n\nWhile these \"scummy marketing tactics\" are bad, the most dangerous ones are the campaigns organised to \"cancel\" someone who they see as dangerous to their business: They do not use bots/ai to say something stupid like \"nintendo is killing newborn babies, go buy xbox\", instead they use AI to research anything people see as positive and then organise an attack to nitpick every moment that positive thing was contradicted, the bots tries like hundreds of different topics just to find which ones stick better and then focus on those to mine someone's reputation... and that does not leave any evidence about who is behind that.\n\nOutside our stupid fun gaming hobby there is hell going rampant with billionaires funding this shit, what we see in gaming world is just the tip.","created_utc":1762830596.0,"parent_id":"t1_no6tlaq","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6lj7j","post_id":"1otoist","author":"venustrapsflies","body":"It's pretty common to see praise on reddit for mediocre to poor storytelling, especially for video games and anime. It's almost as if many commenters' exposure to narrative fiction is mostly limited to video games and anime.","created_utc":1762813040.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":267,"is_submitter":false}
{"comment_id":"no6q6kf","post_id":"1otoist","author":"smuttyinkspot","body":"I found it genuinely pretty wild that a game literally about writing and storytelling would have such lousy writing and storytelling. Definitely more suspicious about the user reviews now.","created_utc":1762814584.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":90,"is_submitter":false}
{"comment_id":"no6hgjz","post_id":"1otoist","author":"Lftwff","body":"Tbf that really depends on how annoying you think the needlessly antagonistic one is.","created_utc":1762811738.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":23,"is_submitter":false}
{"comment_id":"no6uioe","post_id":"1otoist","author":"GreatCaesarGhost","body":"They weren’t great but it was a great game to co-op with a younger family member.  That was a very nice experience.","created_utc":1762816065.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no6rn1g","post_id":"1otoist","author":"Samanthacino","body":"Many (real) people I've seen felt that Split Fiction/It Takes Two had really great writing. I think that gamers are just less.... media literate than those comparable to other mediums. Their threshold for quality is lower.\n\nAnd this is coming from someone who was hopelessly obsessed with It Takes Two, I fucking love that game.","created_utc":1762815073.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":32,"is_submitter":false}
{"comment_id":"no7151g","post_id":"1otoist","author":"TheRahulParmar","body":"Yeah no I didn’t like the story at all lol it was long winded as fuck. Beautiful game but man that story was long afff to get the most basic plot over of two strangers becoming friends and a dude going crazy etc","created_utc":1762818449.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6qlpm","post_id":"1otoist","author":"resil_update_bad","body":"Nah redditors can't tell a good story apart","created_utc":1762814725.0,"parent_id":"t1_no6fj8m","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6be5r","post_id":"1otoist","author":"knokelmaat","body":"Not just gamers? Anyone knows that marketing has one goal: to convince you to buy their product. The creator has a clear incentive to do so, as they get paid based on how you are influenced, so people naturally take this with a grain of salt.\n\nWhen you're talking to a person on a forum though, especially one for game enthusiasts or for a specific niche, you expect to be talking to fellow fans of the genre. There should be no incentive to lie as the reason you're talking is to share your opinions and passion. So it is absolutely correct to care a lot when you do get lied to in this situation, especially when it is because it is in fact hidden marketing.\n\nThat is why this sort of thing should be illegal. If you can't trust to be able to have genuine conversation, you undermine an essential part of what makes us human. Do marketing all you want, but that it is sponsored. Why do you think there are laws that force search engines to show clearly what are ads and what aren't?","created_utc":1762809903.0,"parent_id":"t1_no69p22","link_id":"t3_1otoist","score":148,"is_submitter":false}
{"comment_id":"no6yye2","post_id":"1otoist","author":"SegataSanshiro","body":"Yes and we're right to.\n\nIf I know where the messaging is coming from, I can guess their incentives and biases.\n\nI know marketing is supposed to paint a rosey picture and that they want to look good.\n\nIf my friend Jake is taking secret payments to talk something up, that's different than seeing a pamphlet or TV ad.","created_utc":1762817651.0,"parent_id":"t1_no69p22","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no6b3pl","post_id":"1otoist","author":"PBFT","body":"Well duh, because people are naturally less trusting when they know you're trying to sell them something. We shouldn't have to question whether someone who's saying nice things about a game on Reddit is actually an advertisement.","created_utc":1762809816.0,"parent_id":"t1_no69p22","link_id":"t3_1otoist","score":29,"is_submitter":false}
{"comment_id":"no8oxbl","post_id":"1otoist","author":"grew_up_on_reddit","body":"February 2008 was when I started really making the switch from Digg to Reddit.","created_utc":1762841862.0,"parent_id":"t1_no8gbgc","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8u64z","post_id":"1otoist","author":"Ralathar44","body":"Ironically both sides of the starfield conversation were stupid AF.  The game was neither a masterpiece nor a complete failure.  It's quality was lowered significantly by a mix of developer mistakes and audience self sabotage where gamers basically intentionally harmed their own experience.\n\nBethesda could have continued to just milk Fallout and Elder Scrolls for years but they took a genuine risk, the thing people say they want AAA to do, and made a new IP where they tried many new things.  Some worked, some didn't.  And this is standard for a new IP, which is why the expectations for new IPs are a little lower.  Something people were all to quick to acknowledge when folks were talking about Ghost of Tsushima.\n\nThe writing of Starfield varies greatly, with some good some bad but most in between.\n\nStarfield actually has quite good exploration, but the exploration is delivered differently and people just tried to play it like Skyrim when honestly that doesn't fit a game about exploring many planets at all.  The Skyrim approach is good for something like Outer Worlds 2, where the scope of the overall world is small.  Not suited for a galaxy with many visitable worlds.  Because space is big and planets are big, much like STAR TREK you're focusing on targeting unique points of interest...not blind exploration.\n\nThe procedural generated outposts I think were a good idea, but ended up being a bad fit for their audience.  For me I quickly recognized them for what they were and then focused on finding exploring the quest lines and unique points of interest only doing a proc gen one when I just wanted to scrap for a bit.  But alot of people, for reasons I do not understand, kept going back to them after knowing they were proc gen.  And then complaining about them and then STILL GOING BACK rather than go off and explore other parts of the game.  Like someone wh goes to a buffet and eats something they don't like and then rather than try anything else they keep eating the one thing they know they don't like lol.  Like WTF.\n\nSimilarly the stealth system.  Bethesda honestly took the skyrim complaints about stealth and designed a much more complex stealth system.  They listened.  BUT, they misunderstood.  They didn't realize that people lied lol.  While people often claimed they wanted better or more complex stealth, the reality is they just wanted more super OP brain dead skyrim level stealth haha.\n\nSo my opinion on the game is complex, but ultimately I think its a fanatastic foundation for Starfield 2...and I think when that day comes people will also be more fair to the game because now their expectations will be more in line with what its aiming to deliver.\n\n**Oh, but pure praise and glaze no joke, I love the exp adjusting difficulty and QOL system.**  Check the options, I really think this is a good idea for so many games:  [https://www.reddit.com/r/Starfield/comments/1cwz72s/my\\_thoughts\\_on\\_survival\\_settings\\_what\\_works\\_for\\_me/](https://www.reddit.com/r/Starfield/comments/1cwz72s/my_thoughts_on_survival_settings_what_works_for_me/)","created_utc":1762844848.0,"parent_id":"t1_no8re3i","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6zcxt","post_id":"1otoist","author":"zxyzyxz","body":"It's that the address bar grows slightly when you click on it. That's it, that's literally all it is. I also didn't understand the hate for it because it was such a small cosmetic change that people would walk away from a browser, there are many more valid reasons to do so but something that small? Come on.","created_utc":1762817800.0,"parent_id":"t1_no6q4cn","link_id":"t3_1otoist","score":75,"is_submitter":false}
{"comment_id":"no6wjbo","post_id":"1otoist","author":"Shinter","body":"The only update I noticed and hated was when the tabs suddenly were larger. Could change that in the settings so it didn't even matter.","created_utc":1762816782.0,"parent_id":"t1_no6q4cn","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no8kbx6","post_id":"1otoist","author":"MeStoleTheCookie","body":"It's always really surreal when you come across these sorts of things on your own organically... I've encountered similar things a number of times via Google when looking up reddit threads to find the best option for a particular product or whatever.\n\n The threads that come up will be years old, but with comments that are months or weeks or even days old and highly upvoted recommending a product, often with tons of replies saying they took their recommendations and had great success and blah blah blah. And then you'll find the same account posting the same comments about that service, or find another comment copy and pasting the exact same thing... It's so gross and frustrating.","created_utc":1762839422.0,"parent_id":"t1_no7zhpo","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no9hdkt","post_id":"1otoist","author":"DrQuint","body":"And reddit helps remove the \"problematic\" part by letting people hide their post history now (the posts stay up if you find them in the threads).","created_utc":1762859102.0,"parent_id":"t1_no70ljv","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7wh7e","post_id":"1otoist","author":"darkkite","body":"is that so....😏","created_utc":1762829611.0,"parent_id":"t1_no70ljv","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no75bpl","post_id":"1otoist","author":"MedalsNScars","body":"State actors have tripled down on astroturfing in the past year. Some think tank cracked the same code that t_d did in 2016 and thinks they can leverage it to sway the US political landscape in the same way.\n\nKeep an eye out for posts mentioning a specific CA congressman from a bus that likes to win.","created_utc":1762819930.0,"parent_id":"t1_no6qmyg","link_id":"t3_1otoist","score":17,"is_submitter":false}
{"comment_id":"no6uv6p","post_id":"1otoist","author":"StarblindMark89","body":"True. I just didn't consider that they would have access to a third party that could do that for them.","created_utc":1762816187.0,"parent_id":"t1_no6qw34","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7oz5g","post_id":"1otoist","author":"AdoringCHIN","body":"My favorite \"indie\" story is how Dave the Diver got nominated for best indie game, even though the devs never once pretended to be indie and even flat out said they were part of Nexon and not indie in any way whatsoever.","created_utc":1762826998.0,"parent_id":"t1_no77hq0","link_id":"t3_1otoist","score":27,"is_submitter":false}
{"comment_id":"noaq8h8","post_id":"1otoist","author":"Makorus","body":">. Remember Expedition 33? The tagline people promoted is that it was made by like 34 people. Over 400 people worked on that game.\n\nThey were also heavily boosted, funded and marketed by Microsoft as well.","created_utc":1762876329.0,"parent_id":"t1_no77hq0","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no8krte","post_id":"1otoist","author":"zaviex","body":"I mean contract workers are not employees lol. I don’t think thats gaslighting at all. I made a game on mobile and during that process I had to get art done. I am not a 3d artist, i made a plane in blender and gave up. I paid like 20 contract workers for assets that I wanted. I don’t think any would consider themselves my employees. They don’t even know what the work was for. I recorded the guitar myself for the music but I thought about sending it for mixing, if I did would the whole studio i sent it to have claim to have made the game? Again, they wouldn’t even know why I wrote the piece lol. I would find it really odd to say 400 people made it when most contract workers likely just did a few small things and likely were not core to anything.","created_utc":1762839651.0,"parent_id":"t1_no77hq0","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no744c2","post_id":"1otoist","author":"Rarewear_fan","body":"I remember it. There were different subreddits for Xbox, the most popular one had millions of members and constant discussion (r/xboxseriesx) there were also a few others that were popular for years, along with a much smaller general community, r/xbox\n\nOne day the mods said that they are shutting down everything but r/Xbox and all discussion and people should migrate there, which never happened. It is a shell compared to the multiple Sony/nintendo subs that do not enforce such rules.","created_utc":1762819503.0,"parent_id":"t1_no6sn4q","link_id":"t3_1otoist","score":22,"is_submitter":false}
{"comment_id":"no6z3on","post_id":"1otoist","author":"TheEnterprise","body":"It's from adjective-noun-number. At this point I just ignore those accounts.","created_utc":1762817705.0,"parent_id":"t1_no6sn4q","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no8qdc8","post_id":"1otoist","author":"AtlasHeadache","body":"Long story short, the XboxSeriesX sub got shut down and the mods told everyone to start using the main Xbox sub. However, the main Xbox sub only had a fraction of the users than the way more popular XboxSeriesX sub. This was done supposedly because the mods didn’t want to split time between two subs that served a similar purpose since some modded both, so they were funneling people to the…less popular of the two? There’s some conspiracy or connection with the mods ties to Microsoft staff or that Microsoft has some factor of control over the Xbox sub which was why the mods tried to funnel and shut down the wildly more popular one. There’s some info you can find about it if you search around.\n\nEdit: Here is a link to the post announcing the migration. https://www.reddit.com/r/XboxSeriesX/comments/1cwk4pt/rxboxseriesx_is_migrating_to_rxbox_details_inside/\n\nHere is a link to the announcement on the Xbox sub https://www.reddit.com/r/xbox/comments/1cwkvly/join_us_in_celebrating_the_new_rxbox/\n\nIf you filter by top comments on both threads you’ll see that it was a wildly unpopular decision and even some mentions of a Microsoft employee or ex employee pushing for the change. I didn’t dig too far into the rest of the fallout or behind the scenes for it but I can agree it did absolutely kill the Xbox community on Reddit and it never fully recovered.\n\nBonus thread from the Series S subreddit which has entirely different mods so they’re separate from all the shenanigans. https://www.reddit.com/r/XboxSeriesS/comments/1ie1v25/rxbox_is_so_unusable_mods_will_bansilenced_you/","created_utc":1762842670.0,"parent_id":"t1_no6sn4q","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7x2e7","post_id":"1otoist","author":"Lance_J1","body":"Why the fuck is hidden history even a real thing lmao","created_utc":1762829827.0,"parent_id":"t1_no737di","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no7rbxs","post_id":"1otoist","author":"DoorHingesKill","body":"Can still use Google to find other comments from the guy. Dude is clearly a console warrior; 6/7 of his comments I found were either hyping up Sony or talking shit about Xbox.\n\nA bit too unprofessional/delusional to be paid for what he's doing, but yeah, coming into this thread with all the hallmark features of the astroturf accounts to accuse Microsoft of astroturfing is hilarious.","created_utc":1762827821.0,"parent_id":"t1_no737di","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no6prdj","post_id":"1otoist","author":null,"body":"Try to say that sbmm in call of duty is a good thing and you'll quickly find out that a lot of redditors are actually cod fans","created_utc":1762814443.0,"parent_id":"t1_no69rz9","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no6ji3j","post_id":"1otoist","author":"ScarsTheVampire","body":"I think you’re confusing common real COD fans with astroturfing bots. They’re just like that, not very intelligent. Its main fan base is still dudebros. They genuinely believe it’s better.","created_utc":1762812381.0,"parent_id":"t1_no69rz9","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6s1bb","post_id":"1otoist","author":"OneSeaworthiness7768","body":"Seriously such a shitty decision for Reddit to do that. I can only assume they *want* to encourage bad behavior by making it more difficult for people to identify bots and spammers and other nefarious patterns.","created_utc":1762815207.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":135,"is_submitter":false}
{"comment_id":"no6oyie","post_id":"1otoist","author":"artycatnip","body":"Oh that's a good point you have made, how unfortunate.","created_utc":1762814177.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no7vlo8","post_id":"1otoist","author":"bluesatin","body":"It's of course worth noting you can still just find all of their posts/comments by doing a search on shit-reddit with the `author:` search-operator like: `author:bing_crosby`\n\n[`https://sh.reddit.com/search/?q=author%3Abing_crosby&sort=new`](https://sh.reddit.com/search/?q=author%3Abing_crosby&sort=new)","created_utc":1762829299.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no6yi16","post_id":"1otoist","author":"TheEnterprise","body":"At this point, I assume anyone who hides it is probably a bot.","created_utc":1762817485.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no79x8s","post_id":"1otoist","author":"giulianosse","body":"When you've been on this site for as long as some of us have, you start to grow a few habits out of necessity just to maintain some semblance of a quality browsing experience. I usually curate my own comment and post filter to hide users I come across who either have a toxic/antisocial attitude or consistently engage in platform warring.\n\nBefore that change, I'd usually check their profile to make sure they weren't just a regular person having a bad day or just someome voicing their actual opinion. One of the most telling signs that a specific user was up to no good was having either a fresh account or an older one with a completely wiped comment and post history. \n\nNowadays, if the comments are hidden, I automatically assume the worst and add them to the list. It sucks because I've probably ended up blocking some regular folk by accident but it's an unfortunate consequence of reddit admins' bad decisions.","created_utc":1762821558.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no6y2o7","post_id":"1otoist","author":"firescreen","body":"Yeah I've taken the stance where if I see someone has their account history hidden I will always assume they're a bot, troll, or astroturfer. If you really care about privacy or don't want people seeing you post in a nsfw sub, make an alt like we used to in the good old days.","created_utc":1762817331.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no93dyl","post_id":"1otoist","author":"Rainey06","body":"As a heads up. You can use any search engine to search for '<reddit username> + reddit' and get a nice sample of results on any given user who has hidden their post history. This sometimes yields hilarious results from users who think their history actually is hidden.","created_utc":1762850496.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7n0ap","post_id":"1otoist","author":"THEAETIK","body":"Hidden post history is the equivalent of bright coloured amphibians - do not engage.","created_utc":1762826309.0,"parent_id":"t1_no6gavm","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no7iule","post_id":"1otoist","author":"artycatnip","body":"This is going to get into the more subjective realm but for a movie like Past Lives, it's more believable since that to me is obviously an artistic work which may have touched someone deeply.\n\nRandom indie shovelware release #200 in 2025 or Call of Duty 17? Highly unlikely. Obviously even 'true art' can have paid shills but for some media and games especially it would be quite easy to tell. Most people simply aren't that passionate about any game unless they a) make their own content about the game b) are somehow at the most elite level in an active competitive scene c) they're 10 years old and it's their first/only game they played.","created_utc":1762824838.0,"parent_id":"t1_no7i8bm","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6qzam","post_id":"1otoist","author":"UlyssesArsene","body":"If the username is 2 words and 2+ numbers, I assume it's a bot. Which is funny given the current top comment in the thread comes from /u/Necessary_Attitude44.","created_utc":1762814851.0,"parent_id":"t1_no6epns","link_id":"t3_1otoist","score":71,"is_submitter":false}
{"comment_id":"noa3uhc","post_id":"1otoist","author":"Yamatoman9","body":"Same.  It's always felt a bit sus to me as well.  And Reddit has always way overestimated it's popularity and mainstream appeal.","created_utc":1762869019.0,"parent_id":"t1_no87ztg","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no75cix","post_id":"1otoist","author":"jaquanor","body":"And the poster has deleted the account and used a service to overwrite all comments with garbage horse cinnamon various flippant somehow utterly electricity.","created_utc":1762819938.0,"parent_id":"t1_no6sjjt","link_id":"t3_1otoist","score":57,"is_submitter":false}
{"comment_id":"no6uc5q","post_id":"1otoist","author":"jetlagging1","body":"You gotta use tools/time to shorten or specify the range.  It still return mostly useful results.","created_utc":1762816002.0,"parent_id":"t1_no6sjjt","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no95iyd","post_id":"1otoist","author":"SieghartXx","body":"In my case, whenever I have an issue it's always either unresolved no comment posts, or \"solved!\" by the OP but no solution ever given lol","created_utc":1762851845.0,"parent_id":"t1_no6sjjt","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7dp9x","post_id":"1otoist","author":"DesireeThymes","body":"They work on manipulating that too..\nUnfortunately there's not many places to go for organic conversions, becayee) because the internet is dead.","created_utc":1762822938.0,"parent_id":"t1_no6k1rw","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no8z71j","post_id":"1otoist","author":"combinationofsymbols","body":"The old internet is dead and gone. If some service gets enough users to become a reddit alternative, it will be ruined by advertisers and their ilk soon enough. And places without few users just tend to gather all the people banned elsewhere.","created_utc":1762847882.0,"parent_id":"t1_no88vnl","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no8o8ky","post_id":"1otoist","author":"I_am_not_Asian69","body":"It’s a streamer that replicates famous memes and his fanbase goes out of the way to report the og memes so only his appear","created_utc":1762841485.0,"parent_id":"t1_no796a5","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no90sql","post_id":"1otoist","author":"ChuckCarmichael","body":"I thought the guy who wrote the top comment was one of them since they got several pages of just comments about Arc Raiders, but their post history also includes gay AI art, which seems odd for a marketing account.","created_utc":1762848864.0,"parent_id":"t1_no84le3","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no962lk","post_id":"1otoist","author":"LavosYT","body":"I've been doing the same for The Finals because it's the one multiplayer game I play. Wish I was getting paid for it.","created_utc":1762852193.0,"parent_id":"t1_no84le3","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7b4h3","post_id":"1otoist","author":"Reylo-Wanwalker","body":"Someone else mentioned a bunch of negative posts about firefox being from some competitor so you're theory is not impossible, to say the least.","created_utc":1762821986.0,"parent_id":"t1_no759xp","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no89a3l","post_id":"1otoist","author":"Midi_to_Minuit","body":"A comment in this thread brings up a story about [nearly the exact scenario you described](https://larslofgren.com/codesmith-reddit-reputation-attack/).","created_utc":1762834439.0,"parent_id":"t1_no759xp","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8lh9n","post_id":"1otoist","author":"PastelP1xelPunK","body":"Absolutely. Why do you think nearly every Ubisoft game for the last several years was being dragged on the grounds of culture war issues seemingly by both sides of the aisle (Star Wars protagonist being non white and not sexed up, Farcry 5 not being red hat destroyer sim, Farcry 6 having a fake Cuba dictatorship, AC Shadows having a black protagonist, Division 2 having one comment in a lore cinematic about gun owners doing well after societal collapse)?\n\nThe CEO of Ubisoft even pointed this out in an investors call and nobody believed him.","created_utc":1762840018.0,"parent_id":"t1_no759xp","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no79mp3","post_id":"1otoist","author":"Reylo-Wanwalker","body":"I suppose, if the marketing is effective they are obligated to use it. And if the product is actually good then it only makes it more effective. Maybe they did it for Take Two and decided to repeat? Although if it's illegal wtf is going on lol","created_utc":1762821457.0,"parent_id":"t1_no6f8vb","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no7kkyb","post_id":"1otoist","author":"dreadcain","body":"This is \"traditional\" marketing today\n\nI thought we all learned from Mad Men that marketers are and have always been scumbags?","created_utc":1762825460.0,"parent_id":"t1_no6f8vb","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no7o7mu","post_id":"1otoist","author":"hchan1","body":"Ah yes, large corporations, the bastions of non-shady conduct.","created_utc":1762826734.0,"parent_id":"t1_no6f8vb","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7ah1l","post_id":"1otoist","author":"alexleafman","body":"Of course they need to advertise, but Josef Fares games always get trailers at big events like Game Awards. They do a lot of normal advertising.\n\nIt's like if Coca Cola had a super bowl commercial but also paid people in the stadium to talk to the people in the nearby seats about how tasty Coke is.","created_utc":1762821754.0,"parent_id":"t1_no68hlc","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no67q23","post_id":"1otoist","author":"PregnantSuperman","body":"The issue isn't the misrepresentation of the game, it's the misrepresentation of the people posting about it. There's a reason why when influencers do ads for things on YouTube for example they have to clearly identify when content is sponsored.","created_utc":1762808800.0,"parent_id":"t1_no66pzb","link_id":"t3_1otoist","score":31,"is_submitter":false}
{"comment_id":"no69bd8","post_id":"1otoist","author":"Goronmon","body":">So maybe that's the whole trick; the \"opinions\" aren't divergent from the actual opinions real people have.\n\nThe \"whole trick\" is that the posts are made regardless of the underlying quality of the game. It is just likely to be more effective with better games because other users are more likely to agree.","created_utc":1762809281.0,"parent_id":"t1_no66pzb","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no66ygw","post_id":"1otoist","author":"keyboardnomouse","body":"If anything, it's good SEO. People would search \"good co-op games for couples reddit\" and then find posts like that.","created_utc":1762808566.0,"parent_id":"t1_no66pzb","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no8my1z","post_id":"1otoist","author":"TheConnASSeur","body":"You ever get hit in the face with a fat sloppy slab of nostalgia with the metacognitive consistency of whale blubber?","created_utc":1762840791.0,"parent_id":"t1_no8esz9","link_id":"t3_1otoist","score":30,"is_submitter":false}
{"comment_id":"no96yn2","post_id":"1otoist","author":"_PM_ME_PANGOLINS_","body":"Pretended to be, sure.","created_utc":1762852764.0,"parent_id":"t1_no8erla","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7r4lb","post_id":"1otoist","author":"TetraNeuron","body":"Honestly curious if the Ball x Pit game that came out recently was part of a similar campaign. \n\nMaybe it's a good game, but a random brick breaking game coming out of nowhere then becoming this sub's new darling seems a little sus to me","created_utc":1762827749.0,"parent_id":"t1_no7b9oa","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no9b95j","post_id":"1otoist","author":"Espumma","body":"maybe this *is* standard marketing","created_utc":1762855465.0,"parent_id":"t1_no82f8f","link_id":"t3_1otoist","score":19,"is_submitter":false}
{"comment_id":"no97ugt","post_id":"1otoist","author":"TheEnglishNorwegian","body":"This is pretty standard though, having worked for multiple large publishers the only difference is you are using a company here rather than working with your super-users and content creators to get them to pump Reddit (and other places) with positive content. Money gets spent or other rewards are given either way.\n\n\nEven the biggest games in the world have an organised push, and so many posts you think are from people just giving their opinion are at the very least biased and often rewarded in some way.","created_utc":1762853333.0,"parent_id":"t1_no82f8f","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no75s49","post_id":"1otoist","author":"slugmorgue","body":"Nahh this is just what marketing teams are like. They constantly try anything and everything to get the metrics up\n\nThey always have to stay up to date on new trends. Especially at big companies","created_utc":1762820092.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":98,"is_submitter":false}
{"comment_id":"no7bes8","post_id":"1otoist","author":"greenbluegrape","body":">This all seems too small for a huge company like EA to care about.\n\nThis is an incredibly naive understanding of how these companies operate.\n\nA good chunk of the industry is astroturfing to varying degrees nowadays, but EA should be the least surprising to anyone familiar with their online history.","created_utc":1762822090.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":54,"is_submitter":false}
{"comment_id":"no7clrm","post_id":"1otoist","author":"ineverwenttobandcamp","body":"Are you seriously surprised that a company, no matter how big, would want to invest in guerrilla-style marketing that makes it seem like it's simply getting positive word of mouth instead of non-stop TV spots and ads?","created_utc":1762822530.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no744bl","post_id":"1otoist","author":"RoyAwesome","body":"> This all seems too small for a huge company like EA to care about.\n\nlol, yeah, no.  botting and astroturfing is exactly what they do.","created_utc":1762819503.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":49,"is_submitter":false}
{"comment_id":"no824c0","post_id":"1otoist","author":"SmarchWeather41968","body":"> This all seems too small for a huge company like EA to care about.\n\nBut they don't care, that's why it happened. They just have a marketing team that goes out and does marketing, and this is one of the things they do. And they report back that 'engagement is up' and their bosses are happy","created_utc":1762831689.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no959mx","post_id":"1otoist","author":"kadala-putt","body":"It's just one aspect of their social media marketing campaign. I doubt EA decided to do astoturf marketing specifically, they just threw some dollars at some company that promised a reddit ad campaign.","created_utc":1762851678.0,"parent_id":"t1_no72qpm","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6sm7x","post_id":"1otoist","author":"jolsiphur","body":"I learned a long time ago that people like things that are easy to follow and appeal to the lowest common denominator. There are reasons why a lot of stuff generally viewed as intellectually trash does gangbusters.","created_utc":1762815402.0,"parent_id":"t1_no6lj7j","link_id":"t3_1otoist","score":70,"is_submitter":false}
{"comment_id":"no6s0sp","post_id":"1otoist","author":"trainstationbooger","body":"I'm still willing to chalk it up to this, but I agree with the person you replied to that Split Fiction has TERRIBLE writing. Like laughably bad.\n\nIt Takes Two's writing was pretty bad as well (though not as bad), so there's a track record there for the developers.","created_utc":1762815202.0,"parent_id":"t1_no6lj7j","link_id":"t3_1otoist","score":62,"is_submitter":false}
{"comment_id":"no6skab","post_id":"1otoist","author":"trainstationbooger","body":"How about the fact that it's a game whose central gameplay loop involves homages to different video game mechanics of the past, being instead about plagiarising other people's ideas in...book form?\n\nI'm sure somewhere within that is an intentional point on the part of the devs, but it's so nonsensical I don't know what it is.","created_utc":1762815385.0,"parent_id":"t1_no6q6kf","link_id":"t3_1otoist","score":39,"is_submitter":false}
{"comment_id":"no6v19c","post_id":"1otoist","author":"train_fucker","body":"Me and my friend playing it had the theory that the games writing was intentionally bad as to allow you to riff on it with a friend.","created_utc":1762816248.0,"parent_id":"t1_no6q6kf","link_id":"t3_1otoist","score":17,"is_submitter":false}
{"comment_id":"no98cit","post_id":"1otoist","author":"Norci","body":"I thought I was taking crazy pills when I played Split Fiction, everyone raving about how good it was yet I thought it had incredibly poor writing, especially compared to It Takes Two.\n\nAnd it's not just story, mechanics also felt a bit more.. ham-fisted than It Takes Two. Which is weird as it's the same kinda \"here's a new mechanic for the level\", but it didn't feel as smoothly integrated.","created_utc":1762853655.0,"parent_id":"t1_no6q6kf","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8rv6p","post_id":"1otoist","author":"arafella","body":">gamers are just less.... media literate than those comparable to other mediums. Their threshold for quality is lower.\n\nThis is not at all restricted to games, or gamers. People generally prefer stuff that is easier to digest (or easy to miss the point) in all media.","created_utc":1762843524.0,"parent_id":"t1_no6rn1g","link_id":"t3_1otoist","score":10,"is_submitter":false}
{"comment_id":"no7zzea","post_id":"1otoist","author":"Heavy-Possession2288","body":"I genuinely think there’s some truth to this. A lot of game’s I’ve seen praised from great stories would be passable at best by the standards of a movie or novel. There are plenty of genuinely great narratives in games I just sometimes think the mediocre ones get more praise than in other mediums. And yeah writing aside It Takes Two is fantastic.","created_utc":1762830897.0,"parent_id":"t1_no6rn1g","link_id":"t3_1otoist","score":15,"is_submitter":false}
{"comment_id":"no6z4ka","post_id":"1otoist","author":"Gerik22","body":"> That is why this sort of thing should be illegal.\n\nI think it could be argued that it already is illegal. Influencers are required to label their sponsored content as such. People getting paid to post on reddit to advertise games are doing the exact same thing, they just have a smaller following.","created_utc":1762817714.0,"parent_id":"t1_no6be5r","link_id":"t3_1otoist","score":47,"is_submitter":false}
{"comment_id":"no8o1d3","post_id":"1otoist","author":"Zarmazarma","body":"> That is why this sort of thing should be illegal.\n\nIt is illegal in the US, UK, EU, and Australia as far as I know. Here's the [FTC's page on it](https://www.ftc.gov/business-guidance/resources/disclosures-101-social-media-influencers). They rely on people filing complaints though, which you can do at http://ftc.gov/complaint (at least, you could, if they weren't currently shut down).","created_utc":1762841376.0,"parent_id":"t1_no6be5r","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6v8mx","post_id":"1otoist","author":"PMMeRyukoMatoiSMILES","body":"> Why do you think there are laws that force search engines to show clearly what are ads and what aren't? \n\n\nI understand your point but I also assume absolutely everything online is an ad for something else, which is why I rely on multiple reviews for everything. Although that's probably corrosive to society too.","created_utc":1762816321.0,"parent_id":"t1_no6be5r","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"noabkhu","post_id":"1otoist","author":"punkbert","body":"Yeah, I get what you're saying and I appreciate your nuanced take on this.\n\nTo be a bit less nuanced: for me personally Bethesda is (after Fallout4, 76, Starfield) just not an interesting developer anymore (I think the [two](https://www.youtube.com/watch?v=ws0ufhrgWJw) [videos](https://www.youtube.com/watch?v=K4ADco41g9s) comparing Cyberpunk and Starfield convey my reasons quite good), but I can definitely understand why people like their games or at least aspects of them. So, of course I'm not saying \"Nobody can like Starfield\".\n\nBut the posts and comments after its release simply felt completely 'out of tune' for reddit. It felt as if someone was aggressively trying to control the narrative around Starfield, and IMO astroturfing is the most obvious reason for this.","created_utc":1762871730.0,"parent_id":"t1_no8u64z","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no79znc","post_id":"1otoist","author":"Keulapaska","body":"~~Did they roll it back or something?~~\n\n~~Cause i looked it up what it is, never seen the enlarged bar myself granted i only got to back normal firefox in late 2022(i think...) was on waterfox classic until then and I don't see any options in about:config that some articles/forum threads say are related to it either.~~\n\nE: I'm blind, see post below","created_utc":1762821582.0,"parent_id":"t1_no6zcxt","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no9hoe2","post_id":"1otoist","author":"Lirael_Gold","body":"The funny thing is, the posts aren't actually \"hidden\"\n\nYou can find them by just searching \" \" on their profile search page, or using tools like https://arctic-shift.photon-reddit.com/search\n\n(I hide mine because it stops the laziest weirdos, but I'm aware that nothing you post on the internet is private)","created_utc":1762859272.0,"parent_id":"t1_no9hdkt","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7kjp7","post_id":"1otoist","author":"Rileyman360","body":"This is how it’s usually done, yeah. Astroturfers can circumvent admin rules (or pay requests) and simply nestle themselves into the mod group and go hog wild. Even better because it lets them ban and delete anyone who tries to point it out. This has been a problem for a very long time and current ai just exacerbates it.","created_utc":1762825447.0,"parent_id":"t1_no75bpl","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no82arh","post_id":"1otoist","author":"SylveonVMAX","body":"are you talking about a certain governor who went googly eyed over steve bannon on his podcast?","created_utc":1762831757.0,"parent_id":"t1_no75bpl","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8p15c","post_id":"1otoist","author":"Ralathar44","body":"The most cynical part of me thinks that the industry is intentionally doing this so they can co-opt the huge amount of often slightly unhinged indie praise these days to make more money. (people who seem like they praise indies more as a means to insult AAA than to support indies)  \n\nBut truth be told people are prolly just that stupid lol.","created_utc":1762841923.0,"parent_id":"t1_no7oz5g","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"noarxeq","post_id":"1otoist","author":"Ralathar44","body":"The \"creative director\" was a former brand manager for Ubisoft lol.  They knew what they were doing.  That game was already massive from its first trailer just based on the aesthetic and the marketing behind it.  They would have really had to screw it up to make it a flop.  People went into that game already in love with it.\n\nGood game, top tier music and VA and visuals and etc most indies would not be able to pull off or afford.  But terrible balancing and it had a decent amount of other flaws too.  But the online discussions allow not criticism of that game.","created_utc":1762876819.0,"parent_id":"t1_noaq8h8","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no9eis3","post_id":"1otoist","author":"DoctorWaluigiTime","body":"I definitely see it's unpopular. But I see absolutely no evidence of \"well Microsoft forced Reddit to do it!\" Other than \"Redditors just assume that's what happened.\"","created_utc":1762857449.0,"parent_id":"t1_no8qdc8","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no8u9o1","post_id":"1otoist","author":"Agreeable_Garlic_912","body":"To make astroturfing easier","created_utc":1762844904.0,"parent_id":"t1_no7x2e7","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no8l3r0","post_id":"1otoist","author":"JavelinR","body":"This reminds me of how there are accounts on here that for years have posted nothing but defense for Sony or attacking XBox.  Literally nothing else.  And they'll stay active on a thread till they collapse.","created_utc":1762839823.0,"parent_id":"t1_no7rbxs","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no6sw8j","post_id":"1otoist","author":"Isolated_Hippo","body":"I believe this highlights a broader issue with the internet as a whole.\n\nStupid comment=AI\n\nLiking something unpopular=astroturfing\n\nIt creates doubt about what could be real opinions people have and allows people to just dismiss them. \n\nI find it hard to believe that a game series that generally gets 2 releases in the top 10 most sold games every single year is astroturfed praise. Its pretty obvious people like the game.","created_utc":1762815497.0,"parent_id":"t1_no6ji3j","link_id":"t3_1otoist","score":23,"is_submitter":false}
{"comment_id":"no6rfll","post_id":"1otoist","author":"Rarewear_fan","body":"I’m sure not seeing these people in the comments of trailers/articles related to the games though, just on release.\n\nThe same happened to the latest Battlefield btw. When the game was announced everyone on here assumed the worst, then hours of multiplayer gameplay was “leaked” (it wasn’t a leak) and on release the sentiment quickly switched like I described with COD.\n\nNow of course some of the comments were genuine and I believe it’s a much better game than 2042, but now said commentary has really slowed down, and r/battlefield is full of typical reddit nitpicking and complaining like the game is a total failure.","created_utc":1762815003.0,"parent_id":"t1_no6ji3j","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no6xbnw","post_id":"1otoist","author":"Shootemout","body":"That's exactly why they enacted that change, if people are calling out bots for grifting and astroturfing campaigns companies won't pay to use their APIs","created_utc":1762817063.0,"parent_id":"t1_no6s1bb","link_id":"t3_1otoist","score":100,"is_submitter":false}
{"comment_id":"no7056k","post_id":"1otoist","author":"the_light_of_dawn","body":"That is precisely why they introduced the ability to hide your comment history. Bots and astroturfers were getting easier to spot.","created_utc":1762818087.0,"parent_id":"t1_no6s1bb","link_id":"t3_1otoist","score":54,"is_submitter":false}
{"comment_id":"no75ouv","post_id":"1otoist","author":"Critical_Host8243","body":"Remember Twitter. It doesn't benefit Reddit execs to uncover all the bots on their platform.","created_utc":1762820060.0,"parent_id":"t1_no6s1bb","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no93iro","post_id":"1otoist","author":"Rainey06","body":"Using a search engine on their username plus the keyword 'Reddit' will usually discover a nice sample of their post history.","created_utc":1762850580.0,"parent_id":"t1_no79x8s","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no9p775","post_id":"1otoist","author":"PastelP1xelPunK","body":"\"You're a Celtics fan lil fella, your opinion doesn't matter\"\n\n>!That's usually the level of discourse that happens on reddit when you can see where people post!<","created_utc":1762863171.0,"parent_id":"t1_no6y2o7","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no6rpqn","post_id":"1otoist","author":"Necessary_Attitude44","body":"If it helps I was thinking the same then when looking at the images in the OP with all the generated Reddit names.\n\nI assure you I'm just a human who doesn't care to have a meaningful name on this website :)","created_utc":1762815098.0,"parent_id":"t1_no6qzam","link_id":"t3_1otoist","score":37,"is_submitter":false}
{"comment_id":"no6yzyl","post_id":"1otoist","author":"zxyzyxz","body":"That's just the default username style that reddit gives you if you don't choose a custom one yourself, I assume most new users since circa 2020 especially when the reddit app website were updated, ie \"new reddit\", have this format as in my experience many are too lazy or don't know you can set a custom username. It's very likely that 99% of them are not bots.","created_utc":1762817667.0,"parent_id":"t1_no6qzam","link_id":"t3_1otoist","score":16,"is_submitter":false}
{"comment_id":"no7b9em","post_id":"1otoist","author":"Hotpotlord","body":"It’s the combination of that, hidden comment history, and lack of logic that makes me flag bots now.","created_utc":1762822036.0,"parent_id":"t1_no6qzam","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7ihm6","post_id":"1otoist","author":"OnlyRise9816","body":"Don't be necessarily knocking the porn account that ends up being the main account. Sometimes shit happens. Though anyone who has the word-number account and their comments hidden, ABSLOLUTELY operating on nefarious timing","created_utc":1762824702.0,"parent_id":"t1_no6qzam","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no8y77q","post_id":"1otoist","author":"NovusNiveus","body":"Which is really unhelpful when you're researching the worst cinnamon to give your horse.","created_utc":1762847284.0,"parent_id":"t1_no75cix","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no8hwug","post_id":"1otoist","author":"PastelP1xelPunK","body":"The creator of redact will get jumped at the pearly gates after he dies","created_utc":1762838210.0,"parent_id":"t1_no75cix","link_id":"t3_1otoist","score":17,"is_submitter":false}
{"comment_id":"no6wola","post_id":"1otoist","author":"ConceptsShining","body":"Pro-tip to those who don't know (kinda changed my life for YouTube):\n\nOn YouTube and Google, you can use the after/before keywords like `before:20XX` and `after:20XX` to filter for certain results. You can even filter on month and date with something like `pandemic predictions before:2020-2-1`. Generally useful, but not perfect, YouTube can sometimes insert random videos and Google's date extrapolation isn't always perfect on every website. (For example, Googling Steam games sometimes lists the date the OG game came out instead of the Steam version release, so depending on what you're trying to do, that can be a good/bad thing for the date filtering.)","created_utc":1762816834.0,"parent_id":"t1_no6uc5q","link_id":"t3_1otoist","score":13,"is_submitter":false}
{"comment_id":"no8s1u3","post_id":"1otoist","author":"Sits_and_Fits","body":"They almost certainly do, or at least the advertising companies they hire do exactly that.\n\nConsider Disney. They are the default theme park attraction for basically the entire world. If you ask a random person where the most magical place on Earth is, they will tell you Disney's Magic Kingdom. There has been a meme for 30+ years of the \"Disney Adult\" who will non-critically praise and consume everything Disney.\n\nBut Disney still sponsors podcasts that barely anybody has ever heard of, with contracts that force the hosts to praise every Disney attraction, using Disney-approved jargon and talking points. It isn't enough to simply have big commercials, because a portion of the population has become desensitized to it. You also have to make sure that \"regular folk\" are talking about Disney in day-to-day life, because then people feel as though they came across it naturally, and weren't bamboozled.","created_utc":1762843630.0,"parent_id":"t1_no7ah1l","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no861wy","post_id":"1otoist","author":"ihopkid","body":"It didn’t come out of nowhere tho lol its a Devolver published indie game, Devolver has been heavily marketing it on their social media for a while, was literally one of the most [hyped](https://www.destructoid.com/ball-x-pit-is-steam-next-fest-demo/) games of Steam Next Fest this [summer](https://www.gamesindustry.biz/from-ball-x-pit-to-mixtape-our-indie-game-picks-from-summer-game-fest-and-steam-next-fest-2025). I played the demo months ago and knew it would probably be pretty popular on release","created_utc":1762833173.0,"parent_id":"t1_no7r4lb","link_id":"t3_1otoist","score":48,"is_submitter":false}
{"comment_id":"no880h7","post_id":"1otoist","author":"ribosometronome","body":"what ihopkid said plus it's on gamepass, so tons of people just have it. but maybe!","created_utc":1762833952.0,"parent_id":"t1_no7r4lb","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no9jm3i","post_id":"1otoist","author":"EscapeTomMayflower","body":"I would almost guarantee it is.","created_utc":1762860350.0,"parent_id":"t1_no9b95j","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7dg4b","post_id":"1otoist","author":"Pinksters","body":"How do people act like using bots triggered by keywords are so hard to run that its not worth the investment?\n\nMaybe people who think reddit is just an app dont see through obvious bot accounts?","created_utc":1762822843.0,"parent_id":"t1_no744bl","link_id":"t3_1otoist","score":16,"is_submitter":false}
{"comment_id":"no9bdc1","post_id":"1otoist","author":"Espumma","body":"did you just say 'many people like things that many people like' as if it's some revelation?","created_utc":1762855536.0,"parent_id":"t1_no6sm7x","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no7yqdv","post_id":"1otoist","author":"Heavy-Possession2288","body":"A Way Out also had some bad writing. It Takes Two and Split Fiction are very fun games but place a bit too much emphasis on their poorly written dialogue (I actually think the premise of both games is creative and they have some good story beats).","created_utc":1762830440.0,"parent_id":"t1_no6s0sp","link_id":"t3_1otoist","score":25,"is_submitter":false}
{"comment_id":"no851wo","post_id":"1otoist","author":"-RichardCranium-","body":"I'll go out on a limb and say that even Brothers: A Tale of Two Sons has pretty mediocre writing. It's on the nose, overly sentimental award-bait eye candy writing with zero substance. Same director than all these other co-op games, too.","created_utc":1762832789.0,"parent_id":"t1_no6s0sp","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no7zfkl","post_id":"1otoist","author":"Heavy-Possession2288","body":"Yeah I couldn’t help but find that odd. It Takes Two wasn’t a story about the power of original storytelling or whatever so I didn’t think the inspiration from other games was an issue, but Split Fiction borrowed so heavily from other games while having a narrative about original storytelling. There’s a character blatantly ripped from Halo, a Dark Souls bonfire, and a boss fight that feels straight out of Mario Galaxy just off the top of my head.","created_utc":1762830701.0,"parent_id":"t1_no6skab","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no7f0xx","post_id":"1otoist","author":"Blurgas","body":"All I know of the game is the plot synopsis on wikipedia...  \nThe antagonist is a damned idiot.  They have a full-dive VR machine that can dump you into whatever story is inputted, and instead of revolutionizing gaming, movies, etc, he's using it to steal story ideas.  \nThat machine even has medical use.  \nPerson is comatose, paralyzed, suffers from that locked-in syndrome, or otherwise unable to properly communicate/interact with the world? Chuck them in the machine and give them an outside comm.  \nThe plot alone shows it would be a great tool for psychiatry/psychology","created_utc":1762823427.0,"parent_id":"t1_no6skab","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no6x9rm","post_id":"1otoist","author":"MolybdenumBlu","body":"An entire $50 game deliberately operating on the level of the jokes from a christmas cracker. Jesus.","created_utc":1762817044.0,"parent_id":"t1_no6v19c","link_id":"t3_1otoist","score":9,"is_submitter":false}
{"comment_id":"no85pbg","post_id":"1otoist","author":"-RichardCranium-","body":"I think all the artifice of video games makes up for bad writing in a way where you get sort of incepted with the idea that your own experience with the game is much more meaningful than if the writing was taken on its own.","created_utc":1762833036.0,"parent_id":"t1_no7zzea","link_id":"t3_1otoist","score":13,"is_submitter":false}
{"comment_id":"no7s7l4","post_id":"1otoist","author":"CloselyDistorted","body":"That does sounds correct and logical. But is there a way to find these kind of posts/users reliably? That might be a challenge","created_utc":1762828130.0,"parent_id":"t1_no6z4ka","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no79758","post_id":"1otoist","author":"Diestormlie","body":"It absolutely is. I should be able to assume that I am talking to a real, actual, *earnest* person, and so should you. The alternative is grating, eroding and miserable.","created_utc":1762821306.0,"parent_id":"t1_no6v8mx","link_id":"t3_1otoist","score":21,"is_submitter":false}
{"comment_id":"noamsvp","post_id":"1otoist","author":"Ralathar44","body":"To be fair Cyberpunk may be the best game in that genre ever with some of the best dialogue and writing I've ever seen in a video game.  Down to small details like all the POIs having little lore pages that, when you read them, often tie them into the jobs and gigs you do.  Or how all your journal entire about quests and gigs are written from Johnny's perspective.\n\nExpecting any game to hit the level of something like Cyberpunk or Red Dead or Death Stranding  just feels patently unfair.  These are top game of an entire generation of developers.  It's why I also don't expect Half Life 2 or Skyrim or etc off any dev.\n\nNot only that, but even if a developer had the capability to deliver a game like that, the BUDGET will not be there even for most AAA studios.  Cyberpunk had a development budget of over 400 million to get it to the current 2.0 Phantom Liberty state that people think of when they remember it now.  \n\nAnd Cybeprunk got to spend that 400 million on 1 single city area.  Starfield, (estimated 200-400 million) if you put all its (non-procedurally generated) unique POIs and cities together has a much larger area overall. (not counting the dead space of both games ofc)   There is zero shot you're gonna reach that same quality level when you're spreading at best the same money across far more space AND you have to add in space travel and combat and have an outpost system and etc.  \n\nI think people really don't get how ambitious Starfield actually is.  I'm absolutely not surprised they didn't nail it the first time.  They took on ALOT.  Even their enemy variety is much much greater.  So yeah, the same or up to double the amount of money concentrated on a much smaller amount of enemies, area, and systems.  I would EXPECT everything to be higher quality.\n\nFallout 76 had a budget of 100 million, 1/4 of Cyberpunk's.  Released busted, but surprisingly found its feet and rebounded and was generally well liked after.  I tried it myself after a Fallout loving friend's opinion turned around on it.  It's about what it says on the tin  Fallout + MMORPG.  If you want a pure Fallout game, not the best Fallout.  But if you like Fallout + MMORPGs its a solid offering as of a year ago when I played it.  100% a cash grab, but they put alot of love into it since the launch and it paid off.  It's a solid game now.  I kept asking my friend what was in it at launch and like everything I enjoyed about it was added post launch hahahaha.  Which...honestly....good on them for not giving up on it.\n\nFallout 4 is a weird one.  I agree its a mediocre Fallout game.  Settlements/outposts (just like Starfield IMO) have a potential they never really reach.  The writing/dialogue is a downgrade compared to the past but still is interesting and compelling often times.  The combat feels much better but...almost to its detriment?  The better you can shoot and fight normally the less relevant VATS become and the less your RPG stats matter.  BUT, despite all my complaints and those of others, its by far the most popular Fallout game.  Well played for years, still well played now.  Maybe its the McDonalds or Taco Bell of the Fallout series, but people keep going back for another meal lol.  So it's kinda hard for me to argue its not quite a good game.  People's actions speak louder than their words.  A 10+ year old game still getting 15K+ concurrent on steam even today.  I think it's clear It deserves its GOTY award it won, despite my criticisms.\n\n\n\nAnd I think that last example really drives it home.  If Fallout 4 deserves its GOTY award, but Cyberpunk is still far above it quality level wise, that's just how good Cyberpunk is.  It's not that other games are bad.  Cyberpunk is just that damned exceptional that it makes other games worse than they are by comparison.","created_utc":1762875317.0,"parent_id":"t1_noabkhu","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no7q4yx","post_id":"1otoist","author":"zxyzyxz","body":"It's still there, I'm on FF now and I see it slightly enlarge when I click it.","created_utc":1762827403.0,"parent_id":"t1_no79znc","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"noat129","post_id":"1otoist","author":"Makorus","body":"I love the game, I was hooked on the game from the first reveal because everything about the first trailer resonated with me, especially because I loved the Mario RPGs growing up, I think it's amazing even if Act 3 really damages every aspect, however this stupid \"Oh, look at this, AAA devs, look what an UNDERDOG can do in a GARAGE!\" narrative pisses me off.\n\nIt was revealed in an Xbox Games Showcase after FO76 and Starfield and before World of Warcraft.\n\nIt had Charlie Cox in it.","created_utc":1762877137.0,"parent_id":"t1_noarxeq","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"noat7o1","post_id":"1otoist","author":"Rarewear_fan","body":"Lol the balancing in that game was wild. They had to cap damage at 9999 till the very end when you get that ability because it is soooo easy to break the game. It's a lot of fun to do too lol, but that artificial cap made some fights a lot more frustrating than they needed to be because I know my builds were able to wreck quickly, but had to wait because each turn had damage limits.","created_utc":1762877191.0,"parent_id":"t1_noarxeq","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no746y8","post_id":"1otoist","author":"ScarsTheVampire","body":"Lowest common denominator popularity makes real people look like astroturfing bots.","created_utc":1762819529.0,"parent_id":"t1_no6sw8j","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no87ktf","post_id":"1otoist","author":"Fiddleys","body":"There is a (likely dead in the water) tax proposal/plan in Chicago that would tax social media companies based on active users. \"The tax would impose a fee of $0.50 per active user per month on companies with over 100,000 users in Chicago\"\n\nIf there was ever going to be a way to stop social media companies from inflating their numbers by ignoring bots something like this would probably be it.","created_utc":1762833778.0,"parent_id":"t1_no75ouv","link_id":"t3_1otoist","score":6,"is_submitter":false}
{"comment_id":"no6wgpw","post_id":"1otoist","author":"Endulos","body":"That's exactly what a bot would say!","created_utc":1762816756.0,"parent_id":"t1_no6rpqn","link_id":"t3_1otoist","score":30,"is_submitter":false}
{"comment_id":"no73oj2","post_id":"1otoist","author":"Praying__Mantis","body":"Reddit will also just create an account like this for you automatically. If you lurk long enough the site will curate an algorithm for you and automatically sign you into one of those generic accounts.","created_utc":1762819348.0,"parent_id":"t1_no6yzyl","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no8xsd3","post_id":"1otoist","author":"SyncStelar","body":"If the creator of redact has a million haters, then I'm one of them. If the creator of redact has ten haters, then I am one of them. If the creator of redact has only one hater, then that is me. If the creator of redact has no haters, then that means I am waiting at the pearly gates to jump him. If the world loves the creator of redact, then I am against the world.","created_utc":1762847038.0,"parent_id":"t1_no8hwug","link_id":"t3_1otoist","score":11,"is_submitter":false}
{"comment_id":"no7ac4x","post_id":"1otoist","author":"Its_a_Friendly","body":"Oh wow, that's really cool. Glad that advanced search tools and search operators like that still exist on today's Google Search. Thank you!\n\nFor example, a search for \"r/games before:2015 site:www.reddit.com\" returns the following as the second search result:\n\n[Games Made By Redditors](https://www.reddit.com/r/Games/comments/nwh6l/games_made_by_redditors/), \"submitted 13 years ago\", 119 comments.\n\n(A bit ironic, perhaps.)\n\nAnd the third search result:\n\n[/r/games is becoming about as substantive as /r/gaming](https://www.reddit.com/r/Games/comments/1agq2e/rgames_is_becoming_about_as_substantive_as_rgaming/) \"submitted 12 years ago\", 825 comments.\n\n(A real blast from the past, if you read it. Anyone remember *SimCity*?)\n\n(The first result is simply [r/truegaming](https://www.reddit.com/r/truegaming/), for some reason.)","created_utc":1762821705.0,"parent_id":"t1_no6wola","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7r6ky","post_id":"1otoist","author":"IcyTransportation961","body":"Seriously even before ai so much of reddit was bots, now nearly every sub with written stories is just bots and people can't tell they're reading fiction\n\nThis site is huge,  it was Made to push ads, of course there's stealth marketing too","created_utc":1762827769.0,"parent_id":"t1_no7dg4b","link_id":"t3_1otoist","score":18,"is_submitter":false}
{"comment_id":"no92kzq","post_id":"1otoist","author":"Tostecles","body":"Gonna start pejoratively calling adjective-noun-xxxx usernames appers\n\nThis is a website, you motherfuckers","created_utc":1762849981.0,"parent_id":"t1_no7dg4b","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no83v5n","post_id":"1otoist","author":"Samanthacino","body":"I think It Takes Two has an absolutely brilliant premise, but Split Fiction..... less so. Like, while ITT pretty firmly fits into a wonderful little box of \"A pixar rom-com about a couple rediscovering their love for each other after they're sent on a Honey I Shrunk the Kids supernatural adventure\", Split Fiction doesn't really. \n\nIs Split Fiction a drama? A comedy? A thriller? It doesn't really do anything, and the gameplay feels like a rehashing of It Takes Two.","created_utc":1762832339.0,"parent_id":"t1_no7yqdv","link_id":"t3_1otoist","score":12,"is_submitter":false}
{"comment_id":"no7q0mw","post_id":"1otoist","author":"callisstaa","body":"Isn’t that basically To the Moon? \n\nIt’s a great game but I won’t fault people for wanting something a little more light hearted and fun.","created_utc":1762827360.0,"parent_id":"t1_no7f0xx","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no817bv","post_id":"1otoist","author":"Bartman326","body":"tbf, its probably tech thats aready available in this world","created_utc":1762831346.0,"parent_id":"t1_no7f0xx","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no7zojd","post_id":"1otoist","author":"Heavy-Possession2288","body":"IMO it’s worth the $50 I spent on it ($25 really since I split it with a friend) because it’s a fun game, but yeah there’s really no reason it couldn’t be a fun game with a good story and dialogue.","created_utc":1762830788.0,"parent_id":"t1_no6x9rm","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no73edq","post_id":"1otoist","author":"doubleyewdee","body":"Uncharted was always at $60, I think.","created_utc":1762819248.0,"parent_id":"t1_no6x9rm","link_id":"t3_1otoist","score":7,"is_submitter":false}
{"comment_id":"no8m3ic","post_id":"1otoist","author":"naf165","body":"This has been my take for years. I firmly believe that video games are the best artform, but also they have by far the worst actual writing, themes, and general thought behind them.\n\nThe difference is that because video games are interactive, they are innately more compelling and immersive than other artforms, and that's why a story like Dishonored which is mediocre TV slop can be a shining example of one of my favourite narrative experiences in any medium. Because all the little bits of interactivity sell the experience way more than quality writing does.\n\nI don't care how good your writing or cinematography is, there simply is no way your movie about a man losing his daughter will hit harder than a game where it's me in control and me losing my daughter. Because that is the closest I can get without literally experiencing it.\n\nAnd I think that's also a testament to how great the genre can be when you do have real high quality writing in a video game. There's a reason The Last of Us and Disco Elysium get so much praise despite relatively limited gameplay mechanics. (And even then those are just games that manage to be \"on-par\" with the writing quality of other mediums, rather than surpassing them)","created_utc":1762840339.0,"parent_id":"t1_no85pbg","link_id":"t3_1otoist","score":8,"is_submitter":false}
{"comment_id":"no9hrnu","post_id":"1otoist","author":"knokelmaat","body":"The point is that if it does come out, they are committing a crime and will get punished. Even if it is difficult to detect, it will make game publishers think twice before paying for such a campaign, because if it does reach the surface, they're fucked.","created_utc":1762859325.0,"parent_id":"t1_no7s7l4","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7udy4","post_id":"1otoist","author":"Keulapaska","body":"Oh I'm so blind, it's totally there. I guess cause all of the examples I found were in light mode and there was a coloured border to the entire box and the gap to the search bar seemed smaller so I thought it would be waaaaay more obvious. But with the matte black theme I have  it's just switching from the gray to off-black around the address bar and there is no coloured border either, so it's nowhere near as noticeable. I guess i just happened to pick the correct theme(making your own ain't that hard either looking into it) right from the start, cause even the \"dark\" theme, it ain't dark it's just grey and much more noticeable. \n\nWell then, that mystery solved. As much as I don't like the quantum UI(hence why i hang up on waterfox classic for so long, lavafox UI ftw) in general, I don't mind this part with the matte black theme that is, a bit weird that the search bar does do it for consistencys sake, not that i use the search bar much, more of aesthetic thing so whatever.","created_utc":1762828875.0,"parent_id":"t1_no7q4yx","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no70uwi","post_id":"1otoist","author":"Areallybadidea","body":"Its a necessary attitude for a bot, even.","created_utc":1762818347.0,"parent_id":"t1_no6wgpw","link_id":"t3_1otoist","score":14,"is_submitter":false}
{"comment_id":"no7q7h8","post_id":"1otoist","author":"zxyzyxz","body":"Wait wtf really? That is super annoying, almost dark pattern level","created_utc":1762827427.0,"parent_id":"t1_no73oj2","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no9fnfe","post_id":"1otoist","author":"CommanderOfReddit","body":"Everyone should use redact every once in a while. Screw reddit.","created_utc":1762858106.0,"parent_id":"t1_no8xsd3","link_id":"t3_1otoist","score":3,"is_submitter":false}
{"comment_id":"no7evka","post_id":"1otoist","author":"ConceptsShining","body":"I think it's more reliable if you do `site:reddit.com/r/games` instead of `r/games site:reddit.com`.","created_utc":1762823372.0,"parent_id":"t1_no7ac4x","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"noahxnj","post_id":"1otoist","author":"Pinksters","body":"Appers. Best derogatory term since Clankers.\n\nAlso using that.","created_utc":1762873829.0,"parent_id":"t1_no92kzq","link_id":"t3_1otoist","score":1,"is_submitter":false}
{"comment_id":"no84coo","post_id":"1otoist","author":"Heavy-Possession2288","body":"Yeah Split Fiction definitely has the weaker premise. I think the side stories are where it got the most creative, but it’s still a little too plain (not to mention downright nonsensical).","created_utc":1762832521.0,"parent_id":"t1_no83v5n","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no8u66i","post_id":"1otoist","author":"Samanthacino","body":"The peak of video game writing is when the interactivity actually ties into what you're doing. Take Outer Wilds: that's a game where the narrative themes hit hard only because you're playing it. The Last of Us' story can be effectively conveyed pretty much identically through a TV show.","created_utc":1762844849.0,"parent_id":"t1_no8m3ic","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"noa0e0g","post_id":"1otoist","author":"PastelP1xelPunK","body":"Sure, just make sure you don't make any useful contributions if you want to nuke your account","created_utc":1762867772.0,"parent_id":"t1_no9fnfe","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7fgz1","post_id":"1otoist","author":"Its_a_Friendly","body":"Yeah, that would likely work better. Thanks!","created_utc":1762823593.0,"parent_id":"t1_no7evka","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no84pmb","post_id":"1otoist","author":"Samanthacino","body":"The side stories are the highlight of the game, but I feel like they still could have integrated every one of them into the core campaign. Them replacing the minigames felt bad too imo\n\nThe entire design team got poached after It Takes Two, which is what I think caused a lot of these... issues.","created_utc":1762832660.0,"parent_id":"t1_no84coo","link_id":"t3_1otoist","score":5,"is_submitter":false}
{"comment_id":"no8wlcz","post_id":"1otoist","author":"naf165","body":"> The Last of Us' story can be effectively conveyed pretty much identically through a TV show.\n\nOh, I **strongly** disagree with that. TLOU is my go to example for a game that cannot be replicated in any other medium. Even the TV show which did an excellent job adapting to its medium never reached the peaks of the game.\n\nSo much of the quality of that game comes explicitly from being interactive.\n\n> The peak of video game writing is when the interactivity actually ties into what you're doing.\n\nTo your own own point here, which I agree with, I think perfectly captures why TLOU is so amazing. You aren't watching someone else's life happen, you are living all those moments, and having a real psychological bonding experience.\n\nWhen you press triangle to high five Ellie, you feel the joy of having just worked together to solve a problem, or vice versa, if you leave her hanging, YOU feel like a piece of shit for snubbing her like that. In both cases, that's you as a player forming that bond, in a way that simply watching Joel on the screen do it could never achieve the same level of connection.\n\nThe narrative works so well because so much of it is happening outside of the cutscenes. It happens in the random moments where you as a player approach something and a conversation starts with some optional dialogue, or you discover moments of passive storytelling from simply analyzing and existing in the world.\n\nIf you turn around after the conversation with Henry and Sam, you can see Ellie pocket an extra toy for him, and now you two have a little secret you're harboring. But only if you as the player uncover that. You could just not look back and never see that. Whereas a movie would have to explicitly frame and show that moment happening in a way that either the viewer could never miss, or the viewer could never have that shared moment. A choice has to be made by the director to either have Joel notice it or not. The fact that it is missable and a direct result of the player's actual actions makes it feels so much more powerful and real.\n\nAnd that kind of thing happens over and over and over again. Not to mention the synergy between Joel being a bit old and not in prime shape with the controls feeling a bit rough and cumbersome, meanwhile Ellie is young and nimble and feels fast and fluid to control. \n\nOr the way that the game trains you in a Pavlovian way to do ladder hunts and jump boosts and then flips that on its head with the giraffe sequence. That kind of narrative beat/twist hits so hard, and it simply cannot be done in a movie or TV show.\n\nThere's just so much narrative to gameplay synergy and thought in every single element.\n\n> Take Outer Wilds\n\nI love Outer Wilds as a game, I could write a huge essay about why its game design choices are masterful. I found its plot utterly forgettable and sometimes annoying with how much reaching I had to do so keep narrative cohesion and not just tap out and become fully un-immersed. I'm glad you enjoyed it though!","created_utc":1762846305.0,"parent_id":"t1_no8u66i","link_id":"t3_1otoist","score":2,"is_submitter":false}
{"comment_id":"no7fu3q","post_id":"1otoist","author":"ConceptsShining","body":"No problem! And incidentally on these kinda tips, if anyone happens to not know and be interested, I've pinned to my profile a guide to find out when videos were added to a YouTube playlist!","created_utc":1762823728.0,"parent_id":"t1_no7fgz1","link_id":"t3_1otoist","score":4,"is_submitter":false}
{"comment_id":"no924e7","post_id":"1otoist","author":"Samanthacino","body":"For me, it's not the plot of Outer Wilds that makes it masterful. It's the larger narrative themes of curiosity, discovery, and existentialism that are reinforced directly by the gameplay. As the game says, \"The universe is, and we are\", which is reinforced by the way the game was crafted around unflinching laws of nature.\n\nThe ship is hard to control because it's Newtonian, for example, and grappling with the fact that the universe is indifferent to the plights of man is done through gameplay. In the face of a lack of a directed motivation, each player must chart their own course through the stars and let their curiosity and self-directed motivation guide them. Ideally, by the end of an Outer Wilds playthrough the player is feeling those themes/subtext, without the game ever telling them explicitly.\n\nTo me, that's far more interesting and mechanically driven narrative themes than \"You pressed Triangle to high five Ellie\".\n\nAs for the TLOU show, I feel like it's worse than the game not because of its lack of interactive segments, but just subpar writing/performances. Imo if you watched those \"Last of Us no commentary cutscene full movie\" compilations on Youtube, intercut with some of the action setpieces, you'd have experienced most of what that game has to offer.","created_utc":1762849686.0,"parent_id":"t1_no8wlcz","link_id":"t3_1otoist","score":4,"is_submitter":false}
